Функция ГруппаДоставки_Из_Api(стр) Экспорт
	КодКоробки	= "гд_" + Формат(Число(стр.id), "ЧЦ=11; ЧВН=; ЧГ=0");
	Если стр.orders.order.Количество() = 0 Тогда
		СтатусГруппыДоставки	= Перечисления.СтатусыГруппыДоставки.empty;
	Иначе
		СтатусГруппыДоставки	= Перечисления.СтатусыГруппыДоставки[стр.status];
	КонецЕсли;
	параметрыКоробки	= Новый Структура;
	параметрыКоробки.Вставить("ВидСтикера", 				Перечисления.ВидыСтикеров.ГруппаДоставки);
	параметрыКоробки.Вставить("СтатусГруппыДоставки", 		СтатусГруппыДоставки);
	параметрыКоробки.Вставить("ТочкаСбора", 				СП_РаботаСоСправочниками.ПолучитьПунктВыдачиПо_Коду(стр.distributor_code));
	параметрыКоробки.Вставить("ТочкаНазначения", 			?(	стр.recipient_code = "",
																Справочники.ТочкиРаздачи.ТочкаНеОпределена, 
																СП_РаботаСоСправочниками.ПолучитьПунктВыдачиПо_Коду(стр.recipient_code)));
	параметрыКоробки.Вставить("УчастникГД", 				СП_РаботаСоСправочниками.ПолучитьУчастникаПо_Коду(стр.uid));
	параметрыКоробки.Вставить("МинДатаДоставки", 			СтоСПОбмен_Общий.ДатаИзСтроки(стр.min_delivery_date));
	параметрыКоробки.Вставить("МаксДатаДоставки", 			СтоСПОбмен_Общий.ДатаИзСтроки(стр.max_delivery_date));
	параметрыКоробки.Вставить("СрокХраненияГруппы", 		стр.date_range_limit);
	параметрыКоробки.Вставить("ДатаЗагрузки", 				СтоСПОбмен_Общий.ДатаИзСтроки(стр.created_at));
	параметрыКоробки.Вставить("ДатаМодификации", 			СтоСПОбмен_Общий.ДатаИзСтроки(стр.updated_at));
	параметрыКоробки.Вставить("МетодОплаты", 				?(	стр.payment_method = "", 
																Перечисления.МетодыОплаты.ПустаяСсылка(),
																Перечисления.МетодыОплаты[стр.payment_method]));
	параметрыКоробки.Вставить("ДатаЗагрузки", 				СтоСПОбмен_Общий.ДатаИзСтроки(стр.created_at));
	параметрыКоробки.Вставить("Состав", 					стр.orders);
	параметрыКоробки.Вставить("Догрузить", 					Ложь);

	стр.Ссылка			= СП_РаботаСоСправочниками.ПолучитьКоробкуПо_Коду(КодКоробки);
	СП_РаботаСоСправочниками.ОбновитьКоробку(стр.Ссылка, параметрыКоробки);

КонецФункции	