
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОбИзменении(Объект.Ссылка);
КонецПроцедуры


&НаКлиенте
Процедура ВесПриИзменении(Элемент)
	Объект.ДатаВзвешивания=ТекущаяДата();
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьАдрес(Команда)
	ПолучитьАдресНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьАдресНаСервере()
	ТЗ=Объект.Состав.Выгрузить(,"Покупка,Участник");
	СПЗаказыТК.ПолучитьАдресаНаТЗЗаказов(ТЗ)
КонецПроцедуры

&НаКлиенте
Процедура Взвесить(Команда)
	формаОтправления=ПолучитьФорму("Документ.ОтправлениеТранзита.Форма.ФормаДокумента",новый Структура("ГруппаДоставки,ТочкаНазначения",Объект.Ссылка,Объект.ТочкаНазначения));
	ДанныеФормы = формаОтправления.Объект;
	ВзвеситьНаСервере(ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, формаОтправления.Объект);
	формаОтправления.Открыть();
КонецПроцедуры

Процедура ВзвеситьНаСервере(ДанныеФормы)
	
	
	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьССайта(Команда)
	списокКодов = новый СписокЗначений;
	списокКодов.Добавить(Объект.Ссылка);
	СтоСПОбмен_ГруппыДоставки.Загрузить_ПоКодам(списокКодов);
	Прочитать();
	ОбновитьОтображениеДанных();
	ОповеститьОбИзменении(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СоставУдалитьПриИзменении(Элемент)
	Элементы.Состав.ТекущиеДанные.Исключить = не Элементы.Состав.ТекущиеДанные.Удалить;
КонецПроцедуры

&НаКлиенте
Процедура СоставИсключитьПриИзменении(Элемент)
	Элементы.Состав.ТекущиеДанные.Удалить = не Элементы.Состав.ТекущиеДанные.Исключить;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчикаОбъект
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры


	

