

Процедура СохранитьОтправитьФайлыОтчетов(ПериодОтчета) экспорт
	Дата			= КонецМесяца(ПериодОтчета);
	Если не ЗначениеЗаполнено(СвойПунктВыдачи) Тогда
		СвойПунктВыдачи = Константы.СвояТочка.Получить();
	КонецЕсли;

		
	ПутьОтчета 		= ПутьКФайлу("БВ","xlsx");
	СохраненОтчетБВ	= СП_Отчеты.СохранитьОтчетПоБесплатнойВыдачеXLSX(ПутьОтчета, Дата);
	Если СохраненОтчетБВ Тогда
		каталогнаЯД 	= Формат(Дата,"ДФ=yyyy_MM;")+"_xls";
		Если СоздатьКаталогНаЯД(каталогнаЯД) Тогда
			ОтправленОтчет = ОтправитьНаЯД(каталогнаЯД, ПутьОтчета);
		иначе	
			ОтправленОтчет = Ложь;
		КонецЕсли;
	КонецЕсли;	

	ПутьОтчетаКД 		= ПутьКФайлу("КД","xlsx");
	СохраненОтчетКД	= СП_Отчеты.СохранитьОтчетПоКурьерскойДоставкеXLSX(ПутьОтчетаКД, Дата);
	Если СохраненОтчетКД Тогда
		каталогнаЯД 	= "КД"+Формат(Дата,"ДФ=yyyy_MM;")+"_xls";
		Если СоздатьКаталогНаЯД(каталогнаЯД) Тогда
			ОтправленОтчетКД = ОтправитьНаЯД(каталогнаЯД, ПутьОтчетаКД);
		иначе	
			ОтправленОтчетКД = Ложь;
		КонецЕсли;
	КонецЕсли;	
	
	
	ПутьФайла 		= ПутьКФайлу("Свод","txt");
	
	СохраненСвод	= СоздатьФайлБесплатнойВыдачи(ПутьФайла);
	Если СохраненСвод Тогда
		каталогМесяц 	= Формат(Дата,"ДФ=yyyy_MM;");
		Если СоздатьКаталогНаЯД(каталогМесяц) Тогда
			ОтправленФайл = ОтправитьНаЯД(каталогМесяц, ПутьФайла);
		иначе	
			ОтправленФайл = Ложь;
		КонецЕсли;
	КонецЕсли;	
	
	Отправлено = (ОтправленОтчет и ОтправленФайл и ОтправленОтчетКД);	
	Если Отправлено Тогда
		ЗаписатьДатуЗапретаСОписанием(Дата);
	КонецЕсли	
	
КонецПроцедуры



Процедура ЗаписатьДатуЗапретаСОписанием(ДатаЗапрета)
	Запрос = новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДатыЗапретаИзменения.ДатаЗапрета,
		|	ДатыЗапретаИзменения.ОписаниеДатыЗапрета
		|ИЗ
		|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
		|ГДЕ
		|	ДатыЗапретаИзменения.Пользователь = Значение(Перечисление.ВидыНазначенияДатЗапрета.ДляВсехПользователей)
		|	И ДатыЗапретаИзменения.Раздел = ЗНАЧЕНИЕ(ПланВидовХарактеристик.РазделыДатЗапретаИзменения.ПустаяСсылка)
		|	И ДатыЗапретаИзменения.Объект = ЗНАЧЕНИЕ(ПланВидовХарактеристик.РазделыДатЗапретаИзменения.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	ОбщаяДатаПрочитана = Выборка.Следующий();
	
	
	Если ОбщаяДатаПрочитана и Выборка.ДатаЗапрета >= НачалоДня(ДатаЗапрета) Тогда Возврат КонецЕсли; 
	
	ПустойРаздел 	= ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПустаяСсылка();
	МенеджерЗаписи 	= РегистрыСведений.ДатыЗапретаИзменения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Раздел              		= ПустойРаздел;
	МенеджерЗаписи.Объект              		= ПустойРаздел;
	МенеджерЗаписи.Пользователь        		= Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей;
	МенеджерЗаписи.ДатаЗапрета         		= ДатаЗапрета;
	//МенеджерЗаписи.ОписаниеДатыЗапрета 	= "КонецПрошлогоМесяца";
	МенеджерЗаписи.Комментарий 				= "Установлено отчетом по бесплатной выдаче";
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.ОтчетПоБесплатнойВыдаче.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый());
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	СП_ДвиженияСервер.ОтразитьДвиженияПоРегистру("Обмен100СПрн_Ошибки", ДополнительныеСвойства, Движения, Отказ);
КонецПроцедуры
		




Функция СоздатьКаталогНаЯД(каталогМесяц)
	результат 		= Интеграция_Яндекс.СоздатьКаталогНаДиске("/FreeStorage/"+каталогМесяц);
	Возврат (Результат.КодСостояния = 200  Или Результат.КодСостояния = 201);
КонецФункции	


Функция ОтправитьНаЯД(каталогМесяц, ПутьКФайлу)
	ф = новый Файл(ПутьКФайлу);
	Если не ф.Существует() Тогда Возврат Ложь; КонецЕсли;
	
	АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу));	
	
	параметрыФайла 					= Новый Структура;
	параметрыФайла.Вставить("ПутьКФайлу", "/FreeStorage/" + каталогМесяц + "/" + ф.Имя);
	параметрыФайла.Вставить("ДвоичныеДанные", АдресФайлаВоВременномХранилище);
	Результат =  Интеграция_Яндекс.ВыгрузитьНаДиск(параметрыФайла);
	Возврат (Результат.КодСостояния = 200 Или Результат.КодСостояния = 201);
КонецФункции
	


Функция ПутьКФайлу(Название,Расширение)
	КаталогХранения	= Справочники.ТомаХраненияФайлов.БесплатнаяВыдача.ПолныйПутьWindows;
	КодПВ 				= Формат(число(СвойПунктВыдачи.Код),"ЧЦ=4; ЧВН=; ЧГ=0;");
	НаименованиеПВ		= СтрЗаменить(СвойПунктВыдачи.Наименование,"-" ,"_" );
	ИмяФайла 			= Название + "_" +формат(Дата,"ДФ=yyyy_MM_;") + КодПВ+"_"+НаименованиеПВ;		

	ПутьКФайлу	 	= КаталогХранения + ИмяФайла + "." +Расширение;
	
	Возврат ПутьКФайлу;
КонецФункции	





Функция СоздатьФайлБесплатнойВыдачи(ПутьФайла)
	файлТХТ 		= новый ТекстовыйДокумент();	
	
	тз				= СП_Отчеты.ТаблицаБесплатнойВыдаче(Дата);
	СуммаВозмещаемаяПунктуВыдачи = тз.Итог("Сумма");
	
	тз				= СП_Отчеты.ТаблицаКурьерскойДоставке(Дата);
	КоличествоКурьерскихЗаказов = тз.Итог("Количество");
	
	
	
	ПВ 			= Формат(число(СвойПунктВыдачи.Код),"ЧЦ=4; ЧВН=; ЧГ=0;");
	ТекстФайла = 	"sbv="+Формат(СуммаВозмещаемаяПунктуВыдачи,"ЧГ=0;")+";"+Символы.ПС +
					"kkd="+формат(КоличествоКурьерскихЗаказов,"ЧГ=0;")+";"+Символы.ПС +
			    	"pv="+ПВ+";";
	файлТХТ.УстановитьТекст(ТекстФайла);
	
	Попытка
		а =Новый файл(ПутьФайла);
		Если а.Существует() Тогда
			а.УстановитьТолькоЧтение(Ложь);
		КонецЕсли;
		файлТХТ.Записать(ПутьФайла);
		Возврат Истина;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
КонецФункции


Процедура ПриЗаписи(Отказ)
	ПВ 			= Формат(число(СвойПунктВыдачи.Код),"ЧЦ=4; ЧВН=; ЧГ=0;");
	имяОтчета 	= формат(Дата,"ДФ=yyyy_MM_;") + ПВ
КонецПроцедуры
 



