
Процедура ОбработкаПроведения(Отказ, Режим)
	//#Область ПравильноеПроведение
	//ПроведениеСерверСП.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	//Документы.ПередачаВозвратовОрганизаторам.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	//ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый());
	//ПроведениеСерверСП.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	//

	//ПроведениеСерверСП.ОтразитьДвиженияПоТаблице(ДополнительныеСвойства, Движения, "Возвраты", Отказ);
	//ПроведениеСерверСП.ОтразитьДвиженияПоТаблице(ДополнительныеСвойства, Движения, "Расход", Отказ);

	//#КонецОбласти
	//
	//
	
	Движения.Возвраты.Записывать = Истина;
	Для Каждого ТекСтрокаПокупки Из Покупки Цикл
		Движение = Движения.Возвраты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организатор = ТекСтрокаПокупки.Организатор;
		Движение.Участник = ТекСтрокаПокупки.Участник;
		Движение.Покупка = ТекСтрокаПокупки.Покупка;
		Движение.Количество = ТекСтрокаПокупки.Количество;
	КонецЦикла;

КонецПроцедуры

