Процедура ПроверитьУникальностьСтатусаДляГруза(ДокументОбъект, Отказ)  Экспорт
	Если ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.СчетКонтрагента") 		и ДокументОбъект.видОперации=Перечисления.ВидыОперацийСчетКонтрагента.СЭкспедиторскойКомпанией Тогда
		Статус=Перечисления.СтатусыОтправкиГруза.ДобавленСчетЭК;
	ИначеЕсли ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.СчетКонтрагента")  и ДокументОбъект.видОперации=Перечисления.ВидыОперацийСчетКонтрагента.СТранспортнойКомпанией Тогда
		Статус=Перечисления.СтатусыОтправкиГруза.ВТранспортнойКомпании;
	ИначеЕсли ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.ОтчетОДоставке")   и ДокументОбъект.видОперации=Перечисления.ВидыОперацийОтчетОДоставке.Доставлен Тогда
		Статус=Перечисления.СтатусыОтправкиГруза.Доставлен;
	ИначеЕсли ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.ОтчетОДоставке")   и ДокументОбъект.видОперации=Перечисления.ВидыОперацийОтчетОДоставке.Утрачен Тогда
		Статус=Перечисления.СтатусыОтправкиГруза.Утрачен;
	ИначеЕсли ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.ЗаявкаВТранспортнуюКомпанию") Тогда
		Статус=Перечисления.СтатусыОтправкиГруза.СформирванаЗаявкаВТК;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыДоставки.Груз,
		|	СтатусыДоставки.Регистратор
		|ИЗ
		|	РегистрСведений.СтатусыДоставки КАК СтатусыДоставки
		|ГДЕ
		|	СтатусыДоставки.Статус = &Статус
		|	И СтатусыДоставки.Регистратор <> &Регистратор
		|	И СтатусыДоставки.Груз В(&Груз)";
	
	Запрос.УстановитьПараметр("Груз", ДокументОбъект.Заказы.ВыгрузитьКолонку("Груз"));
	Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("Статус", Статус);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стр=ДокументОбъект.Заказы.Найти(Выборка.Груз,"Груз");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для "+Выборка.груз+" уже установлен статус: """+Статус+""", документом: "+Выборка.Регистратор,Выборка.Регистратор,"Заказы["+(стр.номерстроки-1)+"].Груз",,Отказ);	
	КонецЦикла;
КонецПроцедуры	

Процедура ЗаполнитьЗаявкиПоКоробкам(ДокОбъект,ТЧ,Колонка) Экспорт
	
	ТЗКоробок=ДокОбъект[ТЧ].Выгрузить(); 
	ТЗКоробок.колонки[Колонка].Имя="Груз";
	ТЗКоробок.Свернуть("Груз");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТ.Груз
		|ПОМЕСТИТЬ ТЗКоробок
		|ИЗ
		|	&ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗКоробок.Груз,
		|	ЕСТЬNULL(ЗаявкаВТранспортнуюКомпаниюЗаказы.Ссылка, ЗНАЧЕНИЕ(Документ.ЗаявкаВТранспортнуюКомпанию.ПустаяСсылка)) КАК Заявка
		| ИЗ
		|	ТЗКоробок КАК ТЗКоробок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаВТранспортнуюКомпанию.Заказы КАК ЗаявкаВТранспортнуюКомпаниюЗаказы
		|		ПО ТЗКоробок.Груз = ЗаявкаВТранспортнуюКомпаниюЗаказы.Груз
		|			И (ЗаявкаВТранспортнуюКомпаниюЗаказы.Ссылка.Проведен)";
	Запрос.Параметры.Вставить("ВТ",ТЗКоробок);
	
	РезультатЗапроса = Запрос.Выполнить();
	тз=РезультатЗапроса.Выгрузить();
	Для каждого стр из ДокОбъект[ТЧ] Цикл
		МассивСтрок=тз.НайтиСтроки(новый Структура("Груз",стр[Колонка]));
		Если МассивСтрок.Количество()>0 Тогда
			стр.Заявка=МассивСтрок[0].Заявка;
		Иначе
			стр.Заявка=Документы.ЗаявкаВТранспортнуюКомпанию.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;	
	тз.Свернуть("Заявка");
	ДокОбъект.ЗаявкиВТК.Загрузить(ТЗ);
КонецПроцедуры	
