
&НаСервере
Процедура СформироватьВыдачуТранзитаНаСервере(обВыдачаТранзитаСформы)
	Если Элементы.Список.ВыделенныеСтроки.Количество()=0 тогда Возврат; КонецЕсли;
	обВыдачаТранзита=ДанныеФормыВЗначение(обВыдачаТранзитаСформы,Тип("ДокументОбъект.ВыдачаТранзита"));
	обВыдачаТранзита.Дата=ТекущаяДата();
	
	СписокКоробок=новый СписокЗначений;
	Для Каждого стр из  Элементы.Список.ВыделенныеСтроки	 Цикл
		//Если не Элементы.Список.ТекущиеДанные.Свойство("Груз") Тогда Продолжить; КонецЕсли;
		СписокКоробок.Добавить(Стр.Груз);
	КонецЦикла;	
	обВыдачаТранзита.ЗаполнитьПоСпискуКоробок(СписокКоробок);
	

	ЗначениеВДанныеФормы(обВыдачаТранзита,обВыдачаТранзитаСформы);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВыдачуТранзита(Команда)
	Фрм=ПолучитьФорму("Документ.ВыдачаТранзита.Форма.ФормаДокумента",,ЭтаФорма);
	обВыдачаТранзитаСформы=фрм.Объект;	
	СформироватьВыдачуТранзитаНаСервере(обВыдачаТранзитаСформы);
	КопироватьДанныеФормы(обВыдачаТранзитаСформы,фрм.объект);
	фрм.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если не Элементы.Список.ТекущиеДанные=неопределено и Элементы.Список.ТекущиеДанные.Свойство("Груз") Тогда
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("Груз",Элементы.Список.ТекущиеДанные.Груз);
	Иначе
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("Груз",Неопределено);
	КонецЕсли;	
КонецПроцедуры

//&НаКлиенте
//Процедура СписокПриАктивизацииСтрокиНаСервере()
//	СписокДокументов.Параметры

//КонецПроцедуры

&НаСервере
Процедура СформироватьЗаявкуНаСервере(обЗаявкаСформы)
	Если Элементы.Список.ВыделенныеСтроки.Количество()=0 тогда Возврат; КонецЕсли;
	обЗаявка=ДанныеФормыВЗначение(обЗаявкаСформы,Тип("ДокументОбъект.ЗаявкаВТранспортнуюКомпанию"));
	обЗаявка.ДатаЗаявки=ТекущаяДата();
	Для Каждого стр из  Элементы.Список.ВыделенныеСтроки	 Цикл
	//	Если не Элементы.Список.ТекущиеДанные.Свойство("Груз") Тогда Продолжить; КонецЕсли;
		стрГруза=обЗаявка.Заказы.Добавить();
		стрГруза.Груз=стр.Груз;
		обЗаявка.Вес=обЗаявка.Вес+стр.Груз.Вес;
		обЗаявка.Объем=обЗаявка.Объем+стр.Груз.Объем;
	КонецЦикла;	
	ЗначениеВДанныеФормы(обЗаявка,обЗаявкаСформы);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаявку(Команда)
	Фрм=ПолучитьФорму("Документ.ЗаявкаВТранспортнуюКомпанию.Форма.ФормаДокумента",,ЭтаФорма);
	обЗаявкаСформы=фрм.Объект;
	СформироватьЗаявкуНаСервере(обЗаявкаСформы);
	КопироватьДанныеФормы(обЗаявкаСформы,фрм.объект);
	фрм.Открыть();
КонецПроцедуры

&НаСервере
Процедура СформироватьСчетТранспортнойКомпанииНаСервере(обСчетаТКСформы)
	Если Элементы.Список.ВыделенныеСтроки.Количество()=0 тогда Возврат; КонецЕсли;
	обСчетаТК=ДанныеФормыВЗначение(обСчетаТКСформы,Тип("ДокументОбъект.СчетКонтрагента"));
	обСчетаТК.ДатаОтправкиГруза=ТекущаяДата();
	обСчетаТК.ВидОперации=Перечисления.ВидыОперацийСчетКонтрагента.СТранспортнойКомпанией;
	Для Каждого стр из  Элементы.Список.ВыделенныеСтроки	 Цикл
	//	Если не Элементы.Список.ТекущиеДанные.Свойство("Груз") Тогда Продолжить; КонецЕсли;
		стрГруза=обСчетаТК.Заказы.Добавить();
		стрГруза.Груз=стр.Груз;
	КонецЦикла;	
	ЗначениеВДанныеФормы(обСчетаТК,обСчетаТКСформы);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСчетТранспортнойКомпании(Команда)
	Фрм=ПолучитьФорму("Документ.СчетКонтрагента.Форма.ФормаДокумента",,ЭтаФорма);
	обСчетаТКСформы=фрм.Объект;
	СформироватьСчетТранспортнойКомпанииНаСервере(обСчетаТКСформы);
	КопироватьДанныеФормы(обСчетаТКСформы,фрм.объект);
	фрм.Открыть();
КонецПроцедуры
