#Область ШтрихКоды

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если 	ИмяСобытия 	= "ScanData" 					и
			Источник 	= "ПодключаемоеОборудование" 	и
			ВводДоступен()										Тогда
			
			ШК 			= СтоСП_Клиент.ПолучитьШКизПараметров(Параметр);
			ОбработатьШКнаКлиенте(ШК);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
КонецПроцедуры

&НаКлиенте
Функция ОбработатьШКнаКлиенте(ШК)
	ДанныеШК    = СП_Штрихкоды.ПолучитьДанныеПоШК(ШК);
	Если Строка(ДанныеШК.Тип) 	= "Карта участника (22)"	или
		 Строка(ДанныеШК.Тип) 	= "Карта участника (23)"			Тогда
		ЗаполнитьПоКартеНаСерввере(ДанныеШК)	
	ИначеЕсли Строка(ДанныеШК.Тип) 		= "Сотрудник (55)" 			Тогда	
		Если СП_РаботаСДокументами_Клиент.ЗаписатьДокумент(этотОбъект,,ДанныеШК.Сотрудник) Тогда
			Закрыть();
		КонецЕсли;				
	КонецЕсли;		

КонецФункции	



#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьПоОрганизатору(Команда)
	ЗаполнитьПоОрганизаторуНаСерввере();
КонецПроцедуры

Процедура ЗаполнитьПоОрганизаторуНаСерввере()
	Объект.Карта					=Справочники.КартыУчастников.ПустаяСсылка();
	обПередачаВозвратовОрганизатору	=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПередачаВозвратовОрганизатору"));
	обПередачаВозвратовОрганизатору.заполнитьОстатками();
	ЗначениеВДанныеФормы(обПередачаВозвратовОрганизатору,Объект);
КонецПроцедуры

Процедура ЗаполнитьПоКартеНаСерввере(ДанныеШК)
	орг_ссылка	= СП_РаботаСоСправочниками.ПолучитьОрганизатораПо_Коду(ДанныеШК.КартаУчастника.Владелец.Код);
	Если ЗначениеЗаполнено(орг_ссылка) тогда
		Объект.Организатор	= орг_ссылка;
		Объект.Карта		= ДанныеШК.КартаУчастника;
		ЗаполнитьПоОрганизаторуНаСерввере();
	КонецЕсли	
КонецПроцедуры





&НаКлиенте
Процедура ОрганизаторПриИзменении(Элемент)
	ЗаполнитьПоОрганизаторуНаСерввере()
КонецПроцедуры

&НаКлиенте
Процедура ОрганизаторОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Объект.Проведен  Тогда
		   Сообщить("Для смены организатора отмените проведение документа!!!");
			СтандартнаяОбработка=ложь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Сканер штрихкода
   СтоСП_Клиент.ПодключитьСканерШК(УникальныйИдентификатор);
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
   
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СП_РаботаСДокументами.ПриСозданииНаСервере(ЭтотОбъект);	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
 


