//&НаКлиенте
//Процедура Архивирование()
//	ЗипФайл=новый ЗаписьZipФайла(ПролучитьПутьВыгрузки()+"\Unloading.zip");
//	ЗипФайл.Добавить(ПролучитьПутьВыгрузки()+"\Saldo.xml");
//	ЗипФайл.Добавить(ПролучитьПутьВыгрузки()+"\Supply.xml");

//	ЗипФайл.Записать();
//КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ВыбратьПриход()
//	СписокЗначений= Новый СписокЗначений;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ПриходнаяПокупки.Покупка,
//		|	ПриходнаяПокупки.МестоХранения,
//		|	ПриходнаяПокупки.Габарит,
//		|	ПриходнаяПокупки.Оплачен,
//		|	ПриходнаяПокупки.Ссылка.Дата,
//		|	ПриходнаяПокупки.Участник.Код КАК Участник,
//		|	ПриходнаяПокупки.Организатор.Код КАК Организатор,
//		|	ПриходнаяПокупки.Ссылка.Проведен
//		|ИЗ
//		|	Документ.Приходная.Покупки КАК ПриходнаяПокупки
//		|ГДЕ
//		|	ПриходнаяПокупки.Ссылка.Дата МЕЖДУ &ДатаБ И &ДатаЕ
//		|	И ПриходнаяПокупки.Ссылка.Проведен = ИСТИНА
//		|	И ПриходнаяПокупки.Ссылка.Транзит = ЛОЖЬ";

//	ДатаБ=НачалоДня(Константы.ПоследняяВыгрузка.Получить());
//	ДатаЕ=КонецДня(ТекущаяДата());

//	Запрос.УстановитьПараметр("ДатаБ", НачалоДня(ДатаБ));
//	Запрос.УстановитьПараметр("ДатаЕ", КонецДня(ДатаЕ));
//	Запрос.УстановитьПараметр("Истина", Истина);

//	Результат = Запрос.Выполнить();

//	ВыборкаДетальныеЗаписи = Результат.Выбрать();

//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		Массив	=Новый Массив(1);
//		Массив.Добавить(Строка(ВыборкаДетальныеЗаписи.Покупка));
//		Массив.Добавить(Строка(ВыборкаДетальныеЗаписи.МестоХранения));
//		Массив.Добавить(Строка(ВыборкаДетальныеЗаписи.Габарит));
//		Массив.Добавить(Строка(ВыборкаДетальныеЗаписи.Оплачен));
//		Массив.Добавить(Строка(ВыборкаДетальныеЗаписи.Дата));
//		Массив.Добавить(Строка(ВыборкаДетальныеЗаписи.Участник));
//		Массив.Добавить(Строка(ВыборкаДетальныеЗаписи.Организатор));
//		СписокЗначений.Добавить(Массив);
//	КонецЦикла;
//	Возврат СписокЗначений;
//	

//КонецФункции

//&НаКлиенте
//Процедура ВыгрузитьПриход()
//	ЗаписьXML=новый ЗаписьXML;
//	ЗаписьXML.ОткрытьФайл(ПролучитьПутьВыгрузки()+"\Supply.xml");
//	ЗаписьXML.ЗаписатьОбъявлениеXML();
//	
//	ЗаписьXML.ЗаписатьНачалоЭлемента("megaorders");
//	//ЗаписьXML.ЗаписатьНачалоЭлемента("supply");
//	//ЗаписьXML.ЗаписатьАтрибут("xmlns:xs","http://www.w3.org/2001/XMLSchema-instance");
//	//ЗаписьXML.ЗаписатьАтрибут("xmlns:xsd","http://www.w3.org/2001/XMLSchema-instance");
//	СЗ=ВыбратьПриход();	
//	Для сч=0 по сз.количество()-1  Цикл
//		
//		ЗаписьXML.ЗаписатьНачалоЭлемента("item");

//		
//		ДобавитьЭлементXML(ЗаписьXML,"pid",СтрЗаменить(Формат(Число(СЗ[сч].Значение[1]),"ЧРГ=_"),"_",""));          //Покупка
//	//	ДобавитьЭлементXML(ЗаписьXML,"position",СЗ[сч].Значение[2]);	//МестоХранения
//	//	ДобавитьЭлементXML(ЗаписьXML,"size",СЗ[сч].Значение[3]);		//Габарит
//		ДобавитьЭлементXML(ЗаписьXML,"paid",?(СЗ[сч].Значение[4]="Да","1","0"));     //Оплачен
//		ДобавитьЭлементXML(ЗаписьXML,"date",СЗ[сч].Значение[5]);		//ДатаПрихода
//		ДобавитьЭлементXML(ЗаписьXML,"uid",СтрЗаменить(Формат(Число(СЗ[сч].Значение[6]),"ЧРГ=_"),"_",""));     	//Участник
//		ДобавитьЭлементXML(ЗаписьXML,"org",СтрЗаменить(Формат(Число(СЗ[сч].Значение[7]),"ЧРГ=_"),"_",""));
//		Состояние("Приход: "+СЗ[сч].Значение[1]+" "+СЗ[сч].Значение[2]+" "+СЗ[сч].Значение[3]++" "+СЗ[сч].Значение[6]+" "+СЗ[сч].Значение[7]);
//		
//		ЗаписьXML.ЗаписатьКонецЭлемента();
//	КонецЦикла;
//	
//	
//	//ЗаписьXML.ЗаписатьКонецЭлемента();
//	ЗаписьXML.ЗаписатьКонецЭлемента();

//	ЗаписьXML.Закрыть();

//КонецПроцедуры // ВыгрузитРасход()
// &НаКлиенте
//Процедура ДобавитьЭлементXML(ЗаписьXML,Название,Значение)
//	ЗаписьXML.ЗаписатьНачалоЭлемента(Название);
//	ЗаписьXML.ЗаписатьТекст(Значение);
//	ЗаписьXML.ЗаписатьКонецЭлемента();
//КонецПроцедуры // ДобавитьЭлементXML()






&НаКлиенте
Процедура ОтправитьNew(Команда)
	аСППрив.ВыполнитьВыгрузкунаСайт();
КонецПроцедуры

&НаКлиенте
Процедура ОтветССайта(Команда)
	аСПОбменССайтом.АнализОтветаССайта()
КонецПроцедуры



