
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//КодГородаНазначения=Параметры.КодГородаНазначения;
	ПолучитьПунктыВыдачиДПД();
	
КонецПроцедуры

&НаКлиенте
Процедура КодГородаНазначенияПриИзменении(Элемент)
	ПолучитьПунктыВыдачиДПД(); 
КонецПроцедуры


Процедура ПолучитьПунктыВыдачиДПД() 
	Отказ=Ложь;
	тЗ=Интеграция_DPD.ПолучитьСписокПунктовСОграничениеПоВесу(,ГородНазначения);
	
	Если  тЗ<>неопределено Тогда
		СписокТочек.Загрузить(тз);
	КонецЕсли;
	//
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ГородНазначения=Параметры.ГородНазначения;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ОповеститьОВыборе(Элементы.СписокТочек.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокТочекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОповеститьОВыборе(Элементы.СписокТочек.ТекущиеДанные);
КонецПроцедуры



