Функция ПечатьГрупповыхСтикеров(ПараметрыПечати) Экспорт
	
	////форма=ПолучитьФорму("Обработка.ПечатьСтикеровДляКоробок.Форма");
	////ДанныеФормы = Форма.Объект;
	////ПечатьГрупповыхСтикеров(МассивОбъектов,ДанныеФормы);
	////КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	////
	////ПараметрКоманды = Новый Массив;   // Добавим объект обработки печати ценников и этикеток в массив параметров печати.
	////ПараметрКоманды.Добавить(Форма.Объект); // В дальнейшем будем обращаться к объекту через ПараметрКоманды[0]
	РежимПечати = "Этикетки";
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
	"Обработка.ПечатьСтикеровДляКоробок", // Для вызова метода менеджера обработки "Печать".
	РежимПечати,
	ПараметрыПечати,
	, // Форма владелец
	//Новый Структура("Шаблон", Шаблон));
	);

КонецФункции
