
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка		= Ложь;
	СхемаКомпоновкиДанных 		= ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки 					= КомпоновщикНастроек.ПолучитьНастройки(); 
 
	ДанныеРасшифровки 			= Новый ДанныеРасшифровкиКомпоновкиДанных; 
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных;	
	МакетКомпоновки 			= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
	
	втИсторияЗаказов			= СтоСПОбмен_СтатусыЗаказов.ПолучитьИсториюДоставки(Мегаордер);
	
	ВнешнийНаборДанных 			= Новый Структура("втИсторияЗаказов", втИсторияЗаказов); 
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки,,); 
	
	ДокументРезультат.Очистить();
	
 	ПроцессорВывода 			= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
КонецПроцедуры
