
&НаСервере
Процедура ЗаполнитьНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПакетНаСайт"));
	об.ЗаполнитьТаблицы();
	ЗначениеВДанныеФормы(об,Объект);	
КонецПроцедуры


Функция ПолучитьЗапросПоОбъекту(Объект)
	ЗначениеСортировки="";	
	Если Найти(Объект,"Справочник")>0 Тогда
		ЗначениеСортировки="Код";
	ИначеЕсли Найти(Объект,"Документ")>0 Тогда
		ЗначениеСортировки="Номер";
	КонецЕсли;
	Возврат "ВЫБРАТЬ ПЕРВЫЕ 99999
	|	ОбъектВыгрузки.Ссылка КАК объект,
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбменССайтом.Объект), 0) КАК количество
	|ИЗ
	|	"+Объект+" КАК ОбъектВыгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбменССайтом КАК ОбменССайтом
	|		ПО (ОбменССайтом.Объект = ОбъектВыгрузки.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектВыгрузки.Ссылка
	|
	|ИМЕЮЩИЕ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбменССайтом.Объект), 0) = 0 "+?(ЗначениеСортировки="Документ","ОбъектВыгрузки.Проведен "," ")+
	?(ЗначениеСортировки="","","
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектВыгрузки."+ЗначениеСортировки);
КонецФункции	

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьХМЛНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПакетНаСайт"));
	об.СериолизоватьВХМЛ();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьХМЛ(Команда)
	СформироватьХМЛНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПакетНаСайт"));
	об.ОтправитьНаСайт();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
	Записать();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусТранзитовНаСервере()
	Для каждого стр из Объект.Транзиты	Цикл
		стр.Статус=Перечисления.СтатусОтпавкиНаСайт.Отправлен;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтатусТранзитов(Команда)
	ЗаполнитьСтатусТранзитовНаСервере();
КонецПроцедуры



&НаКлиенте
Процедура РазобратьПолученныеДанные(Команда)
	РазобратьПолученныеДанныеНаСервере()
КонецПроцедуры

Процедура РазобратьПолученныеДанныеНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПакетНаСайт"));
	об.ДесериализоватьИзХМЛ();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры
