
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	об				= Супергруппа.ПолучитьОбъект();
	об.Комментарий	= Комментарий;
	об.Маршрут.Загрузить(Маршрут.Выгрузить());
	Попытка
		об.Записать();	
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось обновить супергруппу",,,,Отказ);	
	КонецПопытки;
	
	
	#Область ПравильноеПроведение
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.ЗаполнитьСупергруппу.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый());
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	СтоСПОбмен_Общий.ОтразитьСтоСПОбмен_РН(ДополнительныеСвойства, Движения, Отказ);
	#КонецОбласти

КонецПроцедуры







