
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
    КомандаПечати 					= КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати 	= "Документ.ПеремещениеВозврата";
    КомандаПечати.Идентификатор 	= "ПеремещениеВозврата";
	КомандаПечати.Картинка 			= БиблиотекаКартинок.Печать;
    КомандаПечати.Представление 	= НСтр("ru = 'Перемещение возврата (чек)'");
	
	
КонецПроцедуры



// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  – Массив    – ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати – Структура – дополнительные настройки печати;
//  КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         – СписокЗначений  – значение – ссылка на объект;
//                                            представление – имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       – Структура       – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	#Если Сервер Тогда 
	ИмяМакета = "ПеремещениеВозврата";	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета);
    Если НужноПечататьМакет Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        ИмяМакета,          
        НСтр("ru = 'Перемещение возврата (чек)'"),
        Печать_ЧекПеремещениеВозврата(МассивОбъектов, ОбъектыПечати),
        ,
        "Документ.ПеремещениеВозврата.ПФ_MXL_ЧекПеремещениеВозврата");
	КонецЕсли;
#КонецЕсли 	
КонецПроцедуры


Функция Печать_ЧекПеремещениеВозврата(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент	= Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб=Истина;
	ТабличныйДокумент.ПолеСлева=0;
	ТабличныйДокумент.ПолеСправа=0;	 
	
	Макет 	= Документы.ПеремещениеВозврата.ПолучитьМакет("ПФ_MXL_ЧекПеремещениеВозврата");
	
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
	ОбластьПокупки = Макет.ПолучитьОбласть("Покупки");
	
	
	Запрос 	= Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеВозврата.Дата,
	|	ПеремещениеВозврата.Номер,
	|	ПеремещениеВозврата.Покупки.(
	|		Организатор КАК организатор,
	|		Участник,
	|		Покупка,
	|		Количество
	|	)
	|ИЗ
	|	Документ.ПеремещениеВозврата КАК ПеремещениеВозврата
	|ГДЕ
	|	ПеремещениеВозврата.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПеремещениеВозврата.Покупки.Организатор.Наименование";
	
	Запрос.Параметры.Вставить("МассивОбъектов", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();

	ТабличныйДокумент.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбластьШапка.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапка, Выборка.Уровень());

		ВыборкаПокупки = Выборка.Покупки.Выбрать();
		Пока ВыборкаПокупки.Следующий() Цикл
			ОбластьПокупки.Параметры.Заполнить(ВыборкаПокупки);
			ТабличныйДокумент.Вывести(ОбластьПокупки, ВыборкаПокупки.Уровень());
		КонецЦикла;
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	Возврат ТабличныйДокумент;
КонецФункции	

