
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Возвраты.Записывать = Истина;
	Для Каждого ТекСтрокаПокупки Из Покупки Цикл
		Движение 				= Движения.Возвраты.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Организатор 	= ТекСтрокаПокупки.Организатор;
		Движение.Участник 		= ТекСтрокаПокупки.Участник;
		Движение.Покупка 		= ТекСтрокаПокупки.Покупка;
		Движение.Количество 	= ТекСтрокаПокупки.Количество;
		Движение.МестоХранения 	= ТекСтрокаПокупки.МестоХранения;

		Движение.Партия 		= ТекСтрокаПокупки.Партия;
	КонецЦикла;

КонецПроцедуры

