
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДляОтбора") Тогда
		
		Список.Отбор.Элементы.Очистить();	
		
		элемОтбора=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		элемОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ПокупкаСсылка");
		элемОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
		элемОтбора.ПравоеЗначение=Параметры.ДляОтбора.Покупка;
		элемОтбора.Использование=Истина;
		
		элемОтбора=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		элемОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Участник");
		элемОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
		элемОтбора.ПравоеЗначение=Параметры.ДляОтбора.Участник;
		элемОтбора.Использование=Истина;

	КонецЕсли;	
КонецПроцедуры
