
&НаКлиенте
Процедура Проверка(Команда)
	

ПолучитьЗначениеXDTO();	
	
	
	
	
	
КонецПроцедуры





&НаСервере
Функция  ПолучитьЗначениеXDTO()
		
 	cardsТип 			= 	ФабрикаXDTO.Тип("http://www.100sp.ru/api/cards_request.php", "cards"); 

	itemТип=                ФабрикаXDTO.Тип("http://www.100sp.ru/api/cards_request.php", "item"); 
	
	
	карты = ФабрикаXDTO.Создать(cardsТип); 
	

	итем= ФабрикаXDTO.Создать(itemТип);
	итем.uid 		=   "1uid";
	итем.id         =   "1id" ;
	итем.requested  =   "1date";
	карты.item.Добавить(итем);
	
    итем= ФабрикаXDTO.Создать(itemТип);
	итем.uid 		=   "2uid";
	итем.id         =   "2id" ;
	итем.requested  =   "2date";
	карты.item.Добавить(итем);
	
	ИмяФайла = "c:\2\struct.xml"; 

	
	МойXML = Новый ЗаписьXML; 

	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Ложь); 

	МойXML.ОткрытьФайл(ИмяФайла, ПараметрыЗаписиXML); 

	МойXML.ЗаписатьОбъявлениеXML(); 

	ФабрикаXDTO.ЗаписатьXML(МойXML, карты); 

	МойXML.Закрыть(); 
	возврат истина;
	

КонецФункции //  ПолучитьЗначениеXDTO()

