Процедура ЗаполнитьОшибками(ВерхняяГраницаОшибки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Обмен100СПрн_ОшибкиОстатки.типОбмена КАК типОбмена,
		|	Обмен100СПрн_ОшибкиОстатки.Партия КАК Партия,
		|	Обмен100СПрн_ОшибкиОстатки.СтрокаВПартии КАК СтрокаВПартии,
		|	Обмен100СПрн_ОшибкиОстатки.Мегаордер КАК Мегаордер,
		|	Обмен100СПрн_ОшибкиОстатки.СообщениеОшибки КАК Сообщение,
		|	Обмен100СПрн_ОшибкиОстатки.КоличествоНеИсправленныхОстаток КАК КоличествоНеИсправленных
		|ИЗ
		|	РегистрНакопления.Обмен100СПрн_Ошибки.Остатки(&НаДату, ) КАК Обмен100СПрн_ОшибкиОстатки";
	Запрос.Параметры.Вставить("НаДату",?(ЗначениеЗаполнено(ВерхняяГраницаОшибки),ВерхняяГраницаОшибки,ТекущаяДата()));
	РезультатЗапроса = Запрос.Выполнить();

	Ошибки.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры	

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Область ПравильноеПроведение
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.ЗакрытиеОшибокОбмена.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый());
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	СтоСПОбмен_Общий.ОтразитьСтоСПОбмен_РН_Ошибки(ДополнительныеСвойства, Движения, Отказ);
	
	#КонецОбласти
	
КонецПроцедуры
