&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
      
      СтруктураДанных = Новый Структура;
      СтруктураДанных.Вставить("Организатор", "Организатор");
	  //СтруктураДанных.Вставить("Менеджер", "Контрагент.ОсновнойМенеджерПокупателя");
	  //СтруктураДанных.Вставить("ДоговорКонтрагента", "ДоговорКонтрагента");

      ЗначенияРасшифровки = ПолучитьДанныеРасшифровки(Расшифровка, СтруктураДанных);
      Если ЗначенияРасшифровки = неопределено Тогда Возврат; КонецЕсли;
      СтандартнаяОбработка = Ложь;
      обрРасшифровки	= новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет));
      
      выпДействие		= ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет;
	  
	  ПараметрВыполненогоДействия	=  Неопределено;
	  
	  ДоступныеДействия	= Новый Массив;      
      ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
      ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
      ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить);
      ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать);
      ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Сгруппировать);
      ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Упорядочить);
      
      ДополнительныеПункты	= новый СписокЗначений();
      ДополнительныеПункты.Добавить("РасшифровкаПоЗаказам", 		"Расшифровка по заказам");
  
      обрРасшифровки.ВыбратьДействие(Расшифровка, выпДействие ,ПараметрВыполненогоДействия,ДоступныеДействия,ДополнительныеПункты);

	 Если выпДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда
	 	
	 ИначеЕсли выпДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда	
	 	ОткрытьЗначение(ПараметрВыполненогоДействия);
	 ИначеЕсли выпДействие = "РасшифровкаПоЗаказам" Тогда	
	 	
		ПараметрыОтчета = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
		НачалоПериода	= ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета")).Значение.ДатаНачала;
		КонецПериода	= ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета")).Значение.ДатаОкончания;
		
		ПараметрыРасшифровки	= новый Структура("Организатор, НачалоПериода, КонецПериода", ЗначенияРасшифровки.Организатор, НачалоПериода, КонецПериода);
	 	ОтчетСРасшифровкой =	ПолучитьРасшифровкуПоОрганизатору(ПараметрыРасшифровки);
	 			 									
		ОткрытьФорму("Общаяформа.ФормаПросмотраТабличногоДокумента",
						ОтчетСРасшифровкой,
						ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
		//	СтоСП_Печать_Клиент.ЧекНЗРасходная(ЗначенияРасшифровки.участник,Истина);
	 ИначеЕсли выпДействие = "Движение" Тогда	
	 	ПараметрДаты	=	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(новый ПараметрКомпоновкиДанных("НаДату"));
		ПараметрыЗаполнения= Новый Структура();
		ПараметрыЗаполнения.Вставить("ДатаОтчета", 		ПараметрДаты.Значение);
//		ПараметрыЗаполнения.Вставить("ДнейХранения", 	новый структура("ПравоеЗначение, Использование, ВидСравнения",14, Истина, ВидСравненияКомпоновкиДанных.Больше) );
		ПараметрыЗаполнения.Вставить("Участник", 		новый структура("ПравоеЗначение, Использование",ЗначенияРасшифровки.участник, Истина) );
	
    	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОткрытияДвижения",ЭтаФорма);
	
		ОткрытьФорму("Документ.Движение.ФормаОбъекта",Новый структура("ПараметрыЗаполнения",ПараметрыЗаполнения) ,ЭтаФорма,,,,ОписаниеОповещения  );
			


	 КонецЕсли;	
      

//	  Если ЗначениеЗаполнено(ЗначенияРасшифровки.участник) Тогда
//		  СтандартнаяОбработка = Ложь;
//			СтоСП_Печать_Клиент.ЧекНЗРасходная(ЗначенияРасшифровки.участник);	  
//	  КонецЕсли;	
	    
	    
	    
	    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры



Функция ПолучитьРасшифровкуПоОрганизатору(ПараметрыРасшифровки)
		СхемаРасшифровки 	= Отчеты.ОтчетПоШтрафамОрганизатора2.ПолучитьМакет("Расшифровка");
	 	ОтчетСРасшифровкой 	= СП_Отчеты.ПолучитьОтчет(	ПараметрыРасшифровки,
	 													СхемаРасшифровки,
	 													"Основной");
 									
	 	Возврат ОтчетСРасшифровкой;	
//		СхемаКомпоновкиДанных 	= Отчеты.ОтчетПоШтрафамОрганизатора2.ПолучитьМакет("Расшифровка");
//		КомпоновщикНастроек		= Новый КомпоновщикНастроекКомпоновкиДанных;
//		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
//		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек["Основной"].Настройки);
//		
//		Настройки 			= КомпоновщикНастроек.Настройки;
//		ПараметрыОтчета		= Настройки.ПараметрыДанных;
//	    
//	    Параметр 				= ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организатор"));
//	    Параметр.Использование 	= Истина;
//    	Параметр.Значение 		= Организатор;
//		
//		КомпоновщикМакета 		= Новый КомпоновщикМакетаКомпоновкиДанных;
//		
//		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
//		Настройки, ,,Тип("ГенераторМакетаКомпоновкиДанных"));
//		
//		
////		ВнешниеНаборыДанных = Новый Структура;
////		ВнешниеНаборыДанных.Вставить("сверка", 	ТЗ_Сверка);
////		
//		
//		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
//		//ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,);
//		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,);
//		
//		Результат.Очистить(); 
//		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
//		ПроцессорВывода.УстановитьДокумент(Результат);
//		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
КонецФункции	



&НаКлиенте
Процедура ПослеОткрытияДвижения(Результат, ДопПараметры) Экспорт
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеРасшифровки(Расшифровка, СтруктураДанных)

      Данные_Расшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);

      Если Данные_Расшифровки <> Неопределено Тогда
            Для каждого ЭлементДанных Из СтруктураДанных Цикл
                  Родитель = Данные_Расшифровки.Элементы[Расшифровка];
                  Пока Истина Цикл
                        МассивРодителей = Родитель.ПолучитьРодителей();
                        Если МассивРодителей.Количество() = 0 Тогда
                              Прервать;
                        КонецЕсли;
                        Родитель = Родитель.ПолучитьРодителей()[0];
                        Если ТипЗнч(Родитель) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
                              Поле = Родитель.ПолучитьПоля().Найти(ЭлементДанных.Значение);
                              Если Поле <> Неопределено Тогда
                                    СтруктураДанных.Вставить(ЭлементДанных.Ключ, Поле.Значение);
                                    Прервать;
                              КонецЕсли;
                        КонецЕсли;
                  КонецЦикла;
            КонецЦикла;
      КонецЕсли;

      Возврат СтруктураДанных;

  КонецФункции // ПолучитьДанныеРасшифровки()
  
  
  
