

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ВидСтикера=Перечисления.ВидыСтикеров.ГруппаДоставки Тогда
		Элементы.Страницы.ТекущаяСтраница=Элементы.Страницы.ПодчиненныеЭлементы.ГруппаГруппаДоставки;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Строка(Объект.ВидСтикера) = "Группа доставки" Тогда
		Отказ = Истина;
		Парам  = Новый Структура("Ключ", Объект.Ссылка);
		ОткрытьФорму("Справочник.Коробки.Форма.ФормаГруппыДоставки", Парам,ЭтаФорма.ВладелецФормы,Истина,,,,ЭтаФорма.РежимОткрытияОкна);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьССайта(Команда)
	СтоСПОбмен_Коробки.Загрузить_КоробкиПоКодам(Объект.Ссылка);
	Прочитать();
	ОбновитьОтображениеДанных();
	ОповеститьОбИзменении(Объект.Ссылка);
КонецПроцедуры

