
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Супергруппа=Параметры.УстанавливаемФакт.Супергруппа;
	Объект.НомерКолена=Параметры.УстанавливаемФакт.НомерКолена;
	нашлиКолено=Объект.Супергруппа.Маршрут[Объект.НомерКолена-1];

	Объект.ТК				=нашлиКолено.ТранспортнаяКомпания;
	Объект.ДатаДоставкиПлан	=нашлиКолено.ДатаДоставкиПлан;
	Объект.ДатаДоставкиФакт	=нашлиКолено.ДатаДоставкиФакт;
	Объект.ТрэкНомер		=нашлиКолено.ТрэкНомер;
	Объект.ДокументОснование=Объект.Супергруппа.Покупка;
	Объект.Комментарий		=нашлиКолено.Комментарий;
	Если Объект.Супергруппа.ПерваяТочкаПриема<>Константы.СвояТочка.Получить() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Редактировать Супергруппу может только точка: "+Объект.Супергруппа.ПерваяТочкаПриема,,,,Отказ);
		Возврат;
	КонецЕсли;	
	//Элементы.ДатаДоставкиФакт.ТолькоПросмотр=(Объект.НомерКолена	=Объект.Супергруппа.Маршрут.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьФорму");
КонецПроцедуры
