
#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ТекстыЗапроса = Новый СписокЗначений;
	//СтоСПОбмен_Общий.Получить_ТекстЗапроса_Обмен100СП_РН(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_Возвраты(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_Транзит(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_Расход(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСерверСП.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Период", ДокументСсылка.Дата);  
	Запрос.УстановитьПараметр("ДокументОтправления", ДокументСсылка.Основание);  
КонецПроцедуры

Функция Получить_ТекстЗапроса_Возвраты(Запрос, ТекстыЗапроса, Регистры) 
	
	ИмяРегистра = "Возвраты";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	ТекстЗапроса = 
		 "ВЫБРАТЬ
		 |	&Период КАК Период,
		 |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		 |	ВозвратГруппОрганизаторуВозвраты.Организатор КАК Организатор,
		 |	Значение(Справочник.Участники.Нулевой) как участник,
		 |	ВозвратГруппОрганизаторуВозвраты.Группа КАК Покупка,
		 |	ВозвратГруппОрганизаторуВозвраты.МестоХранения КАК МестоХранения,
		 |	1 КАК Количество,
		 |	ВозвратГруппОрганизаторуВозвраты.Ссылка КАК Партия
		 |ИЗ
		 |	Документ.ВозвратГруппОрганизатору.Возвраты КАК ВозвратГруппОрганизаторуВозвраты
		 |ГДЕ
		 |	ВозвратГруппОрганизаторуВозвраты.Ссылка = &Ссылка";


	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
КонецФункции

Функция Получить_ТекстЗапроса_Транзит(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "Транзит";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	ТекстЗапроса = "ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	Транзит.ПокупкаСсылка КАК ПокупкаСсылка,
	               |	Транзит.МестоХранения КАК МестоХранения,
	               |	Транзит.Габарит КАК Габарит,
	               |	Транзит.Участник КАК Участник,
	               |	Транзит.Точка КАК Точка,
	               |	Транзит.Партия КАК Партия,
	               |	Транзит.Количество КАК Количество
	               |ИЗ
	               |	РегистрНакопления.Транзит КАК Транзит
	               |ГДЕ
	               |	Транзит.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |	И ТИПЗНАЧЕНИЯ(Транзит.ПокупкаСсылка) = ТИП(Справочник.Коробки)
	               |	И Транзит.Регистратор = &ДокументОтправления";
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция Получить_ТекстЗапроса_Расход(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "Расход";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	ТекстЗапроса = "ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	Транзит.ПокупкаСсылка КАК Покупка,
	               |	Значение(Перечисление.ТипРасхода.Транзит) как ТипРасхода,
				   |	Истина как Списано,
	               |	Транзит.Габарит КАК Габарит,
	               |	Транзит.Участник КАК Участник,
	               |	Транзит.ПокупкаСсылка.наименование КАК ПокупкаСпр,
	               |	Транзит.Количество КАК Количество
	               |ИЗ
	               |	РегистрНакопления.Транзит КАК Транзит
	               |ГДЕ
	               |	Транзит.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |	И ТИПЗНАЧЕНИЯ(Транзит.ПокупкаСсылка) = ТИП(Справочник.Коробки)
	               |	И Транзит.Регистратор = &ДокументОтправления";
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти


Функция ПолноеИмяОбъекта()
	Возврат "Документ.ВозвратГруппОрганизатору";
КонецФункции

