
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Чек)
	ТабДок = Новый ТабличныйДокумент;
	Чек(ТабДок, ПараметрКоманды);
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.АвтоМасштаб=Истина;
	ТабДок.ПолеСлева=0;
	ТабДок.ПолеСправа=0;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
//	ТабДок.КоличествоЭкземпляров=2;
	ТабДок.Напечатать();
	//ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура Чек(ТабДок, ПараметрКоманды)
	Документы.ПоступлениеКоробокДляРазбора.Чек(ТабДок, ПараметрКоманды);
КонецПроцедуры
