
Процедура ПередЗаписью(Отказ)
	Если Состав.Количество()	> 0 Тогда
		стрСостав	= Состав[0];
		Участник 	= стрСостав.Участник;
		Покупка  	= стрСостав.Покупка;
		Если ТипЗнч(стрСостав.Покупка)	<>	Тип("СправочникСсылка.Пристрой") 	Тогда 
			Организатор 				= СП_РаботаСоСправочниками.ПолучитьОрганизатораПо_Коду(?(ТипЗнч(стрСостав.Покупка)=Тип("СправочникСсылка.Покупки"),стрСостав.Покупка.Владелец.Код,стрСостав.Покупка.Организатор.Код));
			НаименованиеПристрой			=	"";	
		Иначе	
			НаименованиеПристрой			=	" пристрой";
		Конецесли;
	КонецЕсли;
	НаименованиеПосылки		= 	?(ЗначениеЗаполнено(Покупка),	Покупка.Наименование,"");
	
	Если ЗначениеЗаполнено(Покупка) Тогда
		Перезаполнить 		= Покупка.Догрузить;
		Догрузить			= Ложь;
	Иначе
		Перезаполнить 		= Истина;
		Догрузить			= Истина;
	КонецЕсли;	
	Наименование 			= "П ("+Формат(Код,"ЧГ=0")+") "+ НаименованиеПосылки;
КонецПроцедуры
