
&НаКлиенте
Процедура УчастникПриИзменении(Элемент)
//	ПриВыбореУчастника(Объект.Участник,Объект.СрокВозврата);
     ЗаполнитьТабЧасть();
	 ОбновитьОтображениеДанных();
КонецПроцедуры


Процедура ПриВыбореУчастника(Участник,СрокВозврата)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяПокупки.Ссылка КАК Расход,
		|	РасходнаяПокупки.Покупка
		|ИЗ
		|	Документ.Расходная.Покупки КАК РасходнаяПокупки
		|ГДЕ
		|	РасходнаяПокупки.Ссылка.Проведен
		|	И РасходнаяПокупки.Ссылка.Участник = &Участник
		|	И РасходнаяПокупки.Ссылка.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, &СрокВозврата * -1) И &КонецПериода";

	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("СрокВозврата", СрокВозврата);
	Запрос.УстановитьПараметр("Участник", Участник);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Объект.ВыданныеПокупки.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Объект.СрокВозврата=14;
	ЗаполнитьТабЧасть();
	ОбновитьОтображениеДанных();
	Элементы.Участник.ТолькоПросмотр=Истина;
КонецПроцедуры

Процедура ЗаполнитьТабЧасть()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(РасходОбороты.Покупка) = ТИП(Справочник.Посылки)
		|			ТОГДА РасходОбороты.Покупка.Покупка
		|		ИНАЧЕ РасходОбороты.Покупка
		|	КОНЕЦ КАК Покупка,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(РасходОбороты.Покупка) = ТИП(ЧИСЛО)
		|			ТОГДА РасходОбороты.Покупка
		|		ИНАЧЕ РасходОбороты.Покупка.Код
		|	КОНЕЦ КАК КодПокупки,
		|	РасходОбороты.ТипРасхода КАК ТипРасхода,
		|	РасходОбороты.Списано КАК Списано,
		|	РасходОбороты.Участник КАК Участник,
		|	РасходОбороты.Габарит КАК Габарит,
		|	РасходОбороты.Регистратор КАК Расход,
		|	Организаторы.Ссылка КАК Организатор
		|ИЗ
		|	РегистрНакопления.Расход.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК РасходОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организаторы КАК Организаторы
		|		ПО РасходОбороты.Покупка.Организатор.Код = Организаторы.Код
		|ГДЕ
		|	РасходОбороты.Участник = &Участник
		|
		|УПОРЯДОЧИТЬ ПО
		|	РасходОбороты.Период";

	Запрос.УстановитьПараметр("Участник", Объект.Участник);
    Запрос.УстановитьПараметр("НачалоПериода", КонецДня(Объект.НаДату)-Объект.СрокВозврата*24*60*60);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.НаДату));
	
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

    Объект.ВыданныеПокупки.Загрузить(Результат.Выгрузить());

	
	
КонецПроцедуры	

&НаКлиенте
Процедура СрокВозвратаПриИзменении(Элемент)
	ЗаполнитьТабЧасть();
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	сз=новый СписокЗначений;
	масс_выбран=Объект.ВыданныеПокупки.НайтиСтроки(новый структура("Пометка",Истина));
	Для каждого стр из масс_выбран Цикл
		Если стр.Пометка Тогда
			сз.Добавить(стр);
		КонецЕсли;
	КонецЦикла;	             
	ОповеститьОВыборе(сз);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.СрокВозврата=Константы.ДниВозврата.Получить();
КонецПроцедуры


Процедура ЗаполнитьДаннымиССайта()
	СписокУчастников=Новый СписокЗначений;
	СписокУчастников.Добавить(Объект.Участник.Код);
	
	ВыданныеПокупки_ССайта=СтоСПОбмен_Возвраты.Загрузить_ВыданныеПокупки(СписокУчастников,Объект.СрокВозврата);
	тз=ВыданныеПокупки_ССайта.Результат;
	тз.Колонки.Добавить("Организатор");
	тз.Колонки.ДатаВыдачи.Имя="Расход";
	Для каждого стр из тз Цикл
		стр.Организатор=СП_РаботаСоСправочниками.ПолучитьОрганизатораПо_Коду(стр.Покупка.Организатор.Код);
	КонецЦикла;	
	Если ВыданныеПокупки_ССайта.авторизацияВыполнена Тогда
		Объект.ВыданныеПокупки.Загрузить(ВыданныеПокупки_ССайта.Результат);
	КонецЕсли;	
		
Конецпроцедуры	

&НаКлиенте
Процедура ССайта(Команда)
	ЗаполнитьДаннымиССайта();
КонецПроцедуры
