

&НаКлиенте
Процедура НачатьОтгрузку(Команда)
	ПунктВыдачи = Элементы.СостоянияОтгрузки.ТекущиеДанные.ПунктВыдачи;
	УстановитьСостояниеОтгрузки(ПунктВыдачи, Истина);
	Элементы.СостоянияОтгрузки.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВыдачуТранзита(Команда)
	ПунктВыдачи = Элементы.СостоянияОтгрузки.ТекущиеДанные.ПунктВыдачи;
	
    ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияформыДокумента",ЭтаФорма);	
	ОткрытьФорму(	"Обработка.ВыдачаТранзита.Форма.НеПодтвержденныеПосылки",
					новый Структура("ИсточникВызова, ПунктВыдачи","ВыдачаТранзита",ПунктВыдачи),
					ЭтаФорма,Истина,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДвижениеТранзита(Команда)
		ПунктВыдачи 		= Элементы.СостоянияОтгрузки.ТекущиеДанные.ПунктВыдачи;
		ПараметрыЗаполнения	= Новый Структура();
		ПараметрыЗаполнения.Вставить("Дата", 		ТекущаяДата());
		ПараметрыЗаполнения.Вставить("ВидОперации", "ТранзитНаТранзит");
		ПараметрыЗаполнения.Вставить("БуфенаяЗона", новый структура("ПравоеЗначение, Использование, ВидСравнения",Истина, Истина, ВидСравненияКомпоновкиДанных.Равно) );
		ПараметрыЗаполнения.Вставить("Точка", 		новый структура("ПравоеЗначение, Использование", ПунктВыдачи, Истина) );
	
    	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияформыДокумента",ЭтаФорма);
	
		ОткрытьФорму("Документ.ДвижениеТранзита.ФормаОбъекта",Новый структура("ПараметрыЗаполнения",ПараметрыЗаполнения) ,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс  );

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияформыДокумента(Результат, ДопПараметры) Экспорт
	Элементы.СостоянияОтгрузки.Обновить();
КонецПроцедуры


&НаСервере
Процедура СформироватьВыдачуТранзитаНаСервере()

КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьОтгрузку(Команда)
	ПунктВыдачи = Элементы.СостоянияОтгрузки.ТекущиеДанные.ПунктВыдачи;
	УстановитьСостояниеОтгрузки(ПунктВыдачи,Ложь);
	Элементы.СостоянияОтгрузки.Обновить();
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеОтгрузки(ПунктВыдачи, ПроизводитсяОтгрузка)
	ПВ = ПунктВыдачи.ПолучитьОбъект();
	ПВ.ПроизводитсяОтгрузка = ПроизводитсяОтгрузка;
	Попытка
		ПВ.Записать();
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
КонецПроцедуры


Процедура ОтключениеНовогоПоискаВСписках(Форма)
	
//	Список = Форма.Элементы.Найти("СостоянияОтгрузки");
//	Если Список = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Список.ПоложениеСтрокиПоиска = ПоложениеСтрокиПоиска.Нет;
//	
//	ДополнениеСтрокаПоиска = Форма.Элементы.Найти("ДополнениеСтрокаПоиска");
//	Если НЕ ДополнениеСтрокаПоиска = Неопределено Тогда
//		ДополнениеСтрокаПоиска.Видимость = Ложь;
//	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтключениеНовогоПоискаВСписках(ЭтаФорма);
КонецПроцедуры


