

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	ЧтениеJSON = Новый ЧтениеJSON;
//	ЧтениеJSON.УстановитьСтроку(Параметры.Отчет);
//		
//	ТЗ = ПрочитатьJSON(ЧтениеJSON,Истина);	
//	ОтчетТаблица.Загрузить(ТЗ);
//	
//	ЧтениеJSON.Закрыть();
	
	ЧтениеJSON 		= Новый ЧтениеXML();
	ЧтениеJSON.УстановитьСтроку(Параметры.Отчет);
	ТЗ	= СериализаторXDTO.ПрочитатьXML(ЧтениеJSON);	
	ЧтениеJSON.Закрыть();
	СоздатьТаблицуОтчета(ТЗ);
		
	
КонецПроцедуры

Процедура СоздатьТаблицуОтчета(ТЗ)
	МассивТипаВыбора = Новый Массив;
	МассивТипаВыбора.Добавить(Тип("ТаблицаЗначений"));
	ОписаниеТипаВыбора 	= Новый ОписаниеТипов(МассивТипаВыбора);
	
	МассивРеквизитов 	= Новый Массив;
	ИмяТЗ 				= "ТаблицаОтчета";
	ЗаголовокТЗ 		= "Отчет";
	МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяТЗ, ОписаниеТипаВыбора, "", ЗаголовокТЗ));	
	
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		ТипыЗначений = Новый Массив;
		Для Каждого тТип Из Колонка.ТипЗначения.Типы() Цикл
			Если тТип <> Тип("Null") Тогда
				ТипыЗначений.Добавить(тТип);
			КонецЕсли;
		КонецЦикла;
		МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Новый ОписаниеТипов(ТипыЗначений), ИмяТЗ));
	КонецЦикла;
	
	
    ЭтаФорма.ИзменитьРеквизиты(МассивРеквизитов);
	эТаблица 							= Элементы.Добавить(ЗаголовокТЗ, Тип("ТаблицаФормы"), Элементы.ГруппаОтчет);
	эТаблица.ПутьКДанным 				= ИмяТЗ;
	эТаблица.Отображение 				= ОтображениеТаблицы.Список;
	эТаблица.ПоложениеКоманднойПанели 	= ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	эТаблица.ИзменятьСоставСтрок 		= Ложь;   	
	
	
        Для Каждого Колонка Из ТЗ.Колонки Цикл
            НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), эТаблица);
            НовыйЭлемент.ПутьКДанным = ИмяТЗ + "." + Колонка.Имя;
            Если Колонка.Имя = "Выб" Тогда
                НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
            Иначе
                НовыйЭлемент.Вид 					= ВидПоляФормы.ПолеВвода;
                НовыйЭлемент.КнопкаОчистки 			= Ложь;
                НовыйЭлемент.КнопкаВыбора 			= Ложь;
                НовыйЭлемент.РедактированиеТекста 	= Ложь;
                НовыйЭлемент.КнопкаОткрытия 		= Истина;
            КонецЕсли;
        КонецЦикла;
        
        ЭтаФорма.ЗначениеВРеквизитФормы(ТЗ, ИмяТЗ);	
	
//	МассивТипаВыбора = Новый Массив;
//	МассивТипаВыбора.Добавить(Тип("ТаблицаЗначений"));
//	
//	ОписаниеТипаВыбора 	= Новый ОписаниеТипов(МассивТипаВыбора);
//	
//	МассивРеквизитов 	= Новый Массив;
//	МассивРеквизитов.Добавить(Новый РеквизитФормы("ТаблицаОтчета", ОписаниеТипаВыбора, "",
//		"ТЗН"));
//
//	Для Каждого Колонка Из ТЗ.Колонки Цикл
//		МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ТаблицаОтчета"));
//	КонецЦикла;
//
//	ИзменитьРеквизиты(МассивРеквизитов);
//	ТаблицаПолейВыбора 				= Элементы.Добавить("ТЗН", Тип("ТаблицаФормы"),ЭтаФорма);
//	ТаблицаПолейВыбора.ПутьКДанным 	= "ТаблицаОтчета";
//	ТаблицаПолейВыбора.Отображение 	= ОтображениеТаблицы.Список;
//
//	ЗначениеВРеквизитФормы(ТЗ, "ТаблицаОтчета"); //этотОбъект
КонецПроцедуры