
&НаКлиенте
Процедура Выбрать(Команда)
	ВыбратьСтроку();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Источник="ОбъединениеГД" Тогда
		тз=Параметры.ВыбранныеСтроки.Выгрузить(Новый Структура("Подбор",Истина));
		тзАдреса=СПЗаказыТК.ПолучитьАдресаНаТЗЗаказов(ТЗ);
		Адреса.Загрузить(тзАдреса);
	ИначеЕсли Параметры.Источник="ОтправлениеГД" Тогда	
		тз=Параметры.ВыбранныеСтроки.Выгрузить(,"Покупка, кодЗаказа");
		тз.Свернуть("Покупка, кодЗаказа");
		Для каждого стр из тз Цикл
			Если ТипЗнч(стр.Покупка) = Тип("СправочникСсылка.Посылки") и стр.кодЗаказа = "" Тогда
				стр.КодЗаказа = стр.Покупка.Состав[0].КодЗаказа;
			КонецЕсли;	
		КонецЦикла;
		тз.Колонки.Добавить("Участник",Новый ОписаниеТипов("СправочникСсылка.Участники"));
		тз.ЗаполнитьЗначения(Параметры.Участник,"Участник");
		тзАдреса=СПЗаказыТК.ПолучитьАдресаНаТЗЗаказов(ТЗ);
		тзАдреса.Свернуть("Участник, Адрес, ФИО, Город, Регион, Телефон,Тип, Индекс, РезультатОбмена, email, КодПВЗ, cityCode, Улица, Дом, Квартира");		
		Адреса.Загрузить(тзАдреса);
	Иначе	
		тз=ДанныеФормыВЗначение(Параметры.ВыбранныеСтроки,Тип("ТаблицаЗначений"));
		//тз=СПЗаказыТК.ПолучитьТЗАдресаЗаказов(Параметры.Участник,Параметры.Точка);
		тзСвернуто=тз.скопировать(новый Структура("РезультатОбмена,Подбор","ok",Истина),"Адрес,ФИО,Город,Регион,Телефон,Тип,email,КодПВЗ,Индекс,cityCode,Улица,Дом,Квартира");
		тзСвернуто.Свернуть("Адрес,Улица,Дом,Квартира,ФИО,Город,Регион,Телефон,Тип,email,КодПВЗ,Индекс,cityCode");
		Адреса.Загрузить(тзСвернуто);
	КонецЕсли;
	Элементы.ГруппаУП.Видимость=(Параметры.Источник="ОбъединениеГД");
КонецПроцедуры   

&НаКлиенте
Процедура ВыбратьСтроку()
	ОповеститьОВыборе(Элементы.Адреса.ТекущиеДанные);
КонецПроцедуры	

&НаКлиенте
Процедура АдресаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=ложь;
	ВыбратьСтроку();

КонецПроцедуры

