
#Область ЗагрузкаСуперГруппПоДате


#КонецОбласти


#Область СправочникКоробки 

Процедура ДогрузитьКоробки() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Коробки.Код КАК Код
		|ИЗ
		|	Справочник.Коробки КАК Коробки
		|ГДЕ
		|	Коробки.Догрузить
		|	И НЕ Коробки.ПометкаУдаления
		|	И Коробки.ВидСтикера = Значение(Перечисление.ВидыСтикеров.ГС)";
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокКодов= новый СписокЗначений;
	СписокКодов.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Код"));
	
	ПолучитьКоробкиПоСпискуКодов(СписокКодов);

КонецПроцедуры	


Функция ПолучитьКоробкиПоСпискуКодов(СписокКодов)
	хмл_отправили=ПолучитьХМЛ_КоробкиПоКодам(СписокКодов);
	хмл_получили =ПолученныеДанные_КоробкиПоКодам(хмл_отправили);	
	тз=аспПроцедурыОбменаДанными.ОбработатьЗагруженныеССайтаДанные(хмл_получили,Истина).Коробки;
КонецФункции


Функция ПолучитьХМЛ_КоробкиПоКодам(СписокКодов)
	Тип_groups			=ФабрикаXDTO.Тип("http://www.100sp.ru/out","distributors.groups");
	Тип_distributors		=ФабрикаXDTO.Тип("http://www.100sp.ru/out","distributors");
	
	Объект_groups=ФабрикаXDTO.Создать(Тип_groups);
	Для каждого элем из СписокКодов Цикл
		Объект_groups.group.Добавить(элем.Значение);
	КонецЦикла;
	
	Объект_distributors=ФабрикаXDTO.Создать(Тип_distributors);
	Объект_distributors.groups=Объект_groups;
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку(); 
	ФабрикаXDTO.ЗаписатьXML(Запись, Объект_distributors);
	ДанныеXML = Запись.Закрыть();
	ДанныеXML="<?xml version=""1.0"" encoding=""UTF-8""?> "+СтрЗаменить(ДанныеXML,"xmlns=""http://www.100sp.ru/out"" ","");
	Возврат ДанныеXML; 
КонецФункции

Функция ПолученныеДанные_КоробкиПоКодам(ДанныеXML) 
	Параметры    = новый Структура;
	Параметры.Вставить("token",Константы.Токен.Получить());
	Параметры.Вставить("xml", ДанныеXML);
	АдресСкрипта = Константы.АдресЗагрузкиССайта.Получить();

	ПолученныйФайл=СтоСПОбмен_Общий.ПолучитьПостЗапросом(Параметры,АдресСкрипта);
	Если ПолученныйФайл=Неопределено Тогда Возврат Неопределено КонецЕсли;

	ПолученныеДанные=СтоСПОбмен_Общий.ФайлВСтроку(ПолученныйФайл);
	Возврат ПолученныеДанные;
КонецФункции	

#КонецОбласти


	