// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ВывестиСЗ(СЗ,Заг)
	Макет=ПолучитьОбщийМакет("АнализОтвета");
	облСтрока=макет.ПолучитьОбласть("Строка");
	облШапка=макет.ПолучитьОбласть("Шапка");
	облШапка.Параметры.Заголовок=Заг;
	ТЗ.Вывести(облШапка);

	облПодвал=макет.ПолучитьОбласть("Подвал");
	num=0;
	СОшибками=0;
	Для каждого ЭлементСЗ из СЗ Цикл
		Если ЭлементСЗ.Значение.result="error" Тогда
			Сошибками=СОшибками+1;
		КонецЕсли;	
		Если ЭлементСЗ.Значение.result="ok" и Константы.АнализОтветаТолькоОшибки.Получить() Тогда
			Продолжить;
		КонецЕсли;
		num=num+1;
		ОблСтрока.Параметры.num= num;
		ОблСтрока.Параметры.pid		= ЭлементСЗ.Значение.pid;
		ОблСтрока.Параметры.uid		= ЭлементСЗ.Значение.uid;
		ОблСтрока.Параметры.orgid	= ЭлементСЗ.Значение.orgid;
		ОблСтрока.Параметры.date	= ЭлементСЗ.Значение.date;
		ОблСтрока.Параметры.result	= ЭлементСЗ.Значение.result;
		ОблСтрока.Параметры.message	= ЭлементСЗ.Значение.message;

		ТЗ.Вывести(облСтрока);
		
	КонецЦикла;
	облПодвал.Параметры.ВсегоОбработано	= СЗ.Количество();
	облПодвал.Параметры.Сошибками		= СОшибками;
	
	ТЗ.Вывести(облПодвал);
	
	
	
КонецПроцедуры // ПолучитьМакет()()
 


&НаСервере
Процедура ВывестиСЗУчастники(СЗ,Заг)
	Макет=ПолучитьОбщийМакет("АнализОтветаУчастники");
	облСтрока=макет.ПолучитьОбласть("Строка");
	облШапка=макет.ПолучитьОбласть("Шапка");
	облШапка.Параметры.Заголовок=Заг;
	ТЗ.Вывести(облШапка);

	облПодвал=макет.ПолучитьОбласть("Подвал");
	num=0;
	СОшибками=0;
	Для каждого ЭлементСЗ из СЗ Цикл
		num=num+1;
		ОблСтрока.Параметры.num= num;
		ОблСтрока.Параметры.name		= ЭлементСЗ.Значение.name;
		ОблСтрока.Параметры.id		= ЭлементСЗ.Значение.id;
		ОблСтрока.Параметры.phone	= ЭлементСЗ.Значение.phone;
		ОблСтрока.Параметры.raiting	= ЭлементСЗ.Значение.rating;

		ТЗ.Вывести(облСтрока);
		
	КонецЦикла;
	облПодвал.Параметры.ВсегоОбработано	= СЗ.Количество();

	
	ТЗ.Вывести(облПодвал);
	
	
	
КонецПроцедуры // ПолучитьМакет()()
 

&НаСервере
Процедура ВывестиСЗПокупки(СЗ,Заг)
	Макет=ПолучитьОбщийМакет("АнализОтветаПокупки");
	облСтрока=макет.ПолучитьОбласть("Строка");
	облШапка=макет.ПолучитьОбласть("Шапка");
	облШапка.Параметры.Заголовок=Заг;
	ТЗ.Вывести(облШапка);

	облПодвал=макет.ПолучитьОбласть("Подвал");
	num=0;
	СОшибками=0;
	Для каждого ЭлементСЗ из СЗ Цикл
		num=num+1;
		ОблСтрока.Параметры.num= num;
		ОблСтрока.Параметры.name	= ЭлементСЗ.Значение.name;
		ОблСтрока.Параметры.id		= ЭлементСЗ.Значение.id;
		ОблСтрока.Параметры.orgid	= ЭлементСЗ.Значение.orgid;

		ТЗ.Вывести(облСтрока);
		
	КонецЦикла;
	облПодвал.Параметры.ВсегоОбработано	= СЗ.Количество();

	
	ТЗ.Вывести(облПодвал);
	
	
	
КонецПроцедуры 


 &НаСервере
Процедура ВывестиСЗКарты(СЗ,Заг)
	Макет=ПолучитьОбщийМакет("АнализОтветаКарты");
	облСтрока=макет.ПолучитьОбласть("Строка");
	облШапка=макет.ПолучитьОбласть("Шапка");
	облШапка.Параметры.Заголовок=Заг;
	ТЗ.Вывести(облШапка);

	облПодвал=макет.ПолучитьОбласть("Подвал");
	num=0;
	СОшибками=0;
	Для каждого ЭлементСЗ из СЗ Цикл
		num=num+1;
		ОблСтрока.Параметры.num= num;
		ОблСтрока.Параметры.status		= ЭлементСЗ.Значение.status;
		ОблСтрока.Параметры.id			= ЭлементСЗ.Значение.id;
		ОблСтрока.Параметры.uid			= ЭлементСЗ.Значение.uid;
		ОблСтрока.Параметры.modified	= ЭлементСЗ.Значение.modified;
		ОблСтрока.Параметры.result	= ЭлементСЗ.Значение.result;
		ОблСтрока.Параметры.message	= ЭлементСЗ.Значение.message;

		ТЗ.Вывести(облСтрока);
		
	КонецЦикла;
	облПодвал.Параметры.ВсегоОбработано	= СЗ.Количество();

	
	ТЗ.Вывести(облПодвал);
	
	
	
КонецПроцедуры 





&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если СЗ_Приходы.Количество()>0 Тогда ВывестиСЗ(СЗ_Приходы,"Приходы"); КонецЕсли;
	Если СЗ_Расходы.Количество()>0 Тогда ВывестиСЗ(СЗ_Расходы,"Расходы");КонецЕсли;
	Если СЗ_Возвраты.Количество()>0 Тогда ВывестиСЗ(СЗ_Возвраты,"Возвраты");КонецЕсли;
	Если СЗ_Участники.Количество()>0 Тогда ВывестиСЗУчастники(СЗ_Участники,"Участники");КонецЕсли;
	Если СЗ_ПроблемныеУчастники.Количество()>0 Тогда ВывестиСЗУчастники(СЗ_ПроблемныеУчастники,"ПРОБЛЕМНЫЕ Участники");КонецЕсли;
	Если СЗ_Покупки.Количество()>0 Тогда ВывестиСЗПокупки(СЗ_Покупки,"Покупки");КонецЕсли;
	Если СЗ_ПроблемныеПокупки.Количество()>0 Тогда ВывестиСЗПокупки(СЗ_ПроблемныеПокупки,"ПРОБЛЕМНЫЕ Покупки");КонецЕсли;
	Если СЗ_Карты.Количество()>0 Тогда ВывестиСЗКарты(СЗ_Карты,"Карты");КонецЕсли;
	Если СЗ_ПроблемныеКарты.Количество()>0 Тогда ВывестиСЗКарты(СЗ_ПроблемныеКарты,"ПРОБЛЕМНЫЕ Карты");КонецЕсли;
	
 КонецПроцедуры
