
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ДвиженияСтатусыДоставки(Отказ, РежимПроведения);
	ДвиженияСтатусыЗаявокВТК(Отказ, РежимПроведения);
	ДвиженияСтатусыДоставкиСвернуто(Отказ, РежимПроведения);

	
	
	Для каждого стр из Заказы Цикл
		Если ЗначениеЗаполнено(стр.Груз.ЗаявкаВТК) и стр.Груз.ЗаявкаВТК<>Ссылка и  стр.Груз.ЗаявкаВТК.Проведен  Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для груза "+стр.Груз+" уже сформирована заявка в ТК",,,,Отказ);
		КонецЕсли;
	КонецЦикла;	
	Если не отказ Тогда		
		Для каждого стр из Заказы Цикл
			Если ЗначениеЗаполнено(стр.Груз.ЗаявкаВТК) Тогда продолжить; КонецЕсли;
			обКоробка=стр.Груз.ПолучитьОбъект();				
			обКоробка.ЗаявкаВТК=Ссылка;
			Попытка
				обКоробка.Записать();		
			Исключение
				отказ=Истина;				
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ДвиженияСтатусыДоставки(Отказ, Режим)
	Движения.СтатусыДоставки.Записывать = Истина;
	Для Каждого ТекСтрокаПокупки Из Заказы Цикл
		Движение = Движения.СтатусыДоставки.Добавить();
		Движение.Период = Дата;
		Движение.Груз = ТекСтрокаПокупки.Груз;
		Движение.Статус = Перечисления.СтатусыОтправкиГруза.СформирванаЗаявкаВТК;
		Движение.НомерЗаявки=НомерЗаявки;
		Движение.ДатаЗаявки=ДатаЗаявки;
	КонецЦикла;
КонецПроцедуры


Процедура ДвиженияСтатусыЗаявокВТК(Отказ, Режим)
	Движения.СтатусыЗаявокВТК.Записывать = Истина;
	Движение = Движения.СтатусыЗаявокВТК.Добавить();
	Движение.Период = Дата;
	Движение.Заявка= Ссылка;
	Движение.Статус = Перечисления.СтатусыОтправкиГруза.СформирванаЗаявкаВТК;
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	СПКонтрольДоставкиГрузов.ПроверитьУникальностьСтатусаДляГруза(ЭтотОбъект,Отказ);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
		Для каждого стр из Заказы Цикл
			обКоробка=стр.Груз.ПолучитьОбъект();				
			обКоробка.ЗаявкаВТК=Документы.ЗаявкаВТранспортнуюКомпанию.ПустаяСсылка();
			Попытка
				обКоробка.Записать();		
			Исключение
				отказ=Истина;				
			КонецПопытки;
		КонецЦикла;
КонецПроцедуры



Процедура ДвиженияСтатусыДоставкиСвернуто(Отказ, Режим)
	Движения.СтатусыДоставкиСвернуто.Записывать = Истина;
	КоличествоЗаказов=0;
	Для  каждого стр Из Заказы Цикл
		КоличествоЗаказов=КоличествоЗаказов+стр.Груз.Количество;
		
	КонецЦикла;	
	
	Движение = Движения.СтатусыДоставкиСвернуто.Добавить();
	Движение.Период = Дата;
	Движение.Статус = Перечисления.СтатусыОтправкиГруза.СформирванаЗаявкаВТК;
	Движение.ЗаявкаВТК=Ссылка;
	Движение.Количество=КоличествоЗаказов;
	Движение.КоличествоГС=Заказы.Количество();
	Движение.КоличествоМест=КоличествоМест;
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если не ЗначениеЗаполнено(СвояТочка) Тогда
		СвояТочка=константы.СвояТочка.Получить();
  	КонецЕсли;
КонецПроцедуры

