
Процедура ЗаполнитьВозвраты() 
	Если Объект.Проведен Тогда
		Сообщить("Нельзя заполнить проведенный документ!!!");	
	Иначе	
		Объект.Покупки.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратыОстатки.Организатор,
		|	ВозвратыОстатки.Участник,
		|	ВозвратыОстатки.Покупка,
		|	ВозвратыОстатки.КоличествоОстаток КАК количество
		|ИЗ
		|	РегистрНакопления.Возвраты.Остатки(, ) КАК ВозвратыОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВозвратыОстатки.Организатор.Наименование";
		
		Результат = Запрос.Выполнить();
		Объект.Покупки.Загрузить(Результат.Выгрузить());
	КонецЕсли;
КонецПроцедуры 


&НаКлиенте
Процедура Заполнить(Команда)
	
		ЗаполнитьВозвраты();

КонецПроцедуры


