Процедура ЗаполнитьЭлементами(Масс) Экспорт 
	//шаблон=Константы.ШаблонПечатиГрупповыхСтикеров.Получить();
	МассивПрефиксов  = ПолучитьПрефиксСправочника(Масс[0]);

	Для каждого стр из масс Цикл
		Для Каждого описаниеШК из МассивПрефиксов Цикл
			новыйЭлемент				= Элементы.Добавить();
			новыйЭлемент.Количество		= 1;
			новыйЭлемент.Ссылка			= стр;
			новыйЭлемент.Шаблон			= Справочники.ХранилищеШаблонов.ШаблонШКСправочника;
			
			Если ТипЗнч(стр)	= Тип("СправочникСсылка.Посылки") Тогда
				Если не ЗначениеЗаполнено(стр.ШК) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для "+стр+"Не заполнено поле ШК");
					Продолжить;
				КонецЕсли;	
				новыйЭлемент.Штрихкод	= стр.ШК;
			Иначе
				новыйЭлемент.Штрихкод 	= ОписаниеШК.Префикс+стр.Код+ОписаниеШК.Действие;	
			КонецЕсли;	
			
			НовыйЭлемент.Описание 		= ОписаниеШК.Описание;
			НовыйЭлемент.ТипЭ 			= ТипЗнч(Масс[0]);
		КонецЦикла
	КонецЦикла;
	//Если ПрефиксШК="55" Тогда
	//	"55"+Выборка.Код+"01000"
	//КонецЕсли;
КонецПроцедуры	

Функция ПолучитьПрефиксСправочника(Спр)
	массивПрефиксов = Новый Массив;
	Если ТипЗнч(Спр)=Тип("СправочникСсылка.Габариты") Тогда	
		массивПрефиксов.Добавить(новый Структура("Префикс, Описание, Действие", "62","Выбрать",""));
	ИначеЕсли ТипЗнч(Спр)=Тип("СправочникСсылка.МестаХранения") Тогда	
		массивПрефиксов.Добавить(новый Структура("Префикс, Описание, Действие", "63","Выбрать",""));		
	ИначеЕсли ТипЗнч(Спр)=Тип("СправочникСсылка.Номенклатура") Тогда	
		массивПрефиксов.Добавить(новый Структура("Префикс, Описание, Действие", "61","Продать",""));		
	ИначеЕсли ТипЗнч(Спр)=Тип("СправочникСсылка.Сотрудники") Тогда	
		массивПрефиксов.Добавить(новый Структура("Префикс, Описание, Действие", "55","Записать и закрыть","01000"));		
	ИначеЕсли ТипЗнч(Спр)=Тип("СправочникСсылка.ТочкиРаздачи") Тогда	
		массивПрефиксов.Добавить(новый Структура("Префикс, Описание, Действие", "64","Открыть ""Выдачу транзита""","01"));
		массивПрефиксов.Добавить(новый Структура("Префикс, Описание, Действие", "64","Открыть ""Формирование коробки""","02"));
	Иначе
		массивПрефиксов.Добавить(новый Структура("Префикс, Описание, Действие", "","",""));
	КонецЕсли;
	Возврат массивПрефиксов;
КонецФункции	