

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ОбъектыПечати") Тогда
		СписокДокументов = новый СписокЗначений();
		СписокДокументов.ЗагрузитьЗначения(Параметры.ОбъектыПечати);
	КонецЕсли;	
	Если Параметры.Свойство("СформироватьПриОткрытии") Тогда
		СформироватьПриОткрытии = Истина;					
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		ПараметрСписокДокументов = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СписокДокументов");
		ПараметрСписокДокументов.Использование = истина;
		ПараметрСписокДокументов.Значение = СписокДокументов; 
		Если ЗначениеЗаполнено(ПараметрСписокДокументов.ИдентификаторПользовательскойНастройки) Тогда

			ПользовательскийПараметр = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
	   										ПараметрСписокДокументов.ИдентификаторПользовательскойНастройки);
			Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
				ПользовательскийПараметр.Значение = ПараметрСписокДокументов.Значение;
			КонецЕсли;

		КонецЕсли;
		Если СформироватьПриОткрытии Тогда
			СкомпоноватьРезультат();
			Элементы.Результат.ОтображениеСостояния.Видимость = Ложь;
			Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
		КонецЕсли;
КонецПроцедуры

