
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Константы.ПроверятьОтветственногоПриРасходе.Получить() Тогда
		ПроверяемыеРеквизиты.Добавить("Ответственный");	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	мОстанавливатьПриходПриОшибке=Константы.ОстанавливатьПриходПриОшибке.Получить();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеКоробокДляРазбораКоробки.Коробка
		|ИЗ
		|	Документ.ПоступлениеКоробокДляРазбора.Коробки КАК ПоступлениеКоробокДляРазбораКоробки
		|ГДЕ
		|	ПоступлениеКоробокДляРазбораКоробки.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеКоробокДляРазбораКоробки.Коробка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Движения.ОчередьРазбора.Записывать = Истина;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ОчередьРазбора.Добавить();
		Движение.Период=Ссылка.Дата;
		Движение.Коробка = ВыборкаДетальныеЗаписи.Коробка;
		Движение.Статус	 = Перечисления.СтатусыКоробки.ВОчереди;
	КонецЦикла;
	

КонецПроцедуры
