
&НаСервере
Процедура ОбновитьСоставССайтаНаСервере()
	если не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли ;	
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.РегистрацияСупперГруппы"));
	об.СериолизоватьВХМЛ();
	об.ОтправитьНаСайт();
	об.ДеСериализоватьИзХМЛ();
	ЗначениеВДанныеФормы(об,Объект);
	//УстановитьДоступность();
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСоставССайта(Команда)
	ОбновитьСоставССайтаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    // СтандартныеПодсистемы.Печать
    УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.Печать
	
	Если ЗначениеЗаполнено(Параметры.УстанавливаемФакт) Тогда
		СГ			= Параметры.УстанавливаемФакт.Супергруппа;
		НомерКолена	= Параметры.УстанавливаемФакт.НомерКолена;
		Если СГ.Маршрут.Количество()<>НомерКолена	 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Это не последнее колено маршрута супергруппы",,,,Отказ);
		КонецЕсли;	
		Если СГ.ПунктВыдачи<>Константы.СвояТочка.Получить() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Зафиксировать поступление Супергруппы может только точка: "+СГ.ПунктВыдачи,,,,Отказ);
		КонецЕсли;
		Если Отказ тогда возврат; КонецЕсли;
		стр=Объект.Группы.Добавить() ;
		стр.СупперГруппа=СГ;
	КонецЕсли;	
КонецПроцедуры

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
    УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать


