Функция СменитьСтатусОчереди(РазобралиШК)   Экспорт
	Если РазобралиШК.ТипШК="55" Тогда
		Расходная=ПолучитьОбъектОчереди(Перечисления.СтатусыВыдачиПокупок.ОжиданиеСборки);
		Если ЗначениеЗаполнено(Расходная) Тогда	
			обРасходная=Расходная.ПолучитьОбъект();
			обРасходная.СтатусВыдачи=Перечисления.СтатусыВыдачиПокупок.ВСборке;
			обРасходная.Ответственный=РазобралиШК.Сотрудник;
			обРасходная.Записать(РежимЗаписиДокумента.Проведение);
			Возврат Расходная;
		Иначе
			Возврат Документы.Расходная.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли РазобралиШК.ТипШК="56" Тогда	
		Расходная=РазобралиШК.Расходная;
		Если ЗначениеЗаполнено(Расходная) Тогда	
			обРасходная=Расходная.ПолучитьОбъект();
			обРасходная.СтатусВыдачи=Перечисления.СтатусыВыдачиПокупок.Собран;
			обРасходная.Записать(РежимЗаписиДокумента.Проведение);
			Возврат Расходная;
		Иначе
			Возврат Документы.Расходная.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
КонецФункции	

Функция ПолучитьОбъектОчереди(Статус)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОчередьВыдачиПокупок.Регистратор
		|ИЗ
		|	РегистрСведений.ОчередьВыдачиПокупок КАК ОчередьВыдачиПокупок
		|ГДЕ
		|	ОчередьВыдачиПокупок.Статус = &Статус
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОчередьВыдачиПокупок.ВремяПостановкиВОчередь";
	Запрос.Параметры.Вставить("Статус",Статус);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Регистратор;
	КонецЕсли;
	Возврат Документы.Расходная.ПустаяСсылка();
КонецФункции


Функция  ПоказатьШК(ШК) экспорт
	ВнешняяКомпонента = Обработки.ПечатьЭтикетокИЦенников.ПодключитьВнешнююКомпонентуПечатиШтрихкода(); 

	ПараметрыШтрихкода=новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",50);
	ПараметрыШтрихкода.Вставить("Высота",30);
	ПараметрыШтрихкода.Вставить("ТипКода",1);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",Ложь);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",8);
	ПараметрыШтрихкода.Вставить("Штрихкод","123456789101");
	
	ПараметрыШтрихкода.Штрихкод=ШК;
	РисунокШтрихкод = Обработки.ПечатьЭтикетокИЦенников.ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШтрихкода);
	//РисунокШтрихкод.Расположить(ОбластьШК);
	Возврат РисунокШтрихкод;	
КонецФункции
