



Процедура УстановитьВидимость()
	если Объект.типМегаордера = Перечисления.типМегаордера.Супергруппа Тогда
		Для каждого элем из Элементы.ГруппаСтраницы.ПодчиненныеЭлементы Цикл
			элем.Видимость = ложь;
		КонецЦикла;
		Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаСупергруппа.Видимость = истина;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСоставСупергруппы(Команда)
	СтоСПОбмен_СупперГруппы.ПолучитьСостав(Объект.Ссылка);
	Прочитать();
	ОбновитьОтображениеДанных();
	ОповеститьОбИзменении(Объект.Ссылка);
КонецПроцедуры
