
&НаКлиенте
Процедура Показать_XML(хмл,ЗаголовокФормы="Просмотр текста сообщения")  Экспорт
	#Если не ВебКлиент Тогда
	ВремФайл = ПолучитьИмяВременногоФайла("xml");
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ВремФайл);
	ЗаписьXML.ЗаписатьБезОбработки(хмл);
	ЗаписьXML.Закрыть();
	
	ОткрытьФорму("ОбщаяФорма.ФормаПросмотраHTML", Новый Структура("HTML, Заголовок", ВремФайл, ЗаголовокФормы), ЭтотОбъект);
	#КонецЕсли
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьШКизПараметров(Параметр) Экспорт
	Данные = Новый Массив();
	Если Параметр[1] = Неопределено Тогда
		Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных
	Иначе
		Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных
	КонецЕсли;
	ШК 	= Данные[Данные.Количество() - 1].Штрихкод;
	
	ШК	= СтрЗаменить(ШК," ","");
	ШК	= СтрЗаменить(ШК,"]C1","");
	
	Если Лев(ШК,2) <> "22" Тогда
		Параметр.Добавить("Обработано");
	КонецЕсли;	
	Возврат ШК;
КонецФункции // ПолучитьШКизПараметров()


&НаКлиенте
//
//В модуле формы должна быть процедура ПодключитьОборудованиеЗавершение
// Параметры:
//  ЭтотОбъект - УправляемаяФорма, 
//  УникальныйИдентификатор - УникальныйИдентификатор
Процедура ПодключитьСканерШК(УникальныйИдентификатор) Экспорт

   ПоддерживаемыеТипыВО = Новый Массив();
   ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
   ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", СтоСП_Клиент); 
   МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, ПоддерживаемыеТипыВО);

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
   Если Не РезультатВыполнения.Результат Тогда
      ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
      Сообщить(ТекстСообщения);
   Иначе
   КонецЕсли;
КонецПроцедуры

Процедура СигналДинамика() Экспорт
	#Если не ВебКлиент Тогда
	Сигнал();
	#КонецЕсли
КонецПроцедуры	


