
&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	ЗаполнитьОстаткамиНаСервере();
КонецПроцедуры


Процедура ЗаполнитьОстаткамиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КПолучениюОстатки.Покупка,
		|	КПолучениюОстатки.Участник,
		|	КПолучениюОстатки.ДокументВыдачи,
		|	КПолучениюОстатки.КоличествоОстаток КАК количество
		|ИЗ
		|	РегистрНакопления.КПолучению.Остатки(, ) КАК КПолучениюОстатки
		|ГДЕ
		|	КПолучениюОстатки.ДокументВыдачи.Дата <= &НаДату";
    Запрос.Параметры.Вставить("НаДату",КонецДня(Объект.Дата));
	Результат = Запрос.Выполнить();
    Объект.Покупки.Загрузить(Результат.Выгрузить());

	
КонецПроцедуры	