#Область ПрограммныйИнтерфейс

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	СтоСП_Печать.ДобавитьКомандыПечатиПоступлений(КомандыПечати);
КонецПроцедуры

// Формирует печатные формы.
 //Параметры:
 // МассивОбъектов  – Массив    – ссылки на объекты, которые нужно распечатать;
 // ПараметрыПечати – Структура – дополнительные настройки печати;
 // КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
 // ОбъектыПечати         – СписокЗначений  – значение – ссылка на объект;
 //                                           представление – имя области в которой был выведен объект (выходной параметр);
 // ПараметрыВывода       – Структура       – дополнительные параметры сформированных табличных документов (выходной параметр).
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	#Если Сервер Тогда	
		НужноПечататьМакет 		= УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Чек");
		Если НужноПечататьМакет Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Чек",
			НСтр("ru = 'Чек'"),
			СтоСП_Печать.ТабДок_ЧекаПоступления(МассивОбъектов, ОбъектыПечати),
			,
			"ОбщиеМакеты.ПФ_MXL_ЧекПоступления");
		КонецЕсли;	
		
		НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЧекПросмотр");
		Если НужноПечататьМакет Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ЧекПросмотр",
			НСтр("ru = 'Чек просмотр'"),
			СтоСП_Печать.ТабДок_ЧекаПоступления(МассивОбъектов, ОбъектыПечати),
			,
			"ОбщиеМакеты.ПФ_MXL_ЧекПоступления");
		КонецЕсли;	
		
		НужноПечататьМакет 		= УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СписокУчастников");
		Если НужноПечататьМакет Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СписокУчастников",
			НСтр("ru = 'Список участников'"),
			СтоСП_Печать.ТабДок_СпискаУчастников(МассивОбъектов, ОбъектыПечати),
			,
			"ОбщиеМакеты.ПФ_MXL_СписокУчастниковПоступления");
		КонецЕсли;	
	#КонецЕсли	
КонецПроцедуры

#КонецОбласти



