
#Область ПрограммныйИнтерфейс
Функция РассчитатьСтоимость(Параметры) Экспорт
	Протокол	= Интеграция_ТранспортныеКомпании_Общий.ПолучитьСтруктуруПротокола();
	Протокол.РасчетКалькулятора		= "";
	Протокол.ТекстОшибки			= "";
	Протокол.ТарифТК				= 0;
	
	Протокол.ДатаНачала			= ТекущаяДата();
	Протокол.ВидОбмена			= Перечисления.ВидыОбменовСДЭК.СтоимостьПоТарифу;	
 	СтруктураРасчета			= РасчетСтоимости(Параметры);	
	Протокол.ОтправленныеДанные	= СтруктураРасчета.ОтправленныеДанные;
	Протокол.ПолученныеДанные	= СтруктураРасчета.ПолученныеДанные;
	
	Протокол.ДатаОкончания		= ТекущаяДата();

	Если СтруктураРасчета.Успешно  и СтруктураРасчета.Свойство("totalrate") Тогда
		Протокол.Результат	  =	"ok";
		Протокол.ТарифТК				= СтруктураРасчета.totalrate/100;
		
		Протокол.РасчетКалькулятора="Итоговая цена: "+Протокол.ТарифТК+ " руб."+Символы.ПС+
		"	Плата всего: "+?(СтруктураРасчета.Свойство("totalrate"),СтруктураРасчета.totalrate/100," --- ")+ " "+Символы.ПС+
		"	Всего НДС  : "+?(СтруктураРасчета.Свойство("totalvat"),СтруктураРасчета.totalvat/100," --- ")+ " "+Символы.ПС;
		Если  СтруктураРасчета.Свойство("deliverytime") Тогда		
			Протокол.РасчетКалькулятора	= Протокол.РасчетКалькулятора+
			"Время доставки  : "+Символы.ПС+
			"	Макс (дни) : "+?(СтруктураРасчета.deliverytime.Свойство("maxdays"),СтруктураРасчета.deliverytime.maxdays," --- ")+ " "+Символы.ПС+
			"	Мин (дни)  : "+?(СтруктураРасчета.deliverytime.Свойство("mindays"),СтруктураРасчета.deliverytime.mindays," --- ")+ " "+Символы.ПС;
		КОнецЕсли;			
		
	Иначе
		Протокол.Результат	  =	"error";
		Протокол.РасчетКалькулятора		= СтруктураРасчета.ПолученныеДанные;
		Протокол.ТекстОшибки			= Протокол.РасчетКалькулятора;
	КонецЕсли;	

	Возврат	Протокол; 
	
КОнецФункции	




#КонецОбласти 





Функция РасчетСтоимости(Параметры) Экспорт
	
	уч_данные=ПолучитьУчетныеДанные(Параметры.ЭтоEMS);
	
	// Вставить содержимое обработчика.
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Unix, " ", Истина); 
	з_JSON=новый ЗаписьJSON;
	з_JSON.УстановитьСтроку(ПараметрыJSON);
	
	Данные= Новый Соответствие;
	Данные.Вставить("declared-value", 		Параметры.ОбъявленнаяСтоимость*100); 		//Объявленная стоимость целое
	Данные.Вставить("dimension", 			Новый Структура("height ,length ,width", 
												Параметры.Высота,
												Параметры.Длина,
												Параметры.Ширина)); 			//Сантиметры
	Данные.Вставить("fragile", 				Параметры.Хрупкое); 		 		//Осторожно хрупко 
	Данные.Вставить("index-from", 			Параметры.ИндексОтправителя); 			//Откуда
	Данные.Вставить("index-to", 			Параметры.ИндексПолучателя); 			//КУда
	Данные.Вставить("mail-category", 		ПолучитьЗначениеПеречисления(Параметры.КатегорияРПО)); 		//Категория РПО
	Данные.Вставить("mail-type", 			ПолучитьЗначениеПеречисления(Параметры.ВидРПО)); 			//Вид РПО
	Данные.Вставить("mass", 				Параметры.Вес); 			 	//Масса отправления в граммах 
	Данные.Вставить("with-simple-notice",	Ложь);	//Отметка 'С простым уведомлением'
	ЗаписатьJSON(з_JSON,Данные);
	стр_JSON=з_JSON.Закрыть();
	
	Сервер = "otpravka-api.pochta.ru/1.0/tariff";
	ssl = Новый ЗащищенноеСоединениеOpenSSL(
                Новый СертификатКлиентаWindows(),
                Новый СертификатыУдостоверяющихЦентровWindows());  
	с = Новый HTTPСоединение(Сервер,,,,,5,ssl);
	з = Новый HTTPЗапрос();
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");

	Заголовки.Вставить("Authorization", "AccessToken "+уч_данные.Токен);
	Заголовки.Вставить("X-User-Authorization", "Basic "+уч_данные.Encoded);
	з.Заголовки = Заголовки;
	
	з.УстановитьТелоИзСтроки(стр_JSON,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
	
	имяФайлаОтвета=ПолучитьИмяВременногоФайла("txt");
	Расчет=новый Структура;
	
	Попытка
		стрОтвета=новый Структура;
		HTОтвет=с.ОтправитьДляОбработки(з,имяФайлаОтвета);
		ч_JSON=новый ЧтениеJSON;
		ч_JSON.ОткрытьФайл(имяФайлаОтвета);
		Если HTОтвет.КодСостояния<>503 Тогда
			Расчет=ОбъектJSONВструктуру(ч_JSON);
			Расчет.Вставить("Успешно",Истина);
		Иначе
			Расчет.Вставить("Успешно",Ложь);
		КонецЕсли;
		Расчет.Вставить("ПолученныеДанные",СтоСПОбмен_Общий.ФайлВСтроку(имяФайлаОтвета));
	Исключение
	  Расчет.Вставить("Успешно",Ложь);
	  Расчет.Вставить("ПолученныеДанные",ОписаниеОшибки());
	  ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
  КонецПопытки;
  Расчет.Вставить("ОтправленныеДанные",стр_JSON);
  Возврат Расчет;
КонецФункции

Функция СформироватьЗаказ(Параметры,ЭтоEMS=ложь) Экспорт
	уч_данные=ПолучитьУчетныеДанные(ЭтоEMS);
	
	// Вставить содержимое обработчика.
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Unix, " ", Истина); 
	з_JSON=новый ЗаписьJSON;
	з_JSON.УстановитьСтроку(ПараметрыJSON);
	
	Данные= Новый Соответствие;
	Данные.Вставить("brand-name", 		    "100sp.ru"); 													//Отправитель на посылке/название брэнда 
	Данные.Вставить("mail-category", 		ПолучитьЗначениеПеречисления(Параметры["mail-category"])); 		//Категория РПО
	Данные.Вставить("mail-type", 			ПолучитьЗначениеПеречисления(Параметры["mail-type"])); 			//Вид РПО
	Данные.Вставить("order-num",		    Параметры["НомерГС"]);											//Номер заказа. Внешний идентификатор заказа, который формируется отправителем 
//	Данные.Вставить("transport-type",		"SURFACE");		

	Если Параметры["mail-category"]= Перечисления.КатегорияРПО.WITH_DECLARED_VALUE_AND_CASH_ON_DELIVERY Тогда
		Данные.Вставить("payment", 				Параметры["payment"]); 											//Сумма наложенного платежа (копейки) 
	КонецЕсли;
	Данные.Вставить("insr-value", 			Параметры["ОбъявленнаяСтоимость"]);								//Сумма объявленной ценности (копейки) 
	
	
	Данные.Вставить("dimension", 			Параметры["dimension"]); 										//Линейные размеры 
	Данные.Вставить("fragile", 				Параметры["fragile"]); 		 									//Осторожно хрупко
	Данные.Вставить("mass", 				Параметры["mass"]); 			 								//Масса отправления в граммах 	
	

	
	Данные.Вставить("surname",				Параметры["Фамилия"]);											//Фамилия
	Данные.Вставить("given-name",		    Параметры["Имя"]);												//Имя получателя  	
	Данные.Вставить("middle-name",		    Параметры["Отчество"]);											//Отчество получателя   
	
	Данные.Вставить("address-type-to",	    "DEFAULT"); 													//Тип адреса. 	
	Данные.Вставить("mail-direct", 			643); 															//Код страныю Россия: 643 	
	Данные.Вставить("region-to",			Параметры["Регион"]);											//Область, регион 	
	Данные.Вставить("place-to",			    Параметры["Город"]);											//Населенный пункт 
	//Если Параметры["mail-type"]<> Перечисления.ВидРПО.EMS Тогда
		Данные.Вставить("postoffice-code",		Параметры["ИндексОтправителя"]);								//Индекс места приема 
	//КонецЕсли;
	Данные.Вставить("street-to",			Параметры["Улица"]);											//Часть адреса: Улица 
	Данные.Вставить("house-to",		    	Параметры["НомерДома"]);										//Часть адреса: Номер здания 
	Данные.Вставить("index-to",		    	Параметры["Индекс"]);   										//Почтовый индекс  
	Данные.Вставить("tel-address",			Параметры["Телефон"]);											//Телефон получателя (может быть обязательным для некоторых типов отправлений) 

	
	//Данные.Вставить("declared-value", 		Параметры["declared-value"]); 		//Объявленная стоимость целое
	//Данные.Вставить("dimension", 			Параметры["dimension"]); 			//Сантиметры
	//Данные.Вставить("fragile", 				Параметры["fragile"]); 		 		//Осторожно хрупко 
	//Данные.Вставить("with-simple-notice",	Параметры["with-simple-notice"]);	//Отметка 'С простым уведомлением'
	масДанных=Новый Массив;
	масДанных.Добавить(Данные);
	ЗаписатьJSON(з_JSON,масДанных);
	стр_JSON=з_JSON.Закрыть();
	
	Сервер = "otpravka-api.pochta.ru/1.0/user/backlog";

	
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(
	Новый СертификатКлиентаWindows(),
	Новый СертификатыУдостоверяющихЦентровWindows());  
	с = Новый HTTPСоединение(Сервер,,,,,5,ssl);
	з = Новый HTTPЗапрос();
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Authorization", "AccessToken "+уч_данные.Токен);
	Заголовки.Вставить("X-User-Authorization", "Basic "+уч_данные.Encoded);
	
	з.Заголовки = Заголовки;
	
	з.УстановитьТелоИзСтроки(стр_JSON,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
	
	имяФайлаОтвета=ПолучитьИмяВременногоФайла("txt");
	стрОтвета=новый Структура;
	Попытка
		ответ=с.Записать(з);
		строка_Ответа=ответ.ПолучитьТелоКакСтроку();
		ч_JSON=новый ЧтениеJSON;
		ч_JSON.УстановитьСтроку(строка_Ответа);
		
		стрОтвета=ОбъектJSONВструктуру(ч_JSON);
		//СформироватьДерево(ч_JSON, стрОтвета);

		стрОтвета.Вставить("ПолученныеДанные",строка_Ответа);
		стрОтвета.Вставить("Успешно",Истина);
		
	Исключение
		стрОтвета.Вставить("Успешно",Ложь);
		стрОтвета.Вставить("ПолученныеДанные",ОписаниеОшибки());
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки()+ ИнформацияОбОшибке());
	КонецПопытки;
	стрОтвета.Вставить("ОтправленныеДанные",стр_JSON);
	Возврат стрОтвета;
	
	
КонецФункции	



Функция ПолучитьИнформациюПоЗаказу(НЗаказа,ЭтоEMS=ложь) Экспорт
	уч_данные=ПолучитьУчетныеДанные(ЭтоEMS);
	
	Сервер = "otpravka-api.pochta.ru/1.0/backlog/"+НЗаказа;
	//Сервер = "otpravka.pochta.ru/document/downloadForms/1255371";
	
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(
	Новый СертификатКлиентаWindows(),
	Новый СертификатыУдостоверяющихЦентровWindows());  
	с = Новый HTTPСоединение(Сервер,,,,,5,ssl);
	з = Новый HTTPЗапрос();
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Authorization", "AccessToken "+уч_данные.Токен);
	Заголовки.Вставить("X-User-Authorization", "Basic "+уч_данные.Encoded);
	
	з.Заголовки = Заголовки;
	имяФайлаОтвета=ПолучитьИмяВременногоФайла("txt");
	стрОтвета=новый Структура;
	
	Попытка
		ответ=с.Получить(з,имяФайлаОтвета);
		строка_Ответа=ответ.ПолучитьТелоКакСтроку();
		ч_JSON=новый ЧтениеJSON;
		ч_JSON.ОткрытьФайл(имяФайлаОтвета);
		стрОтвета=ОбъектJSONВструктуру(ч_JSON);
		стрОтвета.Вставить("КодСостояния",ответ.КодСостояния);
		стрОтвета.Вставить("имяФайлаОтвета",имяФайлаОтвета);
		
		
		Если ответ.КодСостояния=403 Тогда
			ПолученныеДанные="Нарушение доступа";
		ИначеЕсли ответ.КодСостояния=404 Тогда
			ПолученныеДанные="Заказ не найден";
		ИначеЕсли ответ.КодСостояния=500 Тогда
			ПолученныеДанные="Внутренняя ошибка сервиса";
		Конецесли;
		Двоичное=Новый ДвоичныеДанные(имяФайлаОтвета);
		Адрес=ПоместитьВоВременноеХранилище(Двоичное,Новый УникальныйИдентификатор);
		
		
		стрОтвета.Вставить("ПолученныеДанные",СтоСПОбмен_Общий.ФайлВСтроку(имяФайлаОтвета));
		стрОтвета.Вставить("Адрес",Адрес);
		стрОтвета.Вставить("Успешно",Истина);
		
	Исключение
		стрОтвета.Вставить("Успешно",Ложь);
		стрОтвета.Вставить("ПолученныеДанные",ОписаниеОшибки());
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки()+ ИнформацияОбОшибке());
	КонецПопытки;
	стрОтвета.Вставить("ОтправленныеДанные",НЗаказа);
	Возврат стрОтвета;
КонецФункции	




Функция ПолучитьКвитанцию_Ф7П(НомерЗаказа,ЭтоEMS=ложь) Экспорт
	уч_данные=ПолучитьУчетныеДанные(ЭтоEMS);
	
	Сервер = "otpravka-api.pochta.ru/1.0/forms/"+НомерЗаказа+"/f7pdf";
	//Сервер = "otpravka.pochta.ru/document/downloadForms/1255371";
	
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(
	Новый СертификатКлиентаWindows(),
	Новый СертификатыУдостоверяющихЦентровWindows());  
	с = Новый HTTPСоединение(Сервер,,,,,5,ssl);
	з = Новый HTTPЗапрос();
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Authorization", "AccessToken "+уч_данные.Токен);
	Заголовки.Вставить("X-User-Authorization", "Basic "+уч_данные.Encoded);
	
	з.Заголовки = Заголовки;
	имяФайлаОтвета=ПолучитьИмяВременногоФайла("pdf");
	стрОтвета=новый Структура;
	
	Попытка
		ответ=с.Получить(з,имяФайлаОтвета);
		строка_Ответа=ответ.ПолучитьТелоКакСтроку();
		стрОтвета.Вставить("КодСостояния",ответ.КодСостояния);
		стрОтвета.Вставить("имяФайлаОтвета",имяФайлаОтвета);
		
		Если ответ.КодСостояния=403 Тогда
			ПолученныеДанные="Нарушение доступа";
		ИначеЕсли ответ.КодСостояния=404 Тогда
			ПолученныеДанные="Заказ не найден";
		ИначеЕсли ответ.КодСостояния=500 Тогда
			ПолученныеДанные="Внутренняя ошибка сервиса";
		Конецесли;
		Двоичное=Новый ДвоичныеДанные(имяФайлаОтвета);
		Адрес=ПоместитьВоВременноеХранилище(Двоичное,Новый УникальныйИдентификатор);
		
		
		стрОтвета.Вставить("ПолученныеДанные",ПолученныеДанные);
		стрОтвета.Вставить("Адрес",Адрес);
		стрОтвета.Вставить("Успешно",Истина);
		
	Исключение
		стрОтвета.Вставить("Успешно",Ложь);
		стрОтвета.Вставить("ПолученныеДанные",ОписаниеОшибки());
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки()+ ИнформацияОбОшибке());
	КонецПопытки;
	стрОтвета.Вставить("ОтправленныеДанные",НомерЗаказа);
	Возврат стрОтвета;
КонецФункции	




Функция ПодготовкаОтправкаФормы_Ф103(НомерПартии,ОтправлятьПисьмо=Истина,ЭтоEMS=ложь) Экспорт
	уч_данные=ПолучитьУчетныеДанные(ЭтоEMS);
	
	// Вставить содержимое обработчика.
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Unix, " ", Истина); 
	з_JSON=новый ЗаписьJSON;
	з_JSON.УстановитьСтроку(ПараметрыJSON);
	
	Данные= Новый Соответствие;
	Данные.Вставить("name", 		НомерПартии); 		
	Данные.Вставить("sendEmail ", 	ОтправлятьПисьмо); 	
	
	ЗаписатьJSON(з_JSON,Данные);
	стр_JSON=з_JSON.Закрыть();
	
	Сервер = "otpravka-api.pochta.ru/1.0/batch/"+НомерПартии+"/checkin?sendEmail="+?(ОтправлятьПисьмо,"true","false");
	ssl = Новый ЗащищенноеСоединениеOpenSSL(
                Новый СертификатКлиентаWindows(),
                Новый СертификатыУдостоверяющихЦентровWindows());  
	с = Новый HTTPСоединение(Сервер,,,,,,ssl);
	з = Новый HTTPЗапрос();
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");

	Заголовки.Вставить("Authorization", "AccessToken "+уч_данные.Токен);
	Заголовки.Вставить("X-User-Authorization", "Basic "+уч_данные.Encoded);
	з.Заголовки = Заголовки;
	
	з.УстановитьТелоИзСтроки(стр_JSON,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
	
	имяФайлаОтвета=ПолучитьИмяВременногоФайла("txt");
	Расчет=новый Структура;
	
	Попытка
		стрОтвета=новый Структура;
		с.ОтправитьДляОбработки(з,имяФайлаОтвета);
		ч_JSON=новый ЧтениеJSON;
		ч_JSON.ОткрытьФайл(имяФайлаОтвета);
		Расчет=ОбъектJSONВструктуру(ч_JSON);
		Расчет.Вставить("ПолученныеДанные",СтоСПОбмен_Общий.ФайлВСтроку(имяФайлаОтвета));
		Расчет.Вставить("Успешно",Истина);
	Исключение
	  Расчет.Вставить("Успешно",Ложь);
	  Расчет.Вставить("ПолученныеДанные",ОписаниеОшибки());
	  ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
  КонецПопытки;
  Расчет.Вставить("ОтправленныеДанные",стр_JSON);
	Возврат Расчет;
КонецФункции


Функция ПолучитьКвитанцию_Ф103(НомерПартии,ЭтоEMS=ложь) Экспорт
	уч_данные=ПолучитьУчетныеДанные(ЭтоEMS);
	
	Сервер = "otpravka-api.pochta.ru/1.0/forms/"+НомерПартии+"/f103pdf";
	//Сервер = "otpravka.pochta.ru/document/downloadForms/1255371";
	
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(
	Новый СертификатКлиентаWindows(),
	Новый СертификатыУдостоверяющихЦентровWindows());  
	с = Новый HTTPСоединение(Сервер,,,,,,ssl);
	з = Новый HTTPЗапрос();
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Authorization", "AccessToken "+уч_данные.Токен);
	Заголовки.Вставить("X-User-Authorization", "Basic "+уч_данные.Encoded);
	
	з.Заголовки = Заголовки;
	имяФайлаОтвета=ПолучитьИмяВременногоФайла("pdf");
	стрОтвета=новый Структура;
	
	Попытка
		ответ=с.Получить(з,имяФайлаОтвета);
		строка_Ответа=ответ.ПолучитьТелоКакСтроку();
		стрОтвета.Вставить("КодСостояния",ответ.КодСостояния);
		стрОтвета.Вставить("имяФайлаОтвета",имяФайлаОтвета);
		
		Если ответ.КодСостояния=403 Тогда
			ПолученныеДанные="Нарушение доступа";
		ИначеЕсли ответ.КодСостояния=404 Тогда
			ПолученныеДанные="Заказ не найден";
		ИначеЕсли ответ.КодСостояния=500 Тогда
			ПолученныеДанные="Внутренняя ошибка сервиса";
		Конецесли;
		Двоичное=Новый ДвоичныеДанные(имяФайлаОтвета);
		Адрес=ПоместитьВоВременноеХранилище(Двоичное,Новый УникальныйИдентификатор);
		
		
		стрОтвета.Вставить("ПолученныеДанные",ПолученныеДанные);
		стрОтвета.Вставить("Адрес",Адрес);
		стрОтвета.Вставить("Успешно",Истина);
		
	Исключение
		стрОтвета.Вставить("Успешно",Ложь);
		стрОтвета.Вставить("ПолученныеДанные",ОписаниеОшибки());
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки()+ ИнформацияОбОшибке());
	КонецПопытки;
	стрОтвета.Вставить("ОтправленныеДанные",НомерПартии);
	Возврат стрОтвета;
КонецФункции	



Функция ПолучитьПечатныеФормыДоПартии(НомерЗаказа,ЭтоEMS=ложь) Экспорт
	уч_данные=ПолучитьУчетныеДанные(ЭтоEMS);
	
	Сервер = "otpravka-api.pochta.ru/1.0/forms/backlog/"+НомерЗаказа+"/forms";
	//Сервер = "otpravka.pochta.ru/document/downloadForms/1255371";
	
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(
	Новый СертификатКлиентаWindows(),
	Новый СертификатыУдостоверяющихЦентровWindows());  
	с = Новый HTTPСоединение(Сервер,,,,,,ssl);
	з = Новый HTTPЗапрос();
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Authorization", "AccessToken "+уч_данные.Токен);
	Заголовки.Вставить("X-User-Authorization", "Basic "+уч_данные.Encoded);
	
	з.Заголовки = Заголовки;
	имяФайлаОтвета=ПолучитьИмяВременногоФайла("pdf");
	стрОтвета=новый Структура;
	
	Попытка
		ответ=с.Получить(з,имяФайлаОтвета);
		
		стрОтвета.Вставить("КодСостояния",ответ.КодСостояния);
		стрОтвета.Вставить("имяФайлаОтвета",имяФайлаОтвета);
		
		Если ответ.КодСостояния=403 Тогда
			ПолученныеДанные="Нарушение доступа";
		ИначеЕсли ответ.КодСостояния=404 Тогда
			ПолученныеДанные="Заказ не найден";
		ИначеЕсли ответ.КодСостояния=500 Тогда
			ПолученныеДанные="Внутренняя ошибка сервиса";
		Конецесли;
		Двоичное=Новый ДвоичныеДанные(имяФайлаОтвета);
		Адрес=ПоместитьВоВременноеХранилище(Двоичное,Новый УникальныйИдентификатор);
		
		стрОтвета.Вставить("ПолученныеДанные",ПолученныеДанные);
		стрОтвета.Вставить("Адрес",Адрес);
		стрОтвета.Вставить("Успешно",Истина);
		
		
	Исключение
		стрОтвета.Вставить("Успешно",Ложь);
		стрОтвета.Вставить("ПолученныеДанные",ОписаниеОшибки());
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки()+ ИнформацияОбОшибке());
	КонецПопытки;
	стрОтвета.Вставить("ОтправленныеДанные",НомерЗаказа);
	Возврат стрОтвета;
КонецФункции	





Функция СформироватьПартию(МассивЗаказов,ДатаСдачи,ЭтоEMS=ложь) Экспорт
	уч_данные=ПолучитьУчетныеДанные(ЭтоEMS);
	
	
	// Вставить содержимое обработчика.
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Unix, " ", Истина); 
	з_JSON=новый ЗаписьJSON;
	з_JSON.УстановитьСтроку(ПараметрыJSON);	
	
	ЗаписатьJSON(з_JSON,МассивЗаказов);
	стр_JSON=з_JSON.Закрыть();
	
	ДатаСдачиСтрокой=Формат(ДатаСдачи,"ДФ=yyyy-MM-dd");
	Сервер = "otpravka-api.pochta.ru/1.0/user/shipment"+"?sending-date="+ДатаСдачиСтрокой;

	
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(
	Новый СертификатКлиентаWindows(),
	Новый СертификатыУдостоверяющихЦентровWindows());  
	с = Новый HTTPСоединение(Сервер,,,,,5,ssl);
	з = Новый HTTPЗапрос();
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Authorization", "AccessToken "+уч_данные.Токен);
	Заголовки.Вставить("X-User-Authorization", "Basic "+уч_данные.Encoded);
	
	з.Заголовки = Заголовки;
	
	з.УстановитьТелоИзСтроки(стр_JSON,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
	
	имяФайлаОтвета=ПолучитьИмяВременногоФайла("txt");
	стрОтвета=новый Структура;
	Попытка
		ответ=с.ОтправитьДляОбработки(з,имяФайлаОтвета);
		//имяФайлаОтвета="C:\2\Партии.txt";
		строка_Ответа=СтоСПОбмен_Общий.ФайлВСтроку(имяФайлаОтвета);
		ч_JSON=новый ЧтениеJSON;
		ч_JSON.УстановитьСтроку(строка_Ответа);
		
		стрОтвета=ОбъектJSONВструктуру(ч_JSON);
		//СформироватьДерево(ч_JSON, стрОтвета);

		стрОтвета.Вставить("ПолученныеДанные",строка_Ответа);
		стрОтвета.Вставить("Успешно",Истина);
		//Для каждого стр из стрОтвета.batches Цикл
		//	стрОтвета_ОтправкиФормыф103=ПодготовкаОтправкаФормы_Ф103(Формат(стр.batchname,"ЧГ=0"));
		//КонецЦикла
	Исключение
		стрОтвета.Вставить("Успешно",Ложь);
		стрОтвета.Вставить("ПолученныеДанные",ОписаниеОшибки());
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки()+ ИнформацияОбОшибке());
	КонецПопытки;
	стрОтвета.Вставить("ОтправленныеДанные",стр_JSON);
	Возврат стрОтвета;
	
	
	
КонецФункции	


Функция ПолучитьПакетДокументов(НомерПартии,ЭтоEMS=ложь) Экспорт
	уч_данные=ПолучитьУчетныеДанные(ЭтоEMS);
	
	Сервер = "otpravka-api.pochta.ru/1.0/forms/"+НомерПартии+"/zip-all";
	//Сервер = "otpravka.pochta.ru/document/downloadForms/1255371";
	
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(
	Новый СертификатКлиентаWindows(),
	Новый СертификатыУдостоверяющихЦентровWindows());  
	с = Новый HTTPСоединение(Сервер,,,,,,ssl);
	з = Новый HTTPЗапрос();
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Authorization", "AccessToken "+уч_данные.Токен);
	Заголовки.Вставить("X-User-Authorization", "Basic "+уч_данные.Encoded);
	
	з.Заголовки = Заголовки;
	имяФайлаОтвета=ПолучитьИмяВременногоФайла("zip");
	стрОтвета=новый Структура;
	
	Попытка
		ответ=с.Получить(з,имяФайлаОтвета);
		
		стрОтвета.Вставить("КодСостояния",ответ.КодСостояния);
		стрОтвета.Вставить("имяФайлаОтвета",имяФайлаОтвета);
		
		Если ответ.КодСостояния=403 Тогда
			ПолученныеДанные="Нарушение доступа";
		ИначеЕсли ответ.КодСостояния=404 Тогда
			ПолученныеДанные="Заказ не найден";
		ИначеЕсли ответ.КодСостояния=500 Тогда
			ПолученныеДанные="Внутренняя ошибка сервиса";
		Конецесли;
		Двоичное=Новый ДвоичныеДанные(имяФайлаОтвета);
		Адрес=ПоместитьВоВременноеХранилище(Двоичное,Новый УникальныйИдентификатор);
		
		стрОтвета.Вставить("ПолученныеДанные",ПолученныеДанные);
		стрОтвета.Вставить("Адрес",Адрес);
		стрОтвета.Вставить("Успешно",Истина);
		
		
	Исключение
		стрОтвета.Вставить("Успешно",Ложь);
		стрОтвета.Вставить("ПолученныеДанные",ОписаниеОшибки());
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки()+ ИнформацияОбОшибке());
	КонецПопытки;
	стрОтвета.Вставить("ОтправленныеДанные",НомерПартии);
	Возврат стрОтвета;
КонецФункции	


Функция ПолучитьУчетныеДанные(ЭтоEMS)
	Если не ЭтоEMS Тогда 
		Логин	= Константы.ЛогинПР.Получить();
		Пароль	= Константы.ПарольПР.Получить();
		Токен	= Константы.ТокенПочтаРоссии.Получить()
    Иначе
		ЛогинEMS= Константы.ЛогинEMS.Получить();
		Если ЛогинEMS<>"" Тогда
			Логин	= ЛогинEMS;
			Пароль	= Константы.ПарольEMS.Получить();
			Токен	= Константы.ТокенEMS.Получить()
		Конецесли;
	Конецесли;
		
	ВременныйФайл = ПолучитьИмяВременногоФайла();
	Запись 	= Новый ЗаписьТекста(ВременныйФайл, КодировкаТекста.UTF8,"",ложь,"");
	Запись.Записать(Логин+":"+Пароль);
	Запись.Закрыть();
	ДвДанные 	= Новый ДвоичныеДанные(ВременныйФайл);
	Encoded 	= Base64Строка(ДвДанные);
	Encoded 	= СтрЗаменить(Encoded,"77u/","");
	Возврат новый Структура("Логин, Пароль, Токен, Encoded",Логин, Пароль, Токен, Encoded);
КонецФункции	




#Область Вспомогательные

Функция ОбъектJSONВструктуру(ч_JSON)
	стрОтвета=Новый  Структура;	
	Пока ч_JSON.Прочитать()  Цикл
		Если ч_JSON.ТипТекущегоЗначения=ТипЗначенияJSON.КонецОбъекта Тогда
			Возврат стрОтвета;			
		КонецЕсли;		
		Если ч_JSON.ТипТекущегоЗначения=ТипЗначенияJSON.НачалоМассива Тогда			
			ч_JSON.Прочитать();
		КонецЕсли;
		Если ч_JSON.ТипТекущегоЗначения=ТипЗначенияJSON.ИмяСвойства Тогда
			ИмяСв=СтрЗаменить(ч_JSON.ТекущееЗначение,"-","");
			ч_JSON.Прочитать();
			Если ч_JSON.ТипТекущегоЗначения=ТипЗначенияJSON.НачалоОбъекта Тогда
				ЗначСв=ОбъектJSONВструктуру(ч_JSON);
			Иначе
				Если ч_JSON.ТипТекущегоЗначения=ТипЗначенияJSON.НачалоМассива Тогда			
					ЗначСв=новый Массив ;
					ч_JSON.Прочитать();
					Пока ч_JSON.ТипТекущегоЗначения<>ТипЗначенияJSON.КонецМассива Цикл
						Если ч_JSON.ТипТекущегоЗначения=ТипЗначенияJSON.НачалоОбъекта Тогда //Массив объектов ()
							ЗначСв.Добавить(ОбъектJSONВструктуру(ч_JSON));
						Иначе			//Массив элементов
							ЗначСв.Добавить(ч_JSON.ТекущееЗначение);
						КонецЕсли;		
						ч_JSON.Прочитать();
					КОнецЦикла;	
					
				Иначе
					ЗначСв=ч_JSON.ТекущееЗначение;
				КонецЕсли;
			КонецЕсли;
			стрОтвета.Вставить(ИмяСв,ЗначСв);
		КонецЕсли;
	
	КОнецЦикла;
	Возврат стрОтвета;
КонецФункции



Функция ПолучитьЗначениеПеречисления(Переч)
	
	ИмяМенеджера=Метаданные.Перечисления[Переч.Метаданные().Имя].Имя;
	Менедж=Перечисления[ИмяМенеджера];
	
	Возврат Метаданные.Перечисления[Переч.Метаданные().Имя].ЗначенияПеречисления[Менедж.Индекс(Переч)].Имя;
	
КонецФункции	


Процедура СформироватьДерево(ЧтениеJSON, Дерево)
    
    ИмяСвойства = Неопределено;
    
    Пока ЧтениеJSON.Прочитать() Цикл
        TипJSON = ЧтениеJSON.ТипТекущегоЗначения;
        
        Если TипJSON = ТипЗначенияJSON.НачалоОбъекта 
        ИЛИ TипJSON = ТипЗначенияJSON.НачалоМассива Тогда
            НовыйОбъект = ?(TипJSON = ТипЗначенияJSON.НачалоОбъекта, Новый Соответствие, Новый Массив);
            
            Если ТипЗнч(Дерево) = Тип("Массив") Тогда
                Дерево.Добавить(НовыйОбъект);
            ИначеЕсли ТипЗнч(Дерево) = Тип("Соответствие") И ЗначениеЗаполнено(ИмяСвойства) Тогда
                Дерево.Вставить(ИмяСвойства, НовыйОбъект);
            КонецЕсли;
            
            СформироватьДерево(ЧтениеJSON, НовыйОбъект);
            
            Если Дерево = Неопределено Тогда
                Дерево = НовыйОбъект;
            КонецЕсли;
        ИначеЕсли TипJSON = ТипЗначенияJSON.ИмяСвойства Тогда
            ИмяСвойства = ЧтениеJSON.ТекущееЗначение;
        ИначеЕсли TипJSON = ТипЗначенияJSON.Число 
        ИЛИ TипJSON = ТипЗначенияJSON.Строка 
        ИЛИ TипJSON = ТипЗначенияJSON.Булево 
        ИЛИ TипJSON = ТипЗначенияJSON.Null Тогда
            Если ТипЗнч(Дерево) = Тип("Массив") Тогда
                Дерево.Добавить(ЧтениеJSON.ТекущееЗначение);
            ИначеЕсли ТипЗнч(Дерево) = Тип("Соответствие") Тогда
                Дерево.Вставить(ИмяСвойства, ЧтениеJSON.ТекущееЗначение);
            КонецЕсли;
        Иначе
            Возврат;
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти
