

&НаКлиенте
Процедура Сфорировать(Команда)
	СфорироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СфорироватьНаСервере()
	
	обДокумент = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ОтчетПоБесплатнойВыдаче") );
	обДокумент.СохранитьОтправитьФайлыОтчетов(Объект.Дата);
	ЗначениеВДанныеФормы(обДокумент, Объект);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не ЗначениеЗаполнено(Объект.СвойПунктВыдачи) Тогда
		Объект.СвойПунктВыдачи = Константы.СвояТочка.Получить();
	КонецЕсли;
	Если не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата			= НачалоМесяца(ТекущаяДата())-1;
	КонецЕсли;
	ПВ 					= Формат(число(Объект.СвойПунктВыдачи.Код),"ЧЦ=4; ЧВН=; ЧГ=0;");
	объект.имяОтчета 	= формат(Объект.Дата,"ДФ=yyyy_MM_;") + ПВ		
КонецПроцедуры



&НаКлиенте
Процедура ПросмотрОтчета(Команда)
	ОткрытьФорму("Документ.ОтчетПоБесплатнойВыдаче.Форма.ФормаОтчета",новый Структура("Отчет",Объект.Отчет ) ,ЭтаФорма , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	ЗапуститьПриложение(Объект.путьФайла);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчет(Команда)
	ЗапуститьПриложение(Объект.путьОтчета);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетКурьерскойДоставки(Команда)
	ЗапуститьПриложение(Объект.ПутьОтчетаКД);
КонецПроцедуры





