Функция Получитьданные()
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Выгрузка_100СП.Ссылка КАК ВыгрузкаНаСайт
		|ИЗ
		|	Документ.Выгрузка_100СП КАК Выгрузка_100СП
		|ГДЕ
		|	Выгрузка_100СП.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Выгрузка_100СП.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(Обмен100СПрн_ОшибкиОстатки.КоличествоНеИсправленныхОстаток) КАК КоличествоНеИсправленныхОстаток
		|ИЗ
		|	РегистрНакопления.Обмен100СПрн_Ошибки.Остатки КАК Обмен100СПрн_ОшибкиОстатки";
	
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выгрузка = РезультатЗапроса[0].Выгрузить();
	Если Выгрузка.Количество()>0 Тогда
		ПоследнийДокВыгрузки = Выгрузка[0].ВыгрузкаНаСайт;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПоследнийДокВыгрузки) Тогда
		ПоследнийОбмен = ПоследнийДокВыгрузки.Дата;
	Иначе	
		ПоследнийОбмен = Дата(1,1,1);
	Конецесли;	
		
	
	
	Выгрузка = РезультатЗапроса[1].Выгрузить();
	Если Выгрузка.Количество()>0 Тогда
		КоличествоОшибок = Выгрузка[0].КоличествоНеИсправленныхОстаток;
	КонецЕсли;
	
	Возврат новый Структура("ДатаВыгрузки, КоличествоОшибок",ПоследнийОбмен, КоличествоОшибок);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДанные()

	стр = Получитьданные();
	ПоследнийОбмен = стр.ДатаВыгрузки;
	ОшибокОбмена = стр.КоличествоОшибок;
	
	Если стр.ДатаВыгрузки<НачалоДня(ТекущаяДата()) Тогда
		Элементы.ПоследнийОбмен.ЦветТекста=Новый Цвет(255, 0, 0);
	КонецЕсли;	
	Если стр.КоличествоОшибок>0 Тогда
		Элементы.ОшибокОбмена.ЦветТекста=Новый Цвет(255, 0, 0);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДанные();		
КонецПроцедуры

&НаКлиенте
Процедура ОшибокОбменаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ПараметрыОтчета = Новый Структура("СформироватьПриОткрытии", истина);
	ОткрытьФорму("Отчет.ОшибкиОбмена100СП.Форма", ПараметрыОтчета);	
КонецПроцедуры

&НаКлиенте
Процедура ПоследнийОбменНажатие(Элемент, СтандартнаяОбработка)
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос(НСтр("ru = 'Продолжить выполнение операции? Это может занять несколько минут!';"
	+ " en = 'Do you want to continue?'"), Режим, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	аСППрив.ВыполнитьВыгрузкунаСайт();
	ОбновитьДанные();

КонецПроцедуры
