
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	нзГруппыУчастников=РегистрыСведений.УчастникиВГруппах.СоздатьНаборЗаписей();
	нзГруппыУчастников.Отбор.Участник.Значение=Объект.Ссылка;
	нзГруппыУчастников.Отбор.Участник.Использование=Истина;
	нзГруппыУчастников.Прочитать();
	ЗначениеВДанныеФормы(нзГруппыУчастников,ГруппыУчастников);
КонецПроцедуры


&НаКлиенте
Процедура ГруппыУчастниковПриИзменении(Элемент)
	Элемент.ТекущиеДанные.Участник=Объект.Ссылка;
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	нзГруппыУчастников=РегистрыСведений.УчастникиВГруппах.СоздатьНаборЗаписей();
	нзГруппыУчастников=ДанныеФормыВЗначение(ГруппыУчастников,Тип("регистрсведенийнаборзаписей.участникивгруппах"));
	нзГруппыУчастников.Записать();
КонецПроцедуры

