
//Процедура Сформировать(НачалоПериода,КонецПериода) Экспорт
//	табДок= ПолучитьТабДок(НачалоПериода,КонецПериода);
//	табДок.Показать();
//	
//КонецПроцедуры	

Функция ПолучитьТабДок(НачалоПериода,КонецПериода) Экспорт
	
	Настройки=СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	Параметр=Настройки.ПараметрыДанных.НайтиЗначениеПараметра(новый ПараметрКомпоновкиДанных("НачалоПериода"));
	Если Параметр<>Неопределено Тогда
		Параметр.Значение=НачалоПериода;
		Параметр.Использование=истина;
	КонецЕсли;	
	Параметр=Настройки.ПараметрыДанных.НайтиЗначениеПараметра(новый ПараметрКомпоновкиДанных("КонецПериода"));
	Если Параметр<>Неопределено Тогда
		Параметр.Значение=КонецПериода;
		Параметр.Использование=истина;
	КонецЕсли;	
	
	ДанныеРасшифровки=новый ДанныеРасшифровкиКомпоновкиДанных;
	
	Компоновщик=новый КомпоновщикМакетаКомпоновкиДанных;
	макет = Компоновщик.Выполнить(СхемаКомпоновкиДанных,Настройки,ДанныеРасшифровки);
	процессорКД=Новый ПроцессорКомпоновкиДанных;
	процессорКД.Инициализировать(макет,,ДанныеРасшифровки);
	ПроцессорВывода=новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ТабДок=новый ТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	ПроцессорВывода.Вывести(процессорКД);
	Возврат ТабДок;	
	
КонецФункции	

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка=ложь;
	
	Настройки=СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	Параметр=Настройки.ПараметрыДанных.НайтиЗначениеПараметра(новый ПараметрКомпоновкиДанных("НачалоПериода"));
	Если Параметр<>Неопределено Тогда
		Параметр.Значение=НачалоПериода;
		Параметр.Использование=истина;
	КонецЕсли;	
	Параметр=Настройки.ПараметрыДанных.НайтиЗначениеПараметра(новый ПараметрКомпоновкиДанных("КонецПериода"));
	Если Параметр<>Неопределено Тогда
		Параметр.Значение=КонецПериода;
		Параметр.Использование=истина;
	КонецЕсли;	
	
//	ДанныеРасшифровки=новый ДанныеРасшифровкиКомпоновкиДанных;
	
	Компоновщик=новый КомпоновщикМакетаКомпоновкиДанных;
	макет = Компоновщик.Выполнить(СхемаКомпоновкиДанных,Настройки,ДанныеРасшифровки);
	процессорКД=Новый ПроцессорКомпоновкиДанных;
	процессорКД.Инициализировать(макет,,ДанныеРасшифровки);
	ПроцессорВывода=новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(процессорКД);

КонецПроцедуры
