
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//КодГородаНазначения=Параметры.КодГородаНазначения;
	ПолучитьПунктыВыдачиСДЭК();
	
КонецПроцедуры

&НаКлиенте
Процедура КодГородаНазначенияПриИзменении(Элемент)
	ПолучитьПунктыВыдачиСДЭК(); 
КонецПроцедуры


Процедура ПолучитьПунктыВыдачиСДЭК() 
	Отказ=Ложь;
	тЗ=ОбменДаннымиСДЭК.ОбменССайтомСписокТочек(КодГородаНазначения,Отказ);
	
	Если  тЗ<>неопределено Тогда
		СписокТочек.Загрузить(тз);
	КонецЕсли;
	//
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КодГородаНазначения=Параметры.КодГородаНазначения;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ОповеститьОВыборе(Элементы.СписокТочек.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокТочекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОповеститьОВыборе(Элементы.СписокТочек.ТекущиеДанные);
КонецПроцедуры



