





Процедура ВыполнитьАрхивированиеОбновление() Экспорт
	отказ=ложь;
	 аСПОбновлениеСервер.ВыполнитьПроверкиНаСервере(отказ);
	 Если отказ Тогда 
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выполнение обработки прервано.");
		 Возврат; 
	 конецЕсли;
	ФайлОбновления= аСПОбновлениеСервер.ПолучитьФайлОбновления();

	батник=аСПОбновлениеСервер.СоздатьКомандныйФайл(ФайлОбновления);
	аСПОбновлениеСервер.ЗавершитьСеансы();
	//УстановитьБлокировкуСоединенийНаСервере();
	ЗапуститьПриложение(батник);
	ЗавершитьРаботуПользователей();
КонецПроцедуры





#Область ЕщеНеРазобранно
//Процедура СформироватьБатникНаСкачивание(ИмяФайла)
//    ПутьДляОбновлений = "";
//    ПутьДляОбновлений = "D:\papka\";
//    Если ПутьДляОбновлений = Null или ПутьДляОбновлений = "" Тогда
//        Возврат;  
//    КонецЕсли;

//    ПутьНаСервере = "/OOO_Birka/";

//    //vbs
//    тек = Новый ТекстовыйДокумент;
//    тек.ДобавитьСтроку("Dim oShell ");
//    тек.ДобавитьСтроку("Set oShell = WScript.CreateObject (""WSCript.shell"") ");
//    тек.ДобавитьСтроку("oShell.run """+ СокрЛП(ПутьДляОбновлений) + "1.bat"", 0 ");
//    тек.ДобавитьСтроку("Set oShell = Nothing");
//    тек.Записать(СокрЛП(ПутьДляОбновлений) + "start.vbs",КодировкаТекста.OEM,);
//    
//    //txt
//    тек = Новый ТекстовыйДокумент;
// 
//    тек.ДобавитьСтроку("open " + Адрес);
//    тек.ДобавитьСтроку(Логин);
//    тек.ДобавитьСтроку(Пароль);
//    тек.ДобавитьСтроку("get " + СокрЛП(ПутьНаСервере) + ИмяФайла + " " + СокрЛП(ПутьДляОбновлений) + ИмяФайла);
//    тек.ДобавитьСтроку("bye");
//    тек.Записать(СокрЛП(ПутьДляОбновлений) + "conf.txt",КодировкаТекста.OEM,);
//    
//    //bat
//    тек = Новый ТекстовыйДокумент;
//    тек.ДобавитьСтроку("ftp -i -s:conf.txt");
//    тек.ДобавитьСтроку("timeout /t 3 ");
//    тек.ДобавитьСтроку("REN | RENAME " + СокрЛП(ПутьДляОбновлений) + ИмяФайла + " ok" + ИмяФайла);
//    тек.ДобавитьСтроку(СокрЛП(ПутьДляОбновлений) + "del.bat");
//    тек.Записать(СокрЛП(ПутьДляОбновлений) + "1.bat",КодировкаТекста.OEM,);
//    
//    
//    тек = Новый ТекстовыйДокумент;
//    тек.ДобавитьСтроку("del " + СокрЛП(ПутьДляОбновлений) + "conf.txt");
//    тек.ДобавитьСтроку("del " + СокрЛП(ПутьДляОбновлений) + "start.vbs");
//    тек.ДобавитьСтроку("del " + СокрЛП(ПутьДляОбновлений) + "1.bat");    тек.ДобавитьСтроку("del %0");
//    тек.Записать(СокрЛП(ПутьДляОбновлений) + "del.bat",КодировкаТекста.OEM,);

//    Запустить(ПутьДляОбновлений);
//КонецПроцедуры

//процедура Запустить(ПутьДляОбновлений)
//    КомандаСистемы(СокрЛП(ПутьДляОбновлений) + "start.vbs",СокрЛП(ПутьДляОбновлений));
//КонецПроцедуры

#КонецОбласти
