
&НаСервере
Процедура ЗаполнитьГабаритыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Габариты.Код КАК Штрихкод,
		|	Габариты.Ссылка как Ссылка,
		|	1 КАК Количество
		|ИЗ
		|	Справочник.Габариты КАК Габариты";
	
	РезультатЗапроса = Запрос.Выполнить();
    Объект.Элементы.Загрузить(РезультатЗапроса.Выгрузить());
	Для каждого элем из Объект.Элементы Цикл
		Элем.Шаблон=Шаблон;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГабариты(Команда)
	ЗаполнитьГабаритыНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Печать(Команда)
	ПараметрКоманды = Новый Массив;   // Добавим объект обработки печати ценников и этикеток в массив параметров печати.
	ПараметрКоманды.Добавить(Объект); // В дальнейшем будем обращаться к объекту через ПараметрКоманды[0]
	РежимПечати = "Этикетки";
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
	"Обработка.ПечатьСтикеровДляКоробок", // Для вызова метода менеджера обработки "Печать".
	РежимПечати,
	ПараметрКоманды,
	ЭтаФорма, // Форма владелец
	Новый Структура("Шаблон", Шаблон));

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьФКоробкиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФКоробки.Штрихкод КАК Штрихкод,
		|	ФКоробки.Ссылка как Ссылка,
		|	1 КАК Количество
		|ИЗ
		|	Документ.ФормированиеКоробки КАК ФКоробки";
	
	РезультатЗапроса = Запрос.Выполнить();
    Объект.Коробки.Загрузить(РезультатЗапроса.Выгрузить());
	Для каждого элем из Объект.Коробки Цикл
		Элем.Шаблон=Шаблон;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФКоробки(Команда)
	ЗаполнитьФКоробкиНаСервере();
КонецПроцедуры


