 &НаКлиенте
Процедура Сформировать(Команда)
	ЗаполнитьТабДок(ТабДок, Поиск,ПоискСНачалаСтроки,ПоискТочноеСоответствие,ПоИД);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаполнитьТабДок(ТабДок,Поиск,ПоискСНачалаСтроки,ПоискТочноеСоответствие,поИД)
	    
		макет=Отчеты.ПоискУчастника.ПолучитьМакет("Макет");
	   облШапка=макет.ПолучитьОбласть("Шапка");
	   облЭлемент=макет.ПолучитьОбласть("Элемент");
	   облЭлементСКартой=макет.ПолучитьОбласть("ЭлементСКартой");
	   ТабДок.Очистить();

	   ТабДок.Вывести(ОблШапка);	   
	   
	   Запрос=Новый Запрос;
	   
	   Запрос.Текст= 
	   "ВЫБРАТЬ
	   |	Участники.Код КАК код,
	   |	Участники.Ссылка КАК Наименование,
	   |	Участники.Телефон1,
	   |	Участники.Телефон2,
	   |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КартыУчастников.Ссылка) КАК КоличествоКарт
	   |ИЗ
	   |	Справочник.Участники КАК Участники
	   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КартыУчастников КАК КартыУчастников
	   |		ПО (КартыУчастников.Владелец = Участники.Ссылка)
	   |ГДЕ  "+?( не поИД,"
	   |	Участники.Наименование ПОДОБНО &Поиск СПЕЦСИМВОЛ ""\"" ","
	   |	Участники.Код = &Поиск ")+"
	   |
	   |СГРУППИРОВАТЬ ПО
	   |	Участники.Ссылка,
	   |	Участники.Код,
	   |	Участники.Телефон1,
	   |	Участники.Телефон2
	   |
	   |УПОРЯДОЧИТЬ ПО
	   |	Участники.Наименование";
	 
	   ПоискСтр=СтрЗаменить(Поиск,"%","\%");
	   ПоискСтр=СтрЗаменить(ПоискСтр,"_","\_");
	   ПоискСтр=СтрЗаменить(ПоискСтр,"[","\[");
	   Если не поИд тогда
		   Запрос.УстановитьПараметр("Поиск",?(ПоискТочноеСоответствие,ПоискСТР ,?(ПоискСНачалаСтроки,   ПоискСтр+"%","%"+ПоискСтр+"%")));
	   Иначе
		   Запрос.УстановитьПараметр("Поиск",Число(Поиск));
	   КонецЕсли;
	   Результат=Запрос.Выполнить();
	   Выборка=Результат.Выбрать();
	   Пока Выборка.Следующий()  Цикл
		   
		   
		   Если Выборка.КоличествоКарт=0 Тогда
			   облЭлемент.Параметры.Код			=Выборка.Код;
			   облЭлемент.Параметры.Наименование	=Выборка.Наименование;
			   облЭлемент.Параметры.Телефон		=Выборка.Телефон1+"; "+Выборка.Телефон2;
			   
			   ТабДок.Вывести(облЭлемент);
		   Иначе 
			   
			   облЭлементСКартой.Параметры.Код			=Выборка.Код;
			   облЭлементСКартой.Параметры.Наименование	=Выборка.Наименование;
			   облЭлементСКартой.Параметры.Телефон		=Выборка.Телефон1+"; "+Выборка.Телефон2;
			   облЭлементСКартой.Параметры.Карт			=Выборка.КоличествоКарт;
			   ТабДок.Вывести(облЭлементСКартой);
		   КонецЕсли;
	   КонецЦикла;
	   
	   
   КонецПроцедуры

   
   
&НаСервереБезКонтекста
Функция ПолучитьСтоимостьПоискаНика()
	Возврат Константы.ПоискНикаСтоимость.Получить();
КонецФункции
   
   
   

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если Элемент.ТекущаяОбласть.Текст="ДобавитьКарту>>>" Тогда
		СП_РаботаСДокументами_Клиент.ОткрытьФорму_Продажа(Новый Структура("Участник", Расшифровка));
		//СформироватьКарту(Расшифровка);
	Иначе
		СформироватьРасход(Расшифровка,ПолучитьСтоимостьПоискаНика());
	КонецЕсли;
	СтандартнаяОбработка=ложь;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКарту(Участник)
	
	форма=ПолучитьФорму("Справочник.КартыУчастников.ФормаОбъекта");
	ДанныеФормы = Форма.Объект;
	ЗаполнитьНаСервере(ДанныеФормы,Участник,"Карта",0);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	Форма.Открыть();

КонецПроцедуры
  
	
&НаКлиенте
Процедура СформироватьРасход(Участник,ПоискНикаСтоимость)
	Если   аСППрверкиКлиент.НаличиеОткрытыхОкон("Расходная") Тогда
    	Предупреждение("Существует не завершенная операция ВЫДАЧИ.Закройте все окна РАСХОДА и повторите попытку!!!",30,"Предупреждение");
		Возврат;		
	КонецЕсли;
	
	форма=ПолучитьФорму("Документ.Расходная.ФормаОбъекта",,,Истина);
	ДанныеФормы = Форма.Объект;
	ЗаполнитьНаСервере(ДанныеФормы,Участник,"Расход",ПоискНикаСтоимость);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
//	форма.КодУчастника=;
	Форма.Открыть();
КонецПроцедуры


&НаКлиенте
Процедура СформироватьПриход(РазобралиШК)
	Если   аСППрверкиКлиент.НаличиеОткрытыхОкон("Приходная") Тогда
    	Предупреждение("Существует не завершенная операция Поступления.Закройте все окна Прихода и повторите попытку!!!",30,"Предупреждение");
		Возврат;		
	КонецЕсли;
	
	форма=ПолучитьФорму("Документ.Приходная.ФормаОбъекта");
	ДанныеФормы = Форма.Объект;
	ЗаполнитьНаСервере(ДанныеФормы,РазобралиШК,"Приход",0);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	Форма.Открыть();
КонецПроцедуры

	
&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервере(НовыйОбъект,Участник,Форма,ПоискНикаСтоимость);
	
	Если Форма="Карта" Тогда
		НовыйОбъект.Владелец = Участник;
	ИначеЕсли  Форма="Расход" Тогда
		НовыйОбъект.Участник = Участник;
		НовыйОбъект.ПоискНикаСтоимость=ПоискНикаСтоимость;
		расх=ДанныеФормыВЗначение(НовыйОбъект,Тип("ДокументОбъект.Расходная"));
		расх.заполнитьОстатками();
		//расх.ЗаполнениеКодов();
		ЗначениеВДанныеФормы(расх,НовыйОбъект);
	ИначеЕсли  Форма="Приход" Тогда	
		Если Участник.СвояТочка<>Участник.ТочкаРаздачи Тогда
			НовыйОбъект.Транзит=Истина;
			НовыйОбъект.ТочкаНазначения=Участник.ТочкаРаздачи;
		КонецЕсли;	
	КонецЕсли
КонецПроцедуры


&НаКлиенте
Процедура ПоискТочноеСоответствиеПриИзменении(Элемент)
	ВидимостьПоискСначалаСтроки();
КонецПроцедуры

&НаКлиенте
Функция ВидимостьПоискСначалаСтроки()

	Если ПоискТочноеСоответствие Тогда
		Элементы.ПоискСНачалаСтроки.Видимость=ложь;
	Иначе
		Элементы.ПоискСНачалаСтроки.Видимость=Истина;
	КонецЕсли;	

КонецФункции // ВидимостьПоискСначалаСтроки()



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьЗаголовокФормы();
	//ОбщегоНазначения.ПриСозданииНаСервере(ЭтаФорма,Отказ, СтандартнаяОбработка);
	Если отказ Тогда Возврат конецЕсли;

	//МенеджерОборудования.ПриНачалеРаботыСистемы();
	ПоискСНачалаСтроки=Константы.ПоискСНачалаСтроки.Получить();
	ПоискТочноеСоответствие=Константы.ПоискТочноеСоответствие.Получить();
КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ВидимостьПоискСначалаСтроки();

	//Сканер штрихкода
  	СтоСП_Клиент.ПодключитьСканерШК(УникальныйИдентификатор);
	

	
КонецПроцедуры





&НаСервере
Процедура ОбновитьЗаголовокФормы()
	
	АвтоЗаголовок = Ложь;
	Период = ТекущаяДатаСеанса();
	
	ПредставлениеТекущейДаты = Формат(Период, "Л=ru_RU; ДФ='d MMMM, dddd'");
	
	Заголовок = СтрШаблон(НСтр("ru = 'Сегодня: %1'"), ПредставлениеТекущейДаты);
	Параметры.Заголовок = Заголовок;
КонецПроцедуры


&НаКлиенте
Процедура СчитатьШтрихКодВручную(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаВводаШК",,ЭтотОбъект,,,,Новый ОписаниеОповещения("ВвестиШтрихКодВручную_Завершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗакрытаРасходная" Тогда
		ЭтаФорма.ТекущийЭлемент	= Элементы.Поиск;
	 	Элементы.Поиск.АктивизироватьПоУмолчанию=Истина;
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура ВвестиШтрихКодВручную_Завершение(ШК, ДополнительныеПараметры) Экспорт
	ДанныеШК = новый массив;
	ДанныеШК.Добавить(ШК);
	ДанныеШК.Добавить(неопределено);
	глОбработкаОповещения("ScanData",ДанныеШК,"ПодключаемоеОборудование");	// Вставить содержимое обработчика.
КонецПроцедуры	

