
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	
	ВнешняяКомпонента = Обработки.ПечатьЭтикетокИЦенников.ПодключитьВнешнююКомпонентуПечатиШтрихкода(); 
	Макет = Справочники.МестаХранения.ПолучитьМакет("ШК");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МестаХранения.Код,
	|	МестаХранения.Наименование
	|ИЗ
	|	Справочник.МестаХранения КАК МестаХранения
	|ГДЕ
	|	МестаХранения.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();
	
	
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьШК=Область.Области.Шапка;
		РисунокШтрихкод=Область.Рисунки.РисунокШтрихкод;
		//РисунокШтрихкод.Объект.ТипКода = ТипШтрихкода;
		
		
		
		ПараметрыШтрихкода=ЗаполнитьПараметрыОбработки("63"+Выборка.Код+"0");
		РисунокШтрихкод.Картинка = Обработки.ПечатьЭтикетокИЦенников.ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШтрихкода);
		РисунокШтрихкод.Расположить(ОбластьШК);
		
		
		
	//	рис.Объект.Сообщение=Выборка.Ссылка.Штрихкод;
		Область.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Область, Выборка.Уровень());
		
		
	КонецЦикла;
	
	

	//}}
КонецПроцедуры


Функция ЗаполнитьПараметрыОбработки(Код)
	ПараметрыШтрихкода=новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",50);
	ПараметрыШтрихкода.Вставить("Высота",30);
	ПараметрыШтрихкода.Вставить("ТипКода",1);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",истина);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",12);
	ПараметрыШтрихкода.Вставить("Штрихкод","123456789101");
	ПараметрыШтрихкода.Штрихкод=Код;
	
	Возврат ПараметрыШтрихкода;	
	
КонецФункции	
