
&НаКлиенте
Процедура ПриОткрытии(Отказ)
   СтоСП_Клиент.ПодключитьСканерШК(УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование                
	Если 	ИмяСобытия 	= "ScanData" 					и
			Источник 	= "ПодключаемоеОборудование" 	и
			ВводДоступен()										Тогда
			
			ШК 			= СтоСП_Клиент.ПолучитьШКизПараметров(Параметр);
			ДанныеШК = ОбработатьШК(ШК);
			Если ДанныеШК.Администратор Тогда
				Закрыть(ДанныеШК);
			КонецЕсли
	КонецЕсли;
	// Конец ПодключаемоеОборудование

КонецПроцедуры


функция ОбработатьШК(ШК)
	ДанныеШК    = СП_Штрихкоды.ПолучитьДанныеПоШК(ШК);
	Если Строка(ДанныеШК.Тип) = "Сотрудник (55)" Тогда
		Если не ДанныеШК.Сотрудник.Администратор Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сотрудник "  + ДанныеШК.Сотрудник + Символы.ПС+
														  	  "Не является администратором!");
		КонецЕсли;	
			
		ДанныеШК.Вставить("Администратор",ДанныеШК.Сотрудник.Администратор);
	Иначе	
		ДанныеШК.Вставить("Администратор",Ложь);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не верный штрих код:"  + ШК + Символы.ПС+
														  "Ожидается штрих код сотрудника!");
	КонецЕсли;	
	Возврат ДанныеШК;
КонецФункции

&НаКлиенте
Процедура ОбработатьШКнаКлиенте(ШК)
	ДанныеШК    = СП_Штрихкоды.ПолучитьДанныеПоШК(ШК);
	Если Строка(ДанныеШК.Тип) = "Сотрудник (55)" 			Тогда
		
	КонецЕсли	
КонецПроцедуры