#Область ШтрихКоды

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		Если Источник = "ПодключаемоеОборудование" и Источник = "ПодключаемоеОборудование"   и не (АктивноеОкно()=неопределено или АктивноеОкно().Основное) и АктивноеОкно().Содержимое[0]=ЭтаФорма Тогда
		Если ИмяСобытия = "ScanData"  Тогда
			ШК = СтоСП_Клиент.ПолучитьШКизПараметров(Параметр);
			ПолученыШтрихкоды(ШК);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкоды(ШК) Экспорт
		Если не СтрНачинаетсяС(ШК,"22") Тогда
			#Если не вебклиент Тогда
				Сигнал();
			#КонецЕсли
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не вреный тип штрихкода!!!");
			Возврат;
		КонецЕсли;
		
		Если СтрДлина(ШК)=7 Тогда
			КодКарты	=	Сред(ШК,3,5);
		ИначеЕсли СтрДлина(ШК)=8 Тогда
			КодКарты	=	Сред(ШК,3,6);
		Иначе
			#Если не вебклиент Тогда
			Сигнал();
			#КонецЕсли
			Сообщить("Не вреный тип штрихкода!!!");
			Возврат;
		КонецЕсли;
		Объект.Код	= Число(КодКарты);
КонецПроцедуры // ПолученыШтрихкоды()


#КонецОбласти

#Область ШтрихКоды
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Сканер штрихкода
   СтоСП_Клиент.ПодключитьСканерШК(УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Статус.Доступность=РольДоступна("ПолныеПрава");
	Если ЗначениеЗаполнено(Параметры.Участник) Тогда
		Объект.Владелец = Параметры.Участник;
		Объект.Участник = Параметры.Участник;
	Конецесли;	
	Если ЗначениеЗаполнено(Параметры.КодКарты) Тогда
		Объект.Код = Параметры.КодКарты;
	Конецесли;
	Если не ЗначениеЗаполнено(Объект.Статус) Тогда
		Объект.Статус = Перечисления.СтатусКартыУчастника.НеЗарегистрирована;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") и ВладелецФормы.ИмяФормы = "Документ.Расходная.Форма.ФормаДокумента" Тогда
		ОповеститьОВыборе(Объект.Ссылка);
	Иначе	
		//док	= СП_РаботаСоСправочниками.СформироватьДокумент_Продажа(Объект.Ссылка);
		//ОткрытьЗначение(док);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти