Процедура ЗаполнитьПоМассивуКоробок(МассДляОтправления) Экспорт

	Для каждого элем из МассДляОтправления Цикл
		Стр=Группы.Добавить();
		Стр.Группа=элем;
	КонецЦикла;
	Участник=элем.УчастникГД;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоробкиСостав.Участник КАК Участник,
		|	КоробкиСостав.Покупка КАК Покупка,
		|	КоробкиСостав.Ссылка КАК Группа,
		|	КоробкиСостав.КодЗаказа КАК КодЗаказа
		|ИЗ
		|	Справочник.Коробки.Состав КАК КоробкиСостав
		|ГДЕ
		|	КоробкиСостав.Ссылка В(&МассивКоробок)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Группа,
		|	Участник,
		|	Покупка";
	
	Запрос.УстановитьПараметр("МассивКоробок", МассДляОтправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	Состав.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры


Процедура ОтправитьНаСайт() Экспорт
	Отказ=Ложь;
	
	
	ОтправленныеДанные=ПолучитьСтрокуЗапроса();
	
	ПолученныеДанные="";
	СтрокаПротокола=ПротоколыПередач.Добавить();
	СтрокаПротокола.ДатаНачала=ТекущаяДата();
	ИмяФайлаОтвета=Отправить(ОтправленныеДанные);
	
	Если аспПроцедурыОбменаДанными.АвторизацияВыполнена(ИмяФайлаОтвета) Тогда
		СтрокаПротокола.Результат="Авторизация выполнена";
	Иначе
		СтрокаПротокола.Результат="Авторизация не выполнена";
	КонецЕсли;	 
	Если ЗначениеЗаполнено(ИмяФайлаОтвета) Тогда
		ПолученныеДанные=ФайлВСтроку(ИмяФайлаОтвета);
		тз=аспПроцедурыОбменаДанными.ОбработатьОбъединениеГруппыДоставки(ПолученныеДанные);
		строкаТЗ=тз[0];
		Если строкаТЗ.result="ok" Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Была создана группа доставки №"+строкаТЗ.deliveryGroupId);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ОШИБКА :"+Символы.ПС+строкаТЗ.message);
		КонецЕсли;	
	Иначе
		СтрокаПротокола.Результат="Нет ответа";
	КонецЕсли;
	СтрокаПротокола.ДатаОкончания=ТекущаяДата();	
	
	
	
КонецПроцедуры	


Функция Отправить(Отправили) 
	Параметры    = новый Структура;
	Параметры.Вставить("token",Константы.Токен.Получить());
	Параметры.Вставить("xml", СтрЗаменить(Отправили,"xmlns=""http://www.100sp.ru/XMLSchema-instance"" ",""));
	АдресСкрипта = Константы.АдресВыгрузкиНасайт.Получить();
	ПолученныйФайл=СтоСПОбмен_Общий.ПолучитьПостЗапросом(Параметры,АдресСкрипта);
	Возврат ПолученныйФайл;
	
КонецФункции

Функция ФайлВСтроку(ИмяФайлаОтвета)
		ТекстФайла="";
		Текст=Новый ЧтениеТекста;
		Текст.Открыть(ИмяФайлаОтвета,КодировкаТекста.UTF8);
		Стр = Текст.ПрочитатьСтроку();
		Пока Стр <> Неопределено Цикл 
			ТекстФайла=ТекстФайла+Стр;
			Стр = Текст.ПрочитатьСтроку();
		КонецЦикла;
		/////
		ТекстФайла=СтрЗаменить(ТекстФайла,"<auth>","<auth>"+Символы.ПС);
		ТекстФайла=СтрЗаменить(ТекстФайла,"</auth>","</auth>"+Символы.ПС);
		ТекстФайла=СтрЗаменить(ТекстФайла,"<groups>","<groups>"+Символы.ПС);
		ТекстФайла=СтрЗаменить(ТекстФайла,"<group",Символы.ПС+"<group");
		ТекстФайла=СтрЗаменить(ТекстФайла,"</group",Символы.ПС+"</group");
		ТекстФайла=СтрЗаменить(ТекстФайла,"</groups>","</groups>"+Символы.ПС);
		ТекстФайла=СтрЗаменить(ТекстФайла,"</barcode>","</barcode>"+Символы.ПС);
		ТекстФайла=СтрЗаменить(ТекстФайла,"</distributorName>","</distributorName>"+Символы.ПС);
		ТекстФайла=СтрЗаменить(ТекстФайла,"</ownerName>","</ownerName>"+Символы.ПС);
		ТекстФайла=СтрЗаменить(ТекстФайла,"</ordersNumber>","</ordersNumber>"+Символы.ПС);
		ТекстФайла=СтрЗаменить(ТекстФайла,"</code>","</code>"+Символы.ПС);
		ТекстФайла=СтрЗаменить(ТекстФайла,"</createdAt>","</createdAt>"+Символы.ПС);
		ТекстФайла=СтрЗаменить(ТекстФайла,"</name>","</name>"+Символы.ПС);
		ТекстФайла=СтрЗаменить(ТекстФайла,"</result>","</result>"+Символы.ПС);
		Возврат ТекстФайла ;
КонецФункции




 
 Функция ПолучитьСтрокуЗапроса() 
	 ЗаписьXML=новый ЗаписьXML;
	 ЗаписьXML.УстановитьСтроку("UTF-8");
	 ЗаписьXML.ЗаписатьНачалоЭлемента("distributors");
	 
	 ЗаписьXML.ЗаписатьАтрибут("xmlns:xsi","http://www.w3.org/2001/XMLSchema-instance");
	 ЗаписьXML.ЗаписатьАтрибут("xmlns:xsd","http://www.w3.org/2001/XMLSchema");
	 
	 ЗаписьXML.ЗаписатьНачалоЭлемента("groupsCreate");
	 ЗаписьXML.ЗаписатьНачалоЭлемента("group");
	 
	 Для каждого стр из Состав Цикл 
		 Если не стр.Подбор Тогда Продолжить; КонецЕсли;
		 Если стр.ВыборАдреса Тогда
		 	ЗаписьXML.ЗаписатьНачалоЭлемента("mainOrder");
		 Иначе
			 ЗаписьXML.ЗаписатьНачалоЭлемента("order");
		 КонецЕсли;	 

			 ЗаписьXML.ЗаписатьНачалоЭлемента("orderType");
			 ЗаписьXML.ЗаписатьТекст("sp");
			 ЗаписьXML.ЗаписатьКонецЭлемента( );

		 Если стр.КодЗаказа="" Тогда

			 
			 ЗаписьXML.ЗаписатьНачалоЭлемента("uid");
			 ЗаписьXML.ЗаписатьТекст(Формат(Число(стр.Участник.Код),"ЧГ=0"));
			 ЗаписьXML.ЗаписатьКонецЭлемента();
			 
			 //ЗаписьXML.ЗаписатьНачалоЭлемента("id");
			 //ЗаписьXML.ЗаписатьТекст(Формат(Число(стр.КодЗаказа),"ЧГ=0"));
			 //ЗаписьXML.ЗаписатьКонецЭлемента();
			 
		     ЗаписьXML.ЗаписатьНачалоЭлемента("pid");
		     ЗаписьXML.ЗаписатьТекст(Формат(Число(стр.Покупка.Код),"ЧГ=0"));
		     ЗаписьXML.ЗаписатьКонецЭлемента();
		 Иначе
		     ЗаписьXML.ЗаписатьНачалоЭлемента("orderId");
		     ЗаписьXML.ЗаписатьТекст(Формат(Число(стр.КодЗаказа),"ЧГ=0"));
		     ЗаписьXML.ЗаписатьКонецЭлемента();
		 КонецЕсли;
		 
		 ЗаписьXML.ЗаписатьКонецЭлемента();
		 
			 
		 
	 КонецЦикла;
	 ЗаписьXML.ЗаписатьКонецЭлемента();
	 ЗаписьXML.ЗаписатьКонецЭлемента();		 
	 
	 ЗаписьXML.ЗаписатьКонецЭлемента();	
	 
	 Возврат ЗаписьXML.Закрыть();
КонецФункции	

