
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
КонецПроцедуры


&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	ВнешняяКомпонента = Обработки.ПечатьЭтикетокИЦенников.ПодключитьВнешнююКомпонентуПечатиШтрихкода(); 
	Макет = Справочники.Габариты.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();
	
		ОбластьШК=Область.Области.Шапка;
		РисунокШтрихкод=Область.Рисунки.РисунокШтрихкод;
		//РисунокШтрихкод.Объект.ТипКода = ТипШтрихкода;
		
		
		
		ПараметрыШтрихкода=ЗаполнитьПараметрыОбработки("66"+"0000002000");
		РисунокШтрихкод.Картинка = Обработки.ПечатьЭтикетокИЦенников.ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШтрихкода);
		РисунокШтрихкод.Расположить(ОбластьШК);
		
		
		
	//	рис.Объект.Сообщение=Выборка.Ссылка.Штрихкод;
		Область.Параметры.Наименование="Снять установить отдельным местом ";
		ТабДок.Вывести(Область);
		                                                                                                   
																										   
		
КонецПроцедуры


Функция ЗаполнитьПараметрыОбработки(Код)
	ПараметрыШтрихкода=новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",50);
	ПараметрыШтрихкода.Вставить("Высота",30);
	ПараметрыШтрихкода.Вставить("ТипКода",1);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",истина);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",12);
	ПараметрыШтрихкода.Вставить("Штрихкод","123456789101");
	ПараметрыШтрихкода.Штрихкод=Код;
	
	Возврат ПараметрыШтрихкода;	
	
КонецФункции	
