
&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
	ОбновитьОтображениеДанных();
КонецПроцедуры

Процедура ОтправитьНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ЗапросыГруппДоставки"));
	об.ОтправитьНаСайт();
	об.ПолучитьИзмененныеГруппыСсайта();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры





&НаКлиенте
Процедура РазобратьОтвет(Команда)
	РазобратьОтветНаСервере();
КонецПроцедуры

Процедура РазобратьОтветНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ЗапросыГруппДоставки"));
	об.ОбработатьПолученныеДанные();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры



&НаСервере
Процедура СформироватьXMLНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ЗапросыГруппДоставки"));
	об.ЗаполнитьОтправленныеДанные();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьXML(Команда)
	СформироватьXMLНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	об = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ЗапросыГруппДоставки"));
	об.ЗаполнитьТаблицыДокумента();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПеренестиВУдалениеНаСервере()
	Для каждого Элем Из Объект.ЗапросыИсключения Цикл
		обГруппа = Элем.ГруппаДоставки.ПолучитьОбъект();
		масСтрок = обГруппа.Состав.НайтиСтроки(новый Структура("Исключить", Истина));
		Для каждого строкаСостава из масСтрок Цикл
			строкаСостава.Исключить = Ложь;
			строкаСостава.Удалить	= Истина;
		КонецЦикла;
		обГруппа.Записать();
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВУдаление(Команда)
	ПеренестиВУдалениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДвижения(Команда)
	ДляОтбора = Новый Структура();
	ДляОтбора.Вставить("Покупка", 	Элементы.ЗапросыУдаления.ТекущиеДанные.Покупка);
	ДляОтбора.Вставить("Участник", 	Элементы.ЗапросыУдаления.ТекущиеДанные.Участник);
	фрм=ПолучитьФорму("РегистрНакопления.Транзит.ФормаСписка",новый Структура("ДляОтбора",ДляОтбора),ЭтаФорма);
	фрм.Открыть();
КонецПроцедуры
