
&НаКлиенте
Процедура РаспознатьАдреса(Команда)
	РаспознатьАдресаНаСервере()
КонецПроцедуры

Процедура РаспознатьАдресаНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ЗапросАдресов"));
	об.РаспознатьАдреса();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры

&НаСервере
Процедура СформироватьХМЛНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ЗапросАдресов"));
	об.СериолизоватьВХМЛ();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьХМЛ(Команда)
	СформироватьХМЛНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ЗапросАдресов"));
	об.ОтправитьНаСайт();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры
