
Процедура Чек(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.Движение.ПолучитьМакет("Чек");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДвижениеПокупки.Ссылка.Номер КАК Номер,
		|	ДвижениеПокупки.Ссылка.Дата КАК Дата,
		|	ДвижениеПокупки.Покупка.Владелец.Наименование КАК Организатор,
		|	ДвижениеПокупки.Покупка КАК Покупка,
		|	ДвижениеПокупки.Участник,
		|	ДвижениеПокупки.Количество КАК Количество
		|ИЗ
		|	Документ.Движение.Покупки КАК ДвижениеПокупки
		|ГДЕ
		|	ДвижениеПокупки.Ссылка.Ссылка В(&Ссылка)
		|ИТОГИ
		|	МАКСИМУМ(Номер),
		|	МАКСИМУМ(Дата),
		|	СУММА(Количество)
		|ПО
		|	Организатор,
		|	Покупка";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();

	ВыборкаОрганизатор = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПокупкиШапка = Макет.ПолучитьОбласть("ПокупкиШапка");
	ОбластьПокупки = Макет.ПолучитьОбласть("Покупки");
	ОбластьПокупкаГруппа = Макет.ПолучитьОбласть("ПокупкаГруппа");
	ТабДок.Очистить();


	Пока ВыборкаОрганизатор.Следующий() Цикл



		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(ВыборкаОрганизатор);
		ТабДок.Вывести(Шапка);


		ВыборкаПокупка = ВыборкаОрганизатор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаПокупка.Следующий() Цикл
			ОбластьПокупкаГруппа.Параметры.Заполнить(ВыборкаПокупка);
			ТабДок.Вывести(ОбластьПокупкаГруппа);
			ВыборкаДетальныеЗаписи = ВыборкаПокупка.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

				ОбластьПокупки.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
				ТабДок.Вывести(ОбластьПокупки);
			КонецЦикла;
		КонецЦикла;

	КонецЦикла;
	//}}
КонецПроцедуры

Процедура Списание(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Списание)
	Макет = Документы.Движение.ПолучитьМакет("Списание");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Движение.Дата,
	|	Движение.Номер,
	|	Движение.Покупки.(
	|		НомерСтроки,
	|		Покупка,
	|		МестоХранения,
	|		Габарит,
	|		Участник,
	|		Партия
	|	)
	|ИЗ
	|	Документ.Движение КАК Движение
	|ГДЕ
	|	Движение.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПокупкиШапка = Макет.ПолучитьОбласть("ПокупкиШапка");
	ОбластьПокупки = Макет.ПолучитьОбласть("Покупки");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПокупкиШапка);
		ВыборкаПокупки = Выборка.Покупки.Выбрать();
		Пока ВыборкаПокупки.Следующий() Цикл
			ОбластьПокупки.Параметры.Заполнить(ВыборкаПокупки);
			ТабДок.Вывести(ОбластьПокупки, ВыборкаПокупки.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
