
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСписки();
	Заголовок=Формат(Параметры.ДатаКалендаря,"ДЛФ=DD");
КонецПроцедуры

Процедура ОбновитьСписки()
		Супергруппы.Параметры.УстановитьЗначениеПараметра("НачалоПериода",НачалоДня(Параметры.ДатаКалендаря));
		Супергруппы.Параметры.УстановитьЗначениеПараметра("КонецПериода",КонецДня(Параметры.ДатаКалендаря));
		Элементы.Супергруппы.Обновить();
КонецПроцедуры	


&НаКлиенте
Процедура ЗаполнитьКоленоМаршрута(Команда)
	структура_Параметров=Новый Структура();
	
	структура_Супергруппа=Новый Структура();
	структура_Супергруппа.Вставить("Супергруппа"		,Элементы.Супергруппы.ТекущиеДанные.СуперГруппа);
	структура_Супергруппа.Вставить("НомерКолена"		,Элементы.Супергруппы.ТекущиеДанные.КоленоМаршрута);
	структура_Параметров.Вставить("УстанавливаемФакт",структура_Супергруппа);
	
	
	ОткрытьФорму("Документ.ЗаполнитьКоленоМаршрута.Форма.ФормаДокументаУстанавливаемФакт",структура_Параметров,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	Форма_ЗаполнитьКоленоМаршрута=ПолучитьФорму("Документ.ЗаполнитьКоленоМаршрута.Форма.ФормаДокументаУстанавливаемФакт",структура_Параметров,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно);
//	Если Форма_ЗаполнитьКоленоМаршрута<> Неопределено Тогда
//		Форма_ЗаполнитьКоленоМаршрута.Открыть();
//	КонецЕсли;
//	ЭтаФорма.Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияСупергруппы(Команда)
	структура_Параметров=Новый Структура();
	
	структура_Супергруппа=Новый Структура();
	структура_Супергруппа.Вставить("Супергруппа"		,Элементы.Супергруппы.ТекущиеДанные.СуперГруппа);
	структура_Супергруппа.Вставить("НомерКолена"		,Элементы.Супергруппы.ТекущиеДанные.КоленоМаршрута);
	структура_Параметров.Вставить("УстанавливаемФакт",структура_Супергруппа);
	
	ОткрытьФорму("Документ.РегистрацияСупперГруппы.Форма.ФормаДокумента",структура_Параметров,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	Форма_ЗаполнитьКоленоМаршрута=ПолучитьФорму("Документ.РегистрацияСупперГруппы.Форма.ФормаДокумента",структура_Параметров,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно);
//	Если Форма_ЗаполнитьКоленоМаршрута<> Неопределено Тогда
//		Форма_ЗаполнитьКоленоМаршрута.Открыть();
//	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СупергруппыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.Мегаордера.Форма.ФормаМаршрута",Новый Структура("Ключ",Элементы.Супергруппы.ТекущиеДанные.СуперГруппа),ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	фрм=ПолучитьФорму("Справочник.Мегаордера.Форма.ФормаМаршрута",Новый Структура("Ключ",Элементы.Супергруппы.ТекущиеДанные.СуперГруппа));
//	фрм.Открыть() ;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ОбновитьФорму" Тогда	
       Элементы.Супергруппы.Обновить();
	КонецЕсли;

КонецПроцедуры
