
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	
	//форма=ПолучитьФорму("Обработка.ПечатьСтикеровДляКоробок.Форма");
	//ДанныеФормы = Форма.Объект;
	//ПечатьГрупповыхСтикеров(ПараметрКоманды,ДанныеФормы);
	//КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	//
	//ПараметрКоманды = Новый Массив;   // Добавим объект обработки печати ценников и этикеток в массив параметров печати.
	//ПараметрКоманды.Добавить(Форма.Объект); // В дальнейшем будем обращаться к объекту через ПараметрКоманды[0]
	РежимПечати = "Этикетки";
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
	"Обработка.ПечатьСтикеровДляКоробок", // Для вызова метода менеджера обработки "Печать".
	РежимПечати,
	ПараметрКоманды,
	, // Форма владелец
	//Новый Структура("Шаблон", Шаблон));
	);
КонецПроцедуры

//&НаСервере
//Процедура   ПечатьГрупповыхСтикеров(ПараметрКоманды,ДанныеФормы)
//	Объект=ДанныеФормыВЗначение(ДанныеФормы,Тип("ОбработкаОбъект.ПечатьСтикеровДляКоробок"));
//	Объект.ЗаполнитьКоробки(ПараметрКоманды);
//	ЗначениеВДанныеФормы(Объект,ДанныеФормы);
//КонецПроцедуры

//Функция ПолучитьШаблонНаСервере()
//	Возврат Константы.ШаблонПечатиГрупповыхСтикеров.Получить();
//КонецФункции	
