#Область Раз
Процедура Запустить_Выгрузку_100СП() экспорт
	
	СтоСПОбмен_Посылки.ВыгрузитьНеВыгруженныеПосылки();	
	
	
	пакет=Документы.Выгрузка_100СП.СоздатьДокумент();
	пакет.Дата=ТекущаяДата();
	ОбъектовКВыгрузке=пакет.ЗаполнитьНеОтправленными();
	
	Если ОбъектовКВыгрузке=0 Тогда Возврат КонецЕсли;
	пакет.Записать(РежимЗаписиДокумента.Запись);
	//пакет.СкомпоноватьДляВыгрузки();
	пакет.ВыгрузитьНаСайт();
	Если пакет.Статус=Перечисления.СтатусОтпавкиНаСайт.Отправлен Тогда
		Попытка
		    Пакет.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписьЖурналаРегистрации("Обмен100СП.ЗаписьПакета",УровеньЖурналаРегистрации.Ошибка,пакет,,
										ОписаниеОшибки());
		КонецПопытки;
	Иначе	
		Попытка
			пакет.Статус=Перечисления.СтатусОтпавкиНаСайт.Сформирован;
		    Пакет.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ЗаписьЖурналаРегистрации("Обмен100СП.ЗаписьПакета",УровеньЖурналаРегистрации.Ошибка,пакет,,
										ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
