
Процедура ШК(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ШК)
	ВнешняяКомпонента = Обработки.ПечатьЭтикетокИЦенников.ПодключитьВнешнююКомпонентуПечатиШтрихкода(); 

	Макет = Справочники.Номенклатура.ПолучитьМакет("ШК");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Код,
	|	Номенклатура.Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		
		ОбластьШК=Шапка.Области.Шапка;
		РисунокШтрихкод=Шапка.Рисунки.РисунокШтрихкод;

		ПараметрыШтрихкода=ЗаполнитьПараметрыОбработки("61"+Выборка.Код+"00000");
		РисунокШтрихкод.Картинка = Обработки.ПечатьЭтикетокИЦенников.ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШтрихкода);
		РисунокШтрихкод.Расположить(ОбластьШК);
		
		

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры



Функция ЗаполнитьПараметрыОбработки(Код)
	ПараметрыШтрихкода=новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",50);
	ПараметрыШтрихкода.Вставить("Высота",30);
	ПараметрыШтрихкода.Вставить("ТипКода",1);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",истина);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",12);
	ПараметрыШтрихкода.Вставить("Штрихкод","123456789101");
	ПараметрыШтрихкода.Штрихкод=Код;
	
	Возврат ПараметрыШтрихкода;	
	
КонецФункции	
