Процедура ПолучитьАдрес()
	//МассСтрок=Объект.Состав.НайтиСтроки(Новый Структура("Подбор",Истина)); 
	ТЗ=Объект.Состав.Выгрузить(Новый Структура("Подбор",Истина),"Участник,Покупка");
	ТЗ.колонки.Добавить("Адрес");
	тзАдреса=СПЗаказыТК.ПолучитьАдресаНаТЗЗаказов(ТЗ);

КонецПроцедуры	

&НаКлиенте
Процедура ВыбратьАдрес(Команда)
	ФРМ=ПолучитьФорму("Обработка.ФормированиеЗаказовТК.Форма.ФормаВыбораАдреса",новый Структура("ВыбранныеСтроки,Источник",Объект.Состав,"ОбъединениеГД"),ЭтаФорма);
	Если ФРМ.Адреса.Количество()=0 Тогда
		//СформироватОТправлениеТранзита();
	ИначеЕсли ФРМ.Адреса.Количество()=1 Тогда
		ПометитьВыбранныйАдрес(ФРМ.Адреса[0]);
	Иначе
		ФРМ.открыть();
	Конецесли;	
	
//	ПолучитьАдрес();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ПометитьВыбранныйАдрес(ВыбранноеЗначение)
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВыбранныйАдрес(ВыбранноеЗначение)
	Объект.Адрес=ВыбранноеЗначение.Адрес+Символы.ПС+
	ВыбранноеЗначение.ФИО+Символы.ПС+
	ВыбранноеЗначение.Телефон+Символы.ПС+
	ВыбранноеЗначение.Тип+Символы.ПС+
	ВыбранноеЗначение.КодПВЗ+Символы.ПС+
	ВыбранноеЗначение.email+Символы.ПС;
	уч=ВыбранноеЗначение.Участник;
	пк=ВыбранноеЗначение.Покупка;
	массСтрок=Объект.Состав.НайтиСтроки(новый Структура("Покупка,Участник",пк,уч));
	массСтрок[0].ВыборАдреса=Истина;
	
КонецПроцедуры	

Процедура ОтправитьНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ОбъединениеГруппДоставки"));
	об.ОтправитьНаСайт();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры

&НаКлиенте
Процедура Объединить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПодсветкаСтрок()

    ЭтаФорма.УсловноеОформление.Элементы.Очистить();
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Состав");
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Покупки.ВыборАдреса");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Зеленый);	
	
	
КонецПроцедуры // ПодсветкаСтрок()



