
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаТарифовПоНаравлениямТарифы.Габарит,
		|	УстановкаТарифовПоНаравлениямТарифы.Стоимость,
		|	ТарифнаяГруппаКуда.Город КАК Куда,
		|	ТарифнаяГруппаОткуда.Город КАК Откуда,
		|	УстановкаТарифовПоНаравлениямТарифы.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.УстановкаТарифовПоНаравлениям.Тарифы КАК УстановкаТарифовПоНаравлениямТарифы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТарифнаяГруппа.ГородаСП КАК ТарифнаяГруппаОткуда
		|		ПО УстановкаТарифовПоНаравлениямТарифы.Откуда = ТарифнаяГруппаОткуда.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТарифнаяГруппа.ГородаСП КАК ТарифнаяГруппаКуда
		|		ПО УстановкаТарифовПоНаравлениямТарифы.Куда = ТарифнаяГруппаКуда.Ссылка
		|ГДЕ
		|	УстановкаТарифовПоНаравлениямТарифы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Движения.ТарифыПоНаправлениям.Записывать = Истина;
	Движения.ТарифыПоНаправлениям.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры
