Функция ЧекНЗРасходная(ДанныеПечати) Экспорт
	
	Если ТипЗнч(ДанныеПечати) = Тип("СправочникСсылка.Участники") Тогда
		ТабДок						= СтоСП_Печать.ТабДок_РасходнаяЧекНЗ_ПоУчастнику(ДанныеПечати);	
	Иначе 		
		СтруктураОбъекта			= ДанныеПечати.Форма.Объект;
		ТабДок						= СтоСП_Печать.ТабДок_РасходнаяЧекНЗ(СтруктураОбъекта);
	КонецЕсли;
	ТабДок.ОтображатьСетку 		= 	Ложь;
	ТабДок.АвтоМасштаб			=	Истина;
	ТабДок.ПолеСлева			=	0;
	ТабДок.ПолеСправа			=	0;
	ТабДок.Защита 				= 	Ложь;
	ТабДок.ТолькоПросмотр 		= 	Ложь;
	ТабДок.ОтображатьЗаголовки 	= 	Ложь;
	ТабДок.Показать();
	//ТабДок.Напечатать();
КонецФункции	


Функция ЧекНЗПередачаВозвратаОрганизатору(ДанныеПечати) Экспорт
	
	СтруктураОбъекта			= ДанныеПечати.Форма.Объект;
	ТабДок						= СтоСП_Печать.ТабДок_ПередачаВозвратовОрганизаторуЧекНЗ(СтруктураОбъекта);

	ТабДок.ОтображатьСетку 		= 	Ложь;
	ТабДок.АвтоМасштаб			=	Истина;
	ТабДок.ПолеСлева			=	0;
	ТабДок.ПолеСправа			=	0;
	ТабДок.Защита 				= 	Ложь;
	ТабДок.ТолькоПросмотр 		= 	Ложь;
	ТабДок.ОтображатьЗаголовки 	= 	Ложь;
	ТабДок.Показать();
	//ТабДок.Напечатать();
КонецФункции	

Процедура ЧекПоступленияПоОрганизаторам_Завершение(МассивОрганизаторов,ДопПараметры) Экспорт

	массивДокументов = ДопПараметры.ОбъектыПечати;
	ТабДок						=   СтоСП_Печать.ТабДок_ЧекаПоступления(массивДокументов, массивДокументов,МассивОрганизаторов);
	ТабДок.ОтображатьСетку 		= 	Ложь;
	ТабДок.АвтоМасштаб			=	Истина;
	ТабДок.ПолеСлева			=	0;
	ТабДок.ПолеСправа			=	0;
	ТабДок.Защита 				= 	Ложь;
	ТабДок.ТолькоПросмотр 		= 	Ложь;
	ТабДок.ОтображатьЗаголовки 	= 	Ложь;
	ТабДок.Показать();	
КонецПроцедуры	

Функция ЧекПоступленияПоОрганизаторам(ДанныеПечати) Экспорт
	
	массивДокументовДляПечати  = ДанныеПечати.ОбъектыПечати;
//	тзОрганизаторов = СтоСП_Печать.ПолучитьОрганизаторовВЧекеПоступления(массивДокументовДляПечати);
	
	ОткрытьФорму("ЖурналДокументов.ВсеПриходы.Форма.ФормаПечатиЧекаПоОрганизатору",
					новый Структура("ОбъектыПечати", массивДокументовДляПечати) , 
					ДанныеПечати.Форма, , , , 
					новый ОписаниеОповещения("ЧекПоступленияПоОрганизаторам_Завершение",ЭтотОбъект ,новый Структура("ОбъектыПечати", массивДокументовДляПечати)  ),
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
//ОткрытьФорму("ОбщаяФорма.ФормаВводаШК",,ЭтотОбъект,,,,Новый ОписаниеОповещения("ВвестиШтрихКодВручную_Завершение", ЭтотОбъект));
	//ТабДок.Напечатать();
КонецФункции	


Функция СписокЗаказов(ДанныеПечати) Экспорт
	
	массивДокументовДляПечати  = ДанныеПечати.ОбъектыПечати;
//	тзОрганизаторов = СтоСП_Печать.ПолучитьОрганизаторовВЧекеПоступления(массивДокументовДляПечати);
	
	ОткрытьФорму("Отчет.СписокЗаказовДокумента.Форма.ФормаОтчета",
					новый Структура("ОбъектыПечати,СформироватьПриОткрытии", массивДокументовДляПечати, истина) , 
					ДанныеПечати.Форма, , , , 
					//новый ОписаниеОповещения("ЧекПоступленияПоОрганизаторам_Завершение",ЭтотОбъект ,новый Структура("ОбъектыПечати", массивДокументовДляПечати)  ),
					,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
//ОткрытьФорму("ОбщаяФорма.ФормаВводаШК",,ЭтотОбъект,,,,Новый ОписаниеОповещения("ВвестиШтрихКодВручную_Завершение", ЭтотОбъект));
	//ТабДок.Напечатать();
КонецФункции	
