Функция ОформитьВозвратГруппыВстатусеЗапросОплаты(ГруппаДоставки) Экспорт
	документОтправления = ГруппаДоставки.ОтправлениеТранзита;
	Если не ЗначениеЗаполнено(документОтправления) Тогда
		ТекстСообщения = "Не найден документ отправления для: "+ГруппаДоставки;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат неопределено;
	Конецесли;	
	документВозврата = Документы.ВозвратПокупокОрганизатору.СоздатьДокумент();
	документВозврата.Заполнить(документОтправления);
	
	Возврат документВозврата;
КонецФункции

