
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.КПолучению.Записывать = Истина;
	Для Каждого ТекСтрокаПокупки Из Покупки Цикл
		Движение = Движения.КПолучению.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Покупка = ТекСтрокаПокупки.Покупка;
		Движение.Участник = ТекСтрокаПокупки.Участник;
		Движение.ДокументВыдачи = ТекСтрокаПокупки.ДокументВыдачи;
		Движение.Количество = ТекСтрокаПокупки.Количество-ТекСтрокаПокупки.РеальноеКоличество;
	КонецЦикла;
КонецПроцедуры
