
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ДвиженияСтатусыДоставкиСвернуто(Отказ, РежимПроведения);

	
	
	
КонецПроцедуры

Процедура ДвиженияСтатусыДоставкиСвернуто(Отказ, Режим)
	Движения.СтатусыДоставкиСвернуто.Записывать = Истина;
	Движение = Движения.СтатусыДоставкиСвернуто.Добавить();
	Движение.Период = Дата;
	Движение.Статус = Перечисления.СтатусыОтправкиГруза.ОтПоставщика;
	Движение.ЗаявкаВТК=Документы.ЗаявкаВТранспортнуюКомпанию.ПустаяСсылка();
	Движение.Количество=Количество;
	Движение.КоличествоГС=0;
	Движение.КоличествоМест=КоличествоМест;
КонецПроцедуры
