
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не ЗначениеЗаполнено(Параметры.Супергруппа) Тогда
		ТолькоПросмотр	= Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Редактировать супергруппу можно только из документа ""Выдача транзита""",,,,);
	КонецЕсли;
	ЗаполнитьПоСупергруппе();
	Если Объект.Супергруппа.ПерваяТочкаПриема	<> Константы.СвояТочка.Получить() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Редактировать Супергруппу может только с пункта выдачи отправителя: "+Объект.Супергруппа.ПерваяТочкаПриема,,,,Отказ);
		Возврат;
	КонецЕсли;	
КонецПроцедуры


Процедура ЗаполнитьПоСупергруппе()
	Если ЗначениеЗаполнено(Параметры.Супергруппа) Тогда
		Объект.Супергруппа			= Параметры.Супергруппа;
	КонецЕсли;
	Объект.ДокументОснование		= Объект.Супергруппа.Покупка;
	Объект.Комментарий				= Объект.Супергруппа.Комментарий;
	Объект.ТочкаНазначения			= Объект.Супергруппа.ПунктВыдачи;
	Объект.Маршрут.Загрузить(Объект.Супергруппа.Маршрут.Выгрузить());
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьФорму");
КонецПроцедуры
