
Процедура ОбработкаПроведения(Отказ, Режим)

	

	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ТипЗнч(ТекСтрокаТовары.Номенклатура) 	= Тип("СправочникСсылка.КартыУчастников") И
			 ТекСтрокаТовары.Номенклатура.Владелец 	= Справочники.Участники.нулевой		Тогда
			ПараметрыКарты = новый Структура;
			ПараметрыКарты.Вставить("Владелец", Участник);
			ПараметрыКарты.Вставить("Участник", Участник);
			СП_РаботаСоСправочниками.ОбновитьКартуУчастника(ТекСтрокаТовары.Номенклатура,ПараметрыКарты);
		КонецЕсли;	
		
		Движение 				= Движения.Продажи.Добавить();
		Движение.Период 		= Дата;
		Движение.Участник 		= Участник;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.количество		= ТекСтрокаТовары.Количество;
		Движение.Стоимость 		= ТекСтрокаТовары.Сумма;
	КонецЦикла;
КонецПроцедуры


Процедура ДобавитьТовар(Номенклатура) Экспорт
	новыйТовар	= Товары.Добавить();	
	новыйТовар.Номенклатура	= Номенклатура;
	новыйТовар.Количество	= 1;
	новыйТовар.Цена			= Номенклатура.Цена;
	новыйТовар.Сумма		= новыйТовар.Количество * новыйТовар.Цена;
КонецПроцедуры	