
&НаКлиенте
Процедура Выбрать(Команда)
	Закрыть(новый структура("КодПВ, КодГорода",Элементы.Список.ТекущиеДанные.Код,Элементы.Список.ТекущиеДанные.КодГорода));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Результат = Интеграция_DPD.ПолучитьСписокПунктовСОграничениеПоВесу(,?(Параметры.Свойство("ГородНазначения"),Параметры.ГородНазначения,Константы.СвояТочка.Получить().ГородСП.Наименование ));
	Если Результат.ОписаниеОшибки = "" Тогда
		Список.Загрузить(Результат.СписокГородов);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Результат.ОписаниеОшибки);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка =Ложь;
	Закрыть(новый структура("КодПВ, КодГорода",Элементы.Список.ТекущиеДанные.Код,Элементы.Список.ТекущиеДанные.КодГорода));
КонецПроцедуры
