
&НаСервере
Процедура ПолучитьПосылкиНаСервере()
	Результат	= СтоСПОбмен_Посылки_ПоЗакзу.Загрузить(Покупка, Участник);	// Вставить содержимое обработчика.
	Если 	Результат.авторизацияВыполнена и
			Результат.Результат.Количество()>0	Тогда
		Посылки.Очистить();
		Для каждого элем из Результат.Результат[0].Посылки Цикл 
			новая_Посылка			= Посылки.Добавить();
			новая_Посылка.Посылка	= Элем.значение;
			новая_Посылка.ШК		= Элем.значение.ШК;
			СП_РаботаСоСправочниками.ОбновитьМегаордерПосылки(новая_Посылка.ШК,новая_Посылка.Посылка);
			
		КонецЦикла;
	КонецЕсли;	
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПосылки(Команда)
	ПолучитьПосылкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Если элементы.посылки.ТекущиеДанные = неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать посылку!");
		Возврат;
	КонецЕсли;	
	Закрыть(Новый Структура("Посылка, ШК",Элементы.Посылки.ТекущиеДанные.Посылка, Элементы.Посылки.ТекущиеДанные.ШК));
КонецПроцедуры


Процедура УстановитьВидимость()
	Элементы.Посылки.Видимость 			= (Посылки.Количество()>0);
	Элементы.ФормаВыбрать.Доступность	= Элементы.Посылки.Видимость;
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимость();
	Покупка		= Параметры.Покупка;
	Участник	= Параметры.Участник;
КонецПроцедуры
