

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтоСПОбмен_Сообщения.ПолучитьДиалог(Запись.mdid);
	Переписка.Параметры.УстановитьЗначениеПараметра("mdid",Запись.mdid);
	Переписка.Параметры.УстановитьЗначениеПараметра("User",Запись.user);
КонецПроцедуры

&НаСервере
Процедура ПолучитьСообщенияДиалогаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСообщенияДиалога(Команда)
	СтоСПОбмен_Сообщения.ПолучитьДиалог(Запись.mdid);
	Элементы.Переписка.Обновить();
КонецПроцедуры



&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	КлючЗаписи=СтоСПОбмен_Сообщения.ОтправитьСообщение(Запись.mdid,НовоеСообщение);
	Если КлючЗаписи<>Неопределено Тогда
		Элементы.Переписка.Обновить();
		НовоеСообщение="";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция  ОставитьНеПрочитаннымНаСервере()
	КлючЗаписи=СтоСПОбмен_Сообщения.СделатьДиалогНеПрочитанным(Запись.mdid);
	Возврат КлючЗаписи;
КонецФункции

&НаКлиенте
Процедура ОставитьНеПрочитанным(Команда)
	КлючЗаписи=ОставитьНеПрочитаннымНаСервере();
	Если КлючЗаписи<>Неопределено Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры
