
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаПокупки Из Покупки Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Габарит = ТекСтрокаПокупки.Габарит;
		Движение.Участник = ТекСтрокаПокупки.Участник;
		Движение.МестоХранения = ТекСтрокаПокупки.МестоХранения;
		Движение.Покупка = ТекСтрокаПокупки.Покупка;
		Движение.Партия = ТекСтрокаПокупки.Партия;
		Движение.Оплачен = ТекСтрокаПокупки.Оплачен;
		Движение.Потерян = ТекСтрокаПокупки.Потерян;
		Движение.Количество = ТекСтрокаПокупки.Количество;
	КонецЦикла;
	Движения.Транзит.Записывать = Истина;
	Для Каждого ТекСтрокаТранзиты Из Транзиты Цикл
		Движение = Движения.Транзит.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Габарит = ТекСтрокаТранзиты.Габарит;
		Движение.Участник = ТекСтрокаТранзиты.Участник;
		Движение.МестоХранения = ТекСтрокаТранзиты.МестоХранения;
		Движение.Партия = ТекСтрокаТранзиты.Партия;
		Движение.ПокупкаСсылка = ТекСтрокаТранзиты.ПокупкаСсылка;
		Движение.Точка = ТекСтрокаТранзиты.Точка;
		Движение.Количество = ТекСтрокаТранзиты.Количество;
	КонецЦикла;
	

КонецПроцедуры

