Процедура СформироватьОтчет()
	СписокДокументовПараметр = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение;
	
	Если ТипЗнч(СписокДокументовПараметр) = Тип("СписокЗначений") Тогда
		СписокДокументов = СписокДокументовПараметр;
	Иначе
		СписокДокументов = новый СписокЗначений();
		СписокДокументов.Добавить(СписокДокументовПараметр);
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходнаяПосылки.Посылка КАК Посылка
		|ИЗ
		|	Документ.Приходная.Посылки КАК ПриходнаяПосылки
		|ГДЕ
		|	ПриходнаяПосылки.Ссылка В (&СписокДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РазборКоробкиПосылки.Посылка
		|ИЗ
		|	Документ.РазборКоробки.Посылки КАК РазборКоробкиПосылки
		|ГДЕ
		|	РазборКоробкиПосылки.Ссылка В (&СписокДокументов)";
	
	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	МассивПосылок = РезультатЗапроса.выгрузить().ВыгрузитьКолонку("Посылка");
	
	Если МассивПосылок.Количество()>0 Тогда
		СписокПосылок = Новый СписокЗначений;
		СписокПосылок.ЗагрузитьЗначения(МассивПосылок);
 		СтоСПОбмен_Посылки.Загрузить_СоставПосылкиПоКодам(СписокПосылок);
 	КонецЕсли;	
	

	

	СкомпоноватьРезультат();
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьОтчет();
КонецПроцедуры
	