
&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	ВыполнитьКомандуНаСервере(ДатаНачала,ДатаОкончания);
КонецПроцедуры


Процедура ВыполнитьКомандуНаСервере(ДатаНачала,ДатаОкончания)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыдачаТранзитаПокупки.Ссылка
		|ПОМЕСТИТЬ Сбор
		|ИЗ
		|	Документ.ВыдачаТранзита.Покупки КАК ВыдачаТранзитаПокупки
		|ГДЕ
		|	(ВыдачаТранзитаПокупки.СтоимостьХранения <> 0
		|			ИЛИ ВыдачаТранзитаПокупки.Ссылка.СтоимостьХранения <> 0)
		|	И ВыдачаТранзитаПокупки.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыдачаТранзитаПокупки.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасходнаяПокупки.Ссылка
		|ИЗ
		|	Документ.Расходная.Покупки КАК РасходнаяПокупки
		|ГДЕ
		|	(РасходнаяПокупки.СтоимостьХранения <> 0
		|			ИЛИ РасходнаяПокупки.Ссылка.ПоискНикаСтоимость <> 0
		|			ИЛИ РасходнаяПокупки.Ссылка.СтоимостьИтого <> 0)
		|	И РасходнаяПокупки.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяПокупки.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сбор.Ссылка
		|ИЗ
		|	Сбор КАК Сбор
		|
		|СГРУППИРОВАТЬ ПО
		|	Сбор.Ссылка.Дата,
		|	Сбор.Ссылка";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		об=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка)=Тип("ДокументСсылка.ВыдачаТранзита") Тогда
			об.СтоимостьХранения=0;
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка)=Тип("ДокументСсылка.Расходная") Тогда
			об.СтоимостьИтого=0;
			об.ПоискНикаСтоимость=0;
		КонецЕсли;	
		
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка)=Тип("ДокументСсылка.Расходная") Тогда
			Для каждого стр из об.Покупки Цикл
				стр.СтоимостьИтого=0;
				стр.СтоимостьДоставки=0;	
				стр.СтоимостьХранения= 0;
			КонецЦикла;
		Иначе
			Для каждого стр из об.Покупки Цикл
				стр.СтоимостьХранения= 0;
			КонецЦикла;
		КонецЕсли;
		Если  ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			Попытка
				об.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести "+Об);
			КонецПопытки;
		Иначе
			Попытка
				об.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать "+Об);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаНачала=НачалоМесяца(НачалоМесяца(ТекущаяДата())-1);
	ДатаОкончания=КонецМесяца(НачалоМесяца(ТекущаяДата())-1);

КонецПроцедуры
