
&НаСервере
Функция  ОтправитьНаСервере(Парам)
	Если не ПроверитьЗаполнение() Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните параметры диалога!");
		Возврат неопределено; 
	КонецЕсли;
	Возврат СтоСПОбмен_Сообщения.СоздатьДиалог(Парам);
	
КонецФункции






&НаКлиенте
Процедура Отправить(Команда)

	Парам = новый Структура;
	Парам.Вставить("Оппонент"	, Оппонент);
	Парам.Вставить("Покупка" 	, Покупка);
	Парам.Вставить("Сообщение"  , Сообщение);
	Парам.Вставить("Тема" 		, Тема);

	КлючЗаписи=ОтправитьНаСервере(Парам);
	
	Если КлючЗаписи<>Неопределено Тогда
		ОповеститьОВыборе(КлючЗаписи);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПокупкаПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Покупка) Тогда
		Тема=Покупка.Наименование;
		Элементы.Тема.Доступность=Ложь;
	Иначе
		Элементы.Тема.Доступность=Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПокупкаПриИзменении(Элемент)
	ПокупкаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Оппонент = Параметры.Оппонент;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПокупки(Команда)
	Оповещение = Новый ОписаниеОповещения("ВыбратьПокупку_Завершение",ЭтотОбъект);
	ОткрытьФорму("Обработка.ОбменСообщениями100СП.Форма.ФормаВыбораПокупки",новый Структура("Участник",Оппонент),ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПокупку_Завершение(ПараметрПокупка, Параметр) экспорт
	Покупка = ПараметрПокупка;
	ПокупкаПриИзмененииНаСервере();
КонецПроцедуры


//&НаКлиенте
//Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
//	Если ЗавершениеРаботы Тогда
//        Возврат;
//    КонецЕсли; 
//    СтандартнаяОбработка = Ложь;
//    Отказ = Истина;
//    ПодключитьОбработчикОжидания("ЗакрытьПоОсобенному", 0.1, Истина);
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗакрытьПоОсобенному()
//    Закрыть("Таки вот...");
//КонецПроцедуры