
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ЗагрузитьГородаНаСервере();
КонецПроцедуры
&НаСервере
Процедура ЗагрузитьГородаНаСервере()
	добавленныеГорода=новый СписокЗначений;
	
	списокГородов=Интеграция_BoxBerry.ПолучитьСписокГородов();
	Для каждого стр из списокГородов.result Цикл
		элГород=Справочники.ГородаBoxBerry.НайтиПоКоду(стр.Code);
		Если не ЗначениеЗаполнено(элГород) Тогда
			обГород=Справочники.ГородаBoxBerry.СоздатьЭлемент();
			обГород.Код=стр.Code;
		Иначе
			обГород=элГород.ПолучитьОбъект();
		КонецЕсли;	
		обГород.Наименование=стр.Name;
		Попытка
			обГород.Записать();
			добавленныеГорода.Добавить(обГород.Ссылка);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГородаBoxBerry.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ГородаBoxBerry КАК ГородаBoxBerry
		|ГДЕ
		|	НЕ ГородаBoxBerry.Ссылка В (&добавленныеГорода)";
	
	Запрос.УстановитьПараметр("добавленныеГорода", добавленныеГорода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		об=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		об.УстановитьПометкуУдаления(истина);
	КонецЦикла;
КонецПроцедуры

