
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ЗагрузитьПунктыВылачиНаСервере();
КонецПроцедуры
&НаСервере
Процедура ЗагрузитьПунктыВылачиНаСервере()
	добавленныеГорода=новый СписокЗначений;
	
	списокГородов=Интеграция_BoxBerry.ПолучитьСписокТочек();
	Для каждого стр из списокГородов.result Цикл
		элГород=Справочники.ПунктыВыдачиBoxBerry.НайтиПоКоду(стр.Code);
		Если не ЗначениеЗаполнено(элГород) Тогда
			обГород=Справочники.ПунктыВыдачиBoxBerry.СоздатьЭлемент();
			обГород.Код=стр.Code;
		Иначе
			обГород=элГород.ПолучитьОбъект();
		КонецЕсли;	
		обГород.Наименование=стр.Name;
		ЗаполнитьЗначенияСвойств(обГород,стр);
		обГород.Город=Справочники.ГородаBoxBerry.НайтиПоКоду(стр.CityCode);
		
		Попытка
			обГород.Записать();
			добавленныеГорода.Добавить(обГород.Ссылка);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПунктыВыдачиBoxBerry.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПунктыВыдачиBoxBerry КАК ПунктыВыдачиBoxBerry
		|ГДЕ
		|	НЕ ПунктыВыдачиBoxBerry.Ссылка В (&добавленныеГорода)";
	
	Запрос.УстановитьПараметр("добавленныеГорода", добавленныеГорода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		об=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		об.УстановитьПометкуУдаления(истина);
	КонецЦикла;
КонецПроцедуры

