&НаКлиенте
Процедура ОтобратьПоЗаявке()
	Если ОтбиратьПоЗаявкам Тогда
		Элементы.Заказы.ОтборСтрок=Новый ФиксированнаяСтруктура("Заявка",Элементы.ЗаявкиВТК.ТекущиеДанные.Заявка);
	Иначе
		Элементы.Заказы.ОтборСтрок=неопределено;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ЗаявкиВТКПриАктивизацииЯчейки(Элемент)
	ОтобратьПоЗаявке();
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоЗаявкамПриИзменении(Элемент)
	ОтобратьПоЗаявке();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("ОбновитьВсеЗаявки");
КонецПроцедуры



Процедура УстановитьВидимость()
	Элементы.ГруппаЗаявкиТК.Видимость=не Объект.ГруппыДоставки;
	Элементы.ЗаказыЗаявка.Видимость=не Объект.ГруппыДоставки;
	
КонецПроцедуры	


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры
